[
  {
    "text": "January 28, 2026From Mahomes to Hostetler: Ranking every Super Bowl QB by their top card salesDrake Maye, Sam Darnold will join 67 other QBs who have got the nod in the big gameRead the story-->\n\nDrake Maye, Sam Darnold will join 67 other QBs who have got the nod in the big game\n\nFrom Mahomes to Hostetler: Ranking every Super Bowl QB by their top card sales\nDrake Maye, Sam Darnold will join 67 other QBs who have got the nod in the big game\nFrom vintage grails to USFL cards to 1/1 grails, the most expensive cards for Super Bowl QBs run the gamut.\nBy\nKevin Jackson\n—\nJanuary 28, 2026\nShare\nNew England's Drake Maye and Seattle's Sam Darnold will join an exclusive club on Super Bowl Sunday.\nOnly 67 men have ever started at quarterback in football's biggest game, and Maye and Darnold will join the ranks of those who have played the most pressure-packed position in sports in front of a TV audience expected to top 125 million viewers.\nAs the Patriots and Seahawks prepare to clash in Super Bowl LX (6:30 p.m. ET on NBC) in Santa Clara, California, cllct decided to rank all the Super Bowl quarterbacks ... by their collectibility.\nSo, we dug into Card Ladder and found the top sale for every QB who has ever started a Super Bowl ... plus the two newbies in 2026.\nLet's check out the list:\n1. Patrick Mahomes, Chiefs: $4,300,000\nSuper Bowls started:\nLIV, LV, LVII, LVIII, LIX\nTop card:\n2017 National Treasures Platinum Shield 1/1 Rookie Patch Autograph\nNotes:\nWith five Super Bowl appearances in his first seven seasons, Mahomes has placed himself among the all-time greats with three MVP performances in the big game. Mahomes' 2017 National Treasures Platinum Shield 1/1 Rookie Patch Autograph became the most valuable football card of all time in a July 2021 sale.\n2. Tom Brady, Patriots and Bucs: $3,800,000\nSuper Bowls started:\nXXXVI, XXXVIII, XXXIX, XLII, XLVI, XLIX, LI, LII, LIII, LV\nTop card:\n2000 Playoff Contenders Championship Ticket Autograph /100\nNotes:\nBrady might be the undisputed GOAT when it comes to championship success, having won seven Super Bowls and started 10, but he ranks No. 2 on the all-time card list behind Mahomes.\n3. Joe Burrow, Bengals: $1,700,000\nSuper Bowl started:\nLVI\nTop card:\n2020 Panini National Treasures Rookie Patch Autograph Platinum NFL Shield 1/1\nNotes:\nBurrow took the Bengals to the Super Bowl at just 25, but the four seasons since that 2022 game have ended in frustration for the former Heisman Trophy winner.\n4. Terry Bradshaw, Steelers: $430,500\nSuper Bowls started:\nIX, X, XIII, XIV\nTop card:\n1971 Topps\nNotes:\nAlways at his best in Super Bowls, Bradshaw went 4-0 as Pittsburgh won four titles in six seasons. The list takes a big drop after starting with three seven-digit sales, but it's still nice to see a vintage card such as Bradshaw's rookie come in at No. 4.\n5. Bart Starr, Packers: $288,000\nSuper Bowls started:\nI, II\nTop card:\n1957 Topps\nNotes:\nA five-time NFL champion, Starr led the Packers to victory in the first two Super Bowl...",
    "title": "January 28, 2026From Mahomes to Hostetler: Ranking every Super Bowl QB by their top card salesDrake Maye, Sam Darnold will join 67 other QBs who have got the nod in the big gameRead the story-->",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/from-mahomes-to-hostetler-ranking-every-super-bowl-qb-by-their-top-card-sales",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:34:54.882552",
    "summary": "Drake Maye, Sam Darnold will join 67 other QBs who have got the nod in the big game"
  },
  {
    "text": "Topps' 'Alter Ego' inserts poised to be hobby’s next big chase cardsWith comic book-style art, the \"Alter Ego\" set depicts MLB stars as superheroesJanuary 29, 2026\n\nWith comic book-style art, the \"Alter Ego\" set depicts MLB stars as superheroes\n\nTopps' 'Alter Ego' inserts poised to be hobby’s next big chase cards\nWith comic book-style art, the \"Alter Ego\" set depicts MLB stars as superheroes\nAlter Ego artist Michael Blaskewicz says he wanted to depict the players as they would appear on \"movie posters.\" (Credit: Topps)\nBy\nBen Burrows\n—\nJanuary 29, 2026\nShare\nTopps hopes it has created the hobby’s newest chase in this golden age of insert cards after the debut of its \"Alter Ego\" set last month.\nReleased as part of 2025 Topps Chrome Update, Alter Ego features 10 of Major League Baseball’s most important stars — both current and retired — drawn as superheroes.\nThe first major auction for an Alter Ego card delivered on those expectations earlier this month when the Shohei Ohtani “Sho Time” Superfractor 1/1, which depicts the Los Angeles Dodgers two-way star in white gloves with a top hat conjuring his samurai alter ego,\nsold for $105,000 in Fanatics Collect’s January Premier Auction\n.\nAccording to Card Ladder’s records, that result is the highest for any Ohtani insert sold at public auction and easily eclipses the previous public record of $6,999 paid for any other Alter Ego card.\nThough the cards have a comic book art style — something collectors have heavily gravitated toward in recent years with popular sets such as\nPanini America’s Kaboom\nor Manga and Leaf’s Anime Nation — Alter Ego artist Michael Blaskewicz credits his childhood room covered in posters of everything from Rickey Henderson, Lawrence Taylor and the Bash Brothers (Oakland Athletics sluggers Jose Canseco and Mark McGwire) to hip-hop groups KMD and Boogie Down Productions.\n“I thought of them as what their movie poster image would be,” Blaskewicz told cllct. “So instead of a comic book, flat, two dimensional with lines that will get sort of blurred out in a very small print, I thought of these as this would be the alter ego of that comic book, as if someone made a movie about them.”\nPrior to drawing Alter Ego cards, Blaskewicz had experience creating similar work through challenges from his sons, which could involve a request for Batman fighting \"Star Wars\" icon Boba Fett — but Boba Fett also had horns.\nBlaskewicz was first introduced to Topps in 2019 for baseball card-inspired community artwork, but that project was eventually cancelled due to the COVID-19 pandemic. Blaskewicz and Topps later reconnected when he shared super hero-inspired art of Henderson following the Hall of Famer’s death in 2024.\nThose sketches led to what Blaskewicz describes as a pilot program, which featured designs for Henderson (Man of Steal), Aaron Judge (All Rise) and Pete Alonso (Polar Bear).\nThe set eventually launched with 10 players, rounded out by Ohtani (Sho Time), Ronald Acuña Jr. (La Bestia), Francis...",
    "title": "Topps' 'Alter Ego' inserts poised to be hobby’s next big chase cardsWith comic book-style art, the \"Alter Ego\" set depicts MLB stars as superheroesJanuary 29, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/topps-alter-ego-inserts-poised-to-be-hobby-s-next-big-chase-cards",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:34:55.805673",
    "summary": "With comic book-style art, the \"Alter Ego\" set depicts MLB stars as superheroes"
  },
  {
    "text": "eBay to add Card Ladder data to its price guideCard Ladder is one of the leading tools for tracking sales in the hobbyJanuary 28, 2026\n\nCard Ladder is one of the leading tools for tracking sales in the hobby\n\neBay to add Card Ladder data to its price guide\nCard Ladder is one of the leading tools for tracking sales in the hobby\neBay has made a number of updates and integrations to help card buyers make smarter purchases. (Credit: Getty Images)\nBy\nWill Stern\n—\nJanuary 28, 2026\nShare\neBay announced it will begin utilizing the Card Ladder Index to support its price guide starting Wednesday.\nCard Ladder, owned by Collectors, is one of the leading data bases for tracking card sales in the industry and has long tracked eBay sales. It also provides indices for specific players, sports and categories.\nCard Ladder will help collectors track trends around the latest card sales. (Credit: eBay)\n“The addition of Card Ladder data to eBay trading card listings further streamlines the research and shopping experience for enthusiasts and collectors, offering a richer understanding of the collecting landscape,” said Adam Ireland, eBay's vice president and general manager of global collectibles, in a statement. “This new feature is another example of our commitment to the trading card community – with pricing, population size, and now broader industry insights via Card Ladder data, all in one convenient place.”\nThe indices will be seen by users on the “view item” page via the card scanning feature by users with the latest version of the eBay app.\nThis comes after a flurry of\nupdates and integrations to the eBay app\nfor card buyers, including the integration of new vaulting, grading and population information services in the past year.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "eBay to add Card Ladder data to its price guideCard Ladder is one of the leading tools for tracking sales in the hobbyJanuary 28, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/ebay-to-add-card-ladder-data-to-its-price-guide",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:34:56.632811",
    "summary": "Card Ladder is one of the leading tools for tracking sales in the hobby"
  },
  {
    "text": "'This isn't me:' Seven MLB error cards featuring photos of the wrong playerNew Hall of Famer Carlos Beltran is among the players with incorrect photos on their cardsJanuary 21, 2026\n\nNew Hall of Famer Carlos Beltran is among the players with incorrect photos on their cards\n\n'This isn't me:' Seven MLB error cards featuring photos of the wrong player\nNew Hall of Famer Carlos Beltran is among the players with incorrect photos on their cards\nCarlos Beltran, Jerry Snyder and Gary Pettis are among the players with incorrect photos on their baseball cards.\nBy\nBen Burrows\n—\nJanuary 21, 2026\nShare\nThey say a picture is worth 1,000 words ... but sometimes those words come from a different book.\nWhen Carlos Beltran was elected to the Baseball Hall of Fame on Tuesday night, collectors might have started searching for his key rookie cards.\nHere's the problem: One of those cards, Beltran's 1995 Topps Traded rookie features a photo that is not the eventual Hall of Fame outfielder, but instead is a picture of a teammate who never climbed higher than Class AA.\nBut Beltran isn't alone with this photo error — in fact, he's not even the first Hall of Famer to have an image of someone else pictured on his card.\nHere are seven baseball cards featuring an unfortunate case of mistaken identity.\n1995 Topps Traded Carlos Beltran\nBeltran was elected to Cooperstown with 84% of the vote, but anyone hunting for his flagship rookie card will likely be disappointed.\nIncluded in 1995 Topps Traded, the front of Beltran’s rookie with the Kansas City Royals actually shows teammate Juan LeBron, an outfielder who would play 12 seasons of professional baseball, but never reached higher than AA in the United States.\nAccording to GemRate, Beltran’s mistaken rookie is by far his most graded card with more than 2,400 authenticated by PSA. PSA adds a designation reading “UER: Juan LeBron Pictured” to each.\nThe public record for the card, according to data tool Card Ladder, is the $1,138 paid for a BGS 10 Pristine example on eBay in 2005.\nRELATED STORIES:\nBaseball's 10 best error cards: From \"F--- FACE\" to \"No Name on Front\"\nJackson Holliday pays homage to Billy Ripken error card with 'Fun Face' pose\nWeirdest baseball cards ever: These 10 feature strange images\n1988 Topps Al Leiter\nThough Leiter would eventually become a two-time All-Star and three-time World Series champion, he wasn’t exactly a recognizable face during rookie camp.\nAccording to Leiter, he was confused for teammate Steve George by photographers when they mistakenly read the “SG” written on George’s glove as Leiter’s No. 56 jersey.\nThe error was eventually discovered when Leiter was asked to sign a copy for a kid at a Little League banquet in New Jersey.\n“Kid came up and said ‘Mr. Leiter, Topps just came out with the ‘88 set, and I have your card, would you sign it?’”\nLeiter told MLB Network in 2021\n.\n“Yeah, of course, kid. He runs over to his table, he comes back, and he plops this in front of me. Immediately I look, and I’...",
    "title": "'This isn't me:' Seven MLB error cards featuring photos of the wrong playerNew Hall of Famer Carlos Beltran is among the players with incorrect photos on their cardsJanuary 21, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/this-isnt-me-seven-mlb-error-cards-featuring-photos-of-the-wrong-player",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:34:57.455324",
    "summary": "New Hall of Famer Carlos Beltran is among the players with incorrect photos on their cards"
  },
  {
    "text": "Sam Darnold’s card market surges with Seattle's Super Bowl runDarnold's market has jumped 110% in the last year amid his career resurgence with the SeahawksJanuary 27, 2026\n\nDarnold's market has jumped 110% in the last year amid his career resurgence with the Seahawks\n\nSam Darnold’s card market surges with Seattle's Super Bowl run\nDarnold's market has jumped 110% in the last year amid his career resurgence with the Seahawks\nSam Darnold has won 14 games in consecutive seasons and will start his first Super Bowl for the Seahawks on Feb. 8. (Credit: Getty Images)\nBy\nBen Burrows\n—\nJanuary 27, 2026\nShare\nSam Darnold, the former No. 3 overall pick turned NFL journeyman, has finally bucked the bust narrative with an improbable career revival, and his sports card market has followed suit.\nDarnold and the Seattle Seahawks will face the New England Patriots and Drake Maye in Super Bowl LX on Feb. 8, delivering a matchup of a former collector favorite with a current hobby darling.\nMaye has been arguably the NFL's most collectible player during his historic sophomore season — his nearly 42,000 sales tracked data tool Market Movers over the last 30 days and the more than 208,000 sales over the last 365 days both rank No. 1 among football players over those respective periods.\nSam Darnold's 2018 Panini National Treasures Stars & Striples RPA sold for $10,081 at Alt in November. (Credit: Alt)\nDarnold’s market has orchestrated its own surge, particularly over the last week, after collectors more or less abandoned hope for a turnaround when the USC product bounced from the Jets to the Panthers and 49ers before finally breaking out with Minnesota in 2024.\nMarket Movers has tracked more than 5,900 sales for Darnold over the last year, with more than 1,100 of those finalizing in the last seven days.\nOf the football players tracked by Market Movers, those 5,900 sales for Darnold rank just 87th over the last year. Over the last week, which included a 346-yard, three-touchdown performance in a victory over the Los Angeles Rams in the NFC Championship Game, Darnold’s 1,100 sales ranks seventh.\nOverall, Darnold’s cards tracked by Market Movers are up 110% in price collectively over the last 365 days and nearly 14% over the last week.\nAt the low end, the recent price bump has been driven largely by his 2018 Donruss Base Raw, which has risen from roughly $7.50 to about $10 across more than 300 sales.\nDarnold’s most popular graded card over the last seven days, a 2018 Prizm Base PSA 9, has increased in price from about $6 to nearly $25 across 27 sales.\nNarrowing Darnold’s market to the high end, the most activity has occurred since his record sale in 2021.\nAccording to Card Ladder, two of Darnold’s five most expensive card sales landed in November, including the $10,081 paid for a 2018 Panini National Treasures Stars & Stripes RPA /15 at Fanatics Collect and the $8,460 paid for a 2018 Panini Kaboom Gold /10 at Alt.\nWhether Darnold’s market continues to grow following a Supe...",
    "title": "Sam Darnold’s card market surges with Seattle's Super Bowl runDarnold's market has jumped 110% in the last year amid his career resurgence with the SeahawksJanuary 27, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/sam-darnold-s-card-market-surges-with-seattle-s-super-bowl-run",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:34:58.252594",
    "summary": "Darnold's market has jumped 110% in the last year amid his career resurgence with the Seahawks"
  },
  {
    "text": "Found in a 1930s scrapbook, rare signed Babe Ruth card could top $1 millionThe 1933 Goudey card is graded PSA 4.5 with an autograph grade of PSA/DNA 8January 27, 2026\n\nThe 1933 Goudey card is graded PSA 4.5 with an autograph grade of PSA/DNA 8\n\nFound in a 1930s scrapbook, rare signed Babe Ruth card could top $1 million\nThe 1933 Goudey card is graded PSA 4.5 with an autograph grade of PSA/DNA 8\nThe autographed 1933 Goudey Babe Ruth card was originally discovered in a scrapbook in 2019. (Credit: PSA)\nBy\nWill Stern\n—\nJanuary 27, 2026\nShare\nFour autographed Babe Ruth cards were discovered in an old scrapbook in 2019, found among the pages that included hundreds of newspaper clippings and photos assembled in the 1930s.\nOne of those cards, a 1933 Goudey No. 181 with a PSA 4.5 condition grade and a PSA/DNA 8 autograph grade — the highest-graded condition of any Goudey card signed by Ruth known to exist — is set to sell at Goldin Auctions next month, carrying a current bid of $793,000, including buyer’s premium.\nThe Goudey is the highest-graded autographed card from Ruth's playing days. (Credit: Goldin Auctions)\nThe find was originally sold off by Mile High Card Company in 2019. At the time, the auction house’s founder, Brian Drent, told PSA, \"I have handled and seen the best of the best that the hobby has to offer since establishing my company in 1996. ... This material is not only in the upper echelon of what has come into the marketplace, it has also provided me with a personal story I'll never forget.\"\nAccording to Drent, he never even met with the original family of the man who put the scrapbook together. The man's son was, to his knowledge, still alive and in his late 80s at the time of the discovery six years ago, and the family negotiated the terms of sale through an intermediary.\n“They wanted to remain anonymous, and they wanted it to be a cash transaction. So, I flew in to Philadelphia with a suitcase filled with cash, rented a car and drove an hour-and-a-half to this little town in Pennsylvania where I was to meet the guy who was representing the family,” Drent recalled to PSA.\n“When I finally got to the house and actually saw the scrapbook, the cards and other signed material, I was just blown away.”\nIn the auction listing, Goldin Auctions states that not only is this card the highest-graded Goudey-signed Ruth card, but is actually the highest-graded signed Ruth card of any from his playing days issues.\nAnother Goudey example with slightly lower condition grade (PSA 4) and an equivalent autograph grade recently sold for $1.2 million in a private transaction, according to the auction house.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "Found in a 1930s scrapbook, rare signed Babe Ruth card could top $1 millionThe 1933 Goudey card is graded PSA 4.5 with an autograph grade of PSA/DNA 8January 27, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/found-in-a-1930s-scrapbook-rare-signed-babe-ruth-card-could-top-1-million",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:34:59.086934",
    "summary": "The 1933 Goudey card is graded PSA 4.5 with an autograph grade of PSA/DNA 8"
  },
  {
    "text": "LeBron James Gold Refractor becomes first million-dollar card of 2026James is now featured on 25 different seven-digit cards after sale at Fanatics CollectJanuary 26, 2026\n\nJames is now featured on 25 different seven-digit cards after sale at Fanatics Collect\n\nLeBron James Gold Refractor becomes first million-dollar card of 2026\nJames is now featured on 25 different seven-digit cards after sale at Fanatics Collect\nThe 2003 Topps Chrome Gold Refractor LeBron James card is graded PSA 10. (Credit: Fanatics Collect)\nBy\nMatt Liberman\n—\nJanuary 26, 2026\nShare\nWe have our first million-dollar card sale of 2026, and it's a title fit for the King.\nA 2003 Topps Chrome Gold Refractor LeBron James Rookie /50, graded PSA 10, sold on Friday for $1.11 million, becoming the first card to reach the seven-digit mark this year.\nThe card was sold as part of the Fanatics Premier auction that also featured Nick Kurtz's RDPA selling for $516,000 as well as a Shai Gilgeous-Alexander Green Kaboom! 1/1 that fetched a record $432,000.\nWith this sale, James is now featured on 25 different cards to cross the $1 million threshold, more than Michael Jordan and Kobe Bryant combined.\nThis is the second-most-expensive sale ever for James' 2003 Topps Chrome Gold Refractor, trailing a $1.2 million private sale in August 2022.\nThe sale also might indicate the current strength of the market. After the COVID-19 boom in 2020 and 2021, this card dipped a bit in the market. As recently as October 2024, another James PSA 10 2003 Topps Chrome Gold Refractor sold for $645,000 at Heritage. This sale nearly doubled that price just 15 months later.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nMatt Liberman is a reporter and video producer for\ncllct\n, the premier company for collectible culture.",
    "title": "LeBron James Gold Refractor becomes first million-dollar card of 2026James is now featured on 25 different seven-digit cards after sale at Fanatics CollectJanuary 26, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/lebron-james-gold-refractor-becomes-first-million-dollar-card-of-2026",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:34:59.945067",
    "summary": "James is now featured on 25 different seven-digit cards after sale at Fanatics Collect"
  },
  {
    "text": "Packs in Logan Paul’s 1st Edition Pokémon break sell for combined $1.38 millionWinners in auction invited to attend break with Paul and Ken Goldin on Feb. 15January 26, 2026\n\nWinners in auction invited to attend break with Paul and Ken Goldin on Feb. 15\n\nPacks in Logan Paul’s 1st Edition Pokémon break sell for combined $1.38 million\nWinners in auction invited to attend break with Paul and Ken Goldin on Feb. 15\nLogan Paul and Ken Goldin will break the 1999 Pokémon Base Set 1st Edition Booster Box next month.\nBy\nBen Burrows\n—\nJanuary 26, 2026\nShare\nCollectors paid a combined $1,387,140 for 36 individual packs in an upcoming box break of a 1999 Pokémon Base Set 1st Edition Booster Box with influencer and professional wrestler Logan Paul.\n???? BREAKING UPDATE ????\nWinners are headed for an unforgettable night with\n@LoganPaul\nand\n@KenGoldin\n, live and in person on Feb. 15th!\n$1,400,000 spent on pack entries for the 1st Edition Pokémon Box Break on Logan Paul's Youtube!\nWhat a night it will be! Who’s tuning in\npic.twitter.com/M1WdMvLX6H\n— Goldin (@GoldinCo)\nJanuary 26, 2026\nSold in\nGoldin’s TCG Weekly Auction on Sunday\n, final prices for packs ranged from a high of $45,140 to a low of $32,940 each.\nWinners of each pack are invited to attend the break with Paul and Goldin founder and CEO Ken Goldin in person Feb. 15 at Goldin’s headquarters in Runnemede, New Jersey.\nAccording to each pack’s lot description, any Holo card pulled will be submitted to PSA for grading. Cards graded as a PSA 10 will be labeled with a “Logan Paul Break” pedigree.\nThe combined total of all 36 packs is more than triple the record for a sealed Pokémon box sold at public auction — that 1999 Pokémon Base Set Shadowless 1st Edition Booster Box fetched $432,000 at PWCC in 2021.\nPrior to Sunday’s results, the highest sale for a single sealed Pokémon pack in Card Ladder’s database was the $15,100 paid for a 1999 Pokémon 1st Edition Base Shadowless Blister Pack at PWCC in 2020.\nThe break itself lands alongside the end of Goldin’s 2026 Pokémon & TCG Auction, which features\nPaul’s record-holding 1998 Pokémon Japanese Promo Pikachu Illustrator PSA 10\n.\nPurchased by Paul privately for a record $5.275 million in 2021,\nbidding for the Illustrator has reached $6.3 million\n, including buyer’s premium, with more than 20 days remaining.\nGoldin announced Friday the card had been\nreholdered by PSA following questions\nfrom the collecting community over its condition.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nBen Burrows is a reporter and editor for\ncllct\n, the premier company for collectible culture. He was previously the collectibles editor at Sports Illustrated. You can follow him on X and Instagram @benmburrows.",
    "title": "Packs in Logan Paul’s 1st Edition Pokémon break sell for combined $1.38 millionWinners in auction invited to attend break with Paul and Ken Goldin on Feb. 15January 26, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/packs-in-logan-paul-1st-edition-pokemon-break-sell-for-combined-1-38-million",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:00.839153",
    "summary": "Winners in auction invited to attend break with Paul and Ken Goldin on Feb. 15"
  },
  {
    "text": "Logan Paul's Pikachu Illustrator reholdered by PSA, still grades a 10Bidding for the card now tops $6 million at Goldin, will set all-time Pokémon recordJanuary 23, 2026\n\nBidding for the card now tops $6 million at Goldin, will set all-time Pokémon record\n\nLogan Paul's Pikachu Illustrator reholdered by PSA, still grades a 10\nBidding for the card now tops $6 million at Goldin, will set all-time Pokémon record\nLogan Paul often wears the card around his neck, and it has been recorded as the Guinness World Record-holder for the most expensive Pokémon card.\nBy\nDarren Rovell\n—\nJanuary 23, 2026\nShare\nThe most talked-about card currently up for bid is in a new holder.\nGoldin Auctions founder and CEO Ken Goldin revealed Friday he had PSA reholder Logan Paul’s Pokémon Pikachu Illustrator, which is graded PSA 10.\nBidding for the card has hit $6.324 million, including buyer’s premium, with 23 days remaining in the auction.\nSet to close Feb. 15 as part of Goldin’s 2026 Pokémon and TCG Auction, the auction has now surpassed the $5.275 million Paul paid for the card in 2021, which set the old record.\nGoldin got a brand new 2026 PSA slab for the 1/1 Pikachu Illustrator.\nThe current bid is $6,324,000, which means it already broke its own record for most expensive Pokémon card in the world.\npic.twitter.com/eJsRGUos8b\n— cllct (@cllctMedia)\nJanuary 23, 2026\nConsigned to Goldin during an episode of Netflix’s “King of Collectibles: The Goldin Touch,” Paul’s Illustrator has been one of the most high-profile trading cards to hit the auction block.\nSome critics had attacked the grading on the card, saying it shouldn’t have been the only Illustrator to get a 10. But Goldin and Paul believed some of that noise had to do with some damage to the holder.\nPaul had a diamond necklace made so he could wear the card during his WWE debut and other special events. But Goldin noticed the diamonds hitting the slab caused scratches and dings.\n“What I wanted to do was put it in a fresh, clean, new holder that is modern with the latest anti-counterfeiting tech and then stabilize the necklace so that at least when it leaves our building the holder is spotless,” Goldin told cllct. “So, we are going to put something around the chain so that the chain cannot touch the necklace, and when the buyer gets it, they can do what they want with it.”\nPaul said the fact the card was reholdered and confirmed as a 10 should silence any doubters.\n“I think the card speaks for itself,\" said Paul, who is promising to hand the card to the winner.\n\"It’s the only Illustrator to ever be graded a 10 by PSA, and the new clean slab is just confirmation that this is the greatest card in Pokémon.”\nGoldin advanced Paul $2.5 million to consign the card.\nThe card’s current bid would make it the most expensive Pokémon card sold at public auction and the first to top $1 million. According to Card Ladder’s records, three non-sports cards have eclipsed $1 million, all via private sale.\nCllct reporter Ben Burrows contribut...",
    "title": "Logan Paul's Pikachu Illustrator reholdered by PSA, still grades a 10Bidding for the card now tops $6 million at Goldin, will set all-time Pokémon recordJanuary 23, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/logan-paul-pikachu-illustrator-reholdered-by-psa-still-grades-a-10",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:01.687845",
    "summary": "Bidding for the card now tops $6 million at Goldin, will set all-time Pokémon record"
  },
  {
    "text": "Nick Kurtz rookie debut patch sells for record $516kKurtz now owns the No. 2 RDPA, trailing only Paul Skenes' $1.1 million patchJanuary 23, 2026\n\nKurtz now owns the No. 2 RDPA, trailing only Paul Skenes' $1.1 million patch\n\nNick Kurtz rookie debut patch sells for record $516k\nKurtz now owns the No. 2 RDPA, trailing only Paul Skenes' $1.1 million patch\nNick Kurtz's rookie debut patch card ranks as the second-most expensive in the program's history. (Credit: Fanatics/Getty)\nBy\nBen Burrows\n—\nJanuary 23, 2026\nShare\nNick Kurtz's 2025 Topps Chrome Update Rookie Debut Patch Autograph\nsold for $516,000 Thursday night\n, setting a record for any Kurtz card at public auction.\nLot No. 3 in\nFanatics Collect’s January Premier Auction\n, Kurtz’s debut patch is considered his best card and among the most significant cards created in 2025.\nKurtz was the unanimous American League Rookie of the Year in 2025 after slashing .290/.383/.619 with 36 home runs and 86 RBI in 117 games.\nKurtz’s RDPA now ranks as the second-most expensive RDPA to sell at public auction, trailing only the $1.1 million paid for Paul Skenes’ RDPA at Fanatics Collect in March 2025.\nJackson Holliday’s RDPA is the third-place holder after fetching $198,000 at Fanatics Collect in March 2025.\nRELATED STORIES:\nDick's Sporting Goods revealed as buyer of Paul Skenes' $1.1 million card\nPaul Skenes' debut patch sells for whopping $1.11 million\nNumbers don't lie: Topps Rookie Debut Patch Autograph is now king\nTopps Rookie Debut Patches soar: Top 10 sales on record\n\"Oh, my God, I think this is real\": How L.A. family reacted to pulling Paul Skenes 1/1 card\nThe previous record for any Kurtz card sold at public auction, according to data tool Card Ladder, was the $86,620 paid for his 2025 Topps Chrome Rookie Autograph Superfractor 1/1 at Goldin in December.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nBen Burrows is a reporter and editor for\ncllct\n, the premier company for collectible culture. He was previously the collectibles editor at Sports Illustrated. You can follow him on X and Instagram @benmburrows.",
    "title": "Nick Kurtz rookie debut patch sells for record $516kKurtz now owns the No. 2 RDPA, trailing only Paul Skenes' $1.1 million patchJanuary 23, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/nick-kurtz-rookie-patch-hits-360k-could-it-approach-1-million-at-final-hammer",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:02.555180",
    "summary": "Kurtz now owns the No. 2 RDPA, trailing only Paul Skenes' $1.1 million patch"
  },
  {
    "text": "Another T206 Honus Wagner card hits auction block, carries $3 million estimateHeritage to auction the \"Garagiola Wagner,\" which is graded Authentic by SGCJanuary 22, 2026\n\nHeritage to auction the \"Garagiola Wagner,\" which is graded Authentic by SGC\n\nAnother T206 Honus Wagner card hits auction block, carries $3 million estimate\nHeritage to auction the \"Garagiola Wagner,\" which is graded Authentic by SGC\nThe \"Garagiola Wagner\" last sold publicly in 2021 for $2.52 million. (Credit: Heritage Auctions)\nBy\nWill Stern\n—\nJanuary 22, 2026\nShare\nAfter a relative dearth of opportunities for collectors to purchase the famed T206 Honus Wagner card at public auction over the last few years, 2026 has started off strong.\nWith Goldin Auctions currently selling a newly discovered Wagner, Heritage Auctions is now poised to sell the\nSGC Authentic Garagiola Wagner in March, with the card carrying a pre-sale estimate of $3 million\n.\nThe Garagiola Wagner, named for its previous owner, baseball player and broadcaster Joe Garagiola, has only sold once publicly — in 2021 for $2.52 million.\nAccording to Garagiola’s son, who originally consigned the card to Heritage in 2021, his father traded his 1954 Giants uniform from their World Series championship season, among other items, for the card decades ago.\nWhen dealing with the most iconic and one of the rarest cards in the hobby, comps are always tough to come by, however, the $3 million estimate falls within reason. It might even be a bit conservative considering the growth of the industry and the high-end market since its last sale in 2021 and the premium placed on non-restored copies.\nThe newly discovered Wagner currently at Goldin has already earned 28 bids in its first 24 hours of bidding to bring it over $4 million (including buyer’s premium) with 30 days remaining. That card is graded PSA 1, and numerically graded Wagners earn a hefty premium over their authentic counterparts.\nThe timing of both sales, which will be effectively competing with one another despite their difference in grade, will act as a test to see how deep the demand for these grails goes.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "Another T206 Honus Wagner card hits auction block, carries $3 million estimateHeritage to auction the \"Garagiola Wagner,\" which is graded Authentic by SGCJanuary 22, 2026",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/another-t206-honus-wagner-card-hits-auction-block-carries-3-million-estimate",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:03.555379",
    "summary": "Heritage to auction the \"Garagiola Wagner,\" which is graded Authentic by SGC"
  },
  {
    "text": "Breaking down \"The BlindBoxification Of Everything\"\n\nDarren Rovell and Ghostwrite founder Josh Luber break down the current state of the hobby in reaction to Luber and Jesse Einhorn's \"The BlindBoxification Of Everything.\"\n\n00:00:NaN\nBreaking down \"The BlindBoxification Of Everything\"\nFebruary 06, 2026\nShare\nDarren Rovell and Ghostwrite founder Josh Luber break down the current state of the hobby in reaction to Luber and Jesse Einhorn's \"The BlindBoxification Of Everything.\"\nFrom repacks to the legend of the 1952 Topps Mickey Mantle and everything in between, these two industry leaders dive deep into what has happened in the last five years.",
    "title": "Breaking down \"The BlindBoxification Of Everything\"",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/breaking-down-the-blind-boxification-of-everything",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:04.328185",
    "summary": "Darren Rovell and Ghostwrite founder Josh Luber break down the current state of the hobby in reaction to Luber and Jesse Einhorn's \"The BlindBoxification Of Everything.\""
  },
  {
    "text": "Behind 'King of Collectibles' Season 3 with the king himself ... Ken Goldin\n\n'King of Collectibles: The Goldin Touch' is back, bigger than ever before. \n\nGoldin founder and CEO Ken Goldin chats with cllct's Darren Rovell about why this season will look different than the first two seasons. \n\n00:00:NaN\nBehind 'King of Collectibles' Season 3 with the king himself ... Ken Goldin\nDecember 23, 2025\nShare\n'King of Collectibles: The Goldin Touch' is back, bigger than ever before.\nGoldin founder and CEO Ken Goldin chats with cllct's Darren Rovell about why this season will look different than the first two seasons.\nPlus, they dig into how Goldin uncovered a new-to-the-market T206 Honus Wagner, which he believes is the greatest discovery in the hobby in 50 years.",
    "title": "Behind 'King of Collectibles' Season 3 with the king himself ... Ken Goldin",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/ken-goldin-says-season-3-of-king-of-collectibles-is-for-the-true-collector",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:05.089038",
    "summary": "'King of Collectibles: The Goldin Touch' is back, bigger than ever before. \n\nGoldin founder and CEO Ken Goldin chats with cllct's Darren Rovell about why this season will look different than the first two seasons. "
  },
  {
    "text": "Upper Deck President Jason Masherah is worried about the future of the hobby\n\nUpper Deck President Jason Masherah joins cllct for exclusive interview concerning his worries for the state of the hobby.\n\n00:00:NaN\nUpper Deck President Jason Masherah is worried about the future of the hobby\nOctober 30, 2025\nShare\nUpper Deck President Jason Masherah took to LinkedIn earlier this week to express his concerns over the state of collecting.\nHe's wrote about worries in the collection of wealth in the hobby and how it is concentrated in such a small percentage of the population fo collectors.\nPlus, he worries about the implications that gambling has in collecting.\nHe details all of this in his exclusive interview with cllct.",
    "title": "Upper Deck President Jason Masherah is worried about the future of the hobby",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/upper-deck-president-jason-masherah-is-worried-about-the-future-of-the-hobby",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:06.055186",
    "summary": "Upper Deck President Jason Masherah joins cllct for exclusive interview concerning his worries for the state of the hobby."
  },
  {
    "text": "CardsThe 10 most expensive sports cards of 2025: MJ-Kobe Dual Logoman tops listIn the year of the Logoman, basketball legends dominate the year's top 10In the year of the Logoman, basketball legends dominate the year's top 101\n\nIn the year of the Logoman, basketball legends dominate the year's top 10\n\nThe 10 most expensive sports cards of 2025: MJ-Kobe Dual Logoman tops list\nIn the year of the Logoman, basketball legends dominate the year's top 10\nThe 2007 Upper Deck Exquisite Logoman Autograph 1/1 card features a gold NBA logo worn by Michael Jordan during the 1996-97 season. (Credit: Heritage Auctions)\nBy\nBen Burrows\n—\nDecember 31, 2025\nShare\nHis Airness. The Black Mamba. The King. The Bambino.\nHigh-end sports card sales were dominated in 2025 by a handful of all-time greats, especially on the basketball court.\nOf the top 10 transactions, more than half involved either Michael Jordan or Kobe Bryant.\nAnd, of course, a trio of current Los Angeles stars — LeBron James, Shohei Ohtani and Luka Dončić — also made appearances on the list.\nHere are the top 10 sports card sales of the year, according to Card Ladder’s records, starting with one for the all-time record books.\n1. 2007-08 Upper Deck Exquisite Collection Kobe Bryant-Michael Jordan Dual Logoman Autograph 1/1 PSA 6: $12.932 million\nThe most expensive sports card ever sold at public auction broke the bank earlier this year when a Dual Logoman featuring patches from Jordan and Bryant\nfetched nearly $13 million\n.\nOn its own, the card paired one of the hobby’s most iconic sets with game-used Logoman patches from two of basketball’s all-time greatest players.\nThe card’s story got even more interesting when Shark Tank star and celebrity entrepreneur Kevin O’Leary\nrevealed he was one of the buyers\n.\nThe record-setter is now part of the WonderShyne Index, a collection of ultra high-end cards acquired by collectibles platform Secure.\n2. 2006-07 Upper Deck Exquisite Collection Michael Jordan-LeBron James Dual Logoman Autograph 1/1: $10 million\nSimilar to the Jordan-Bryant Dual Logoman, this card was acquired by Secure in September through a private sale. Card Ladder confirmed the transaction through a review of the wire transfer.\nThis sale is the third-highest for any card, according to Card Ladder, and the most paid for a card featuring James.\nPurchased raw, the card has since been graded a PSA 5/Auto 9.\n3. 2018-19 Panini Flawless Luka Dončić Logoman Autograph 1/1: $4.7 million\nAnother acquisition by Secure, this example is arguably the most important Dončić card in existence.\nSold privately, the result edged out the previous record for a Dončić card of $4.6 million paid in 2021. According to Secure, the card has since been graded a PSA 7/Auto 10.\n4. 2003-04 Exquisite Collection LeBron James Rookie Patch Autograph Gold /23 PSA 9/Auto 10: $4.25 million\nAmong the best James cards in existence, this example was sold to a Secure client in a private transaction.\nCard Ladder confirmed the transaction through...",
    "title": "CardsThe 10 most expensive sports cards of 2025: MJ-Kobe Dual Logoman tops listIn the year of the Logoman, basketball legends dominate the year's top 10In the year of the Logoman, basketball legends dominate the year's top 101",
    "source": "Cllct",
    "category": "Sports Cards",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/the-10-most-expensive-sports-cards-of-2025-mj-kobe-dual-logoman-tops-list",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:06.863856",
    "summary": "In the year of the Logoman, basketball legends dominate the year's top 10"
  },
  {
    "text": "January 22, 2026Ranking the seven most eye-popping items in Jim Irsay's collectionFamed collection of late Indianapolis Colts owner will go to auction in March at Christie'sRead the story-->\n\nFamed collection of late Indianapolis Colts owner will go to auction in March at Christie's\n\nRanking the seven most eye-popping items in Jim Irsay's collection\nFamed collection of late Indianapolis Colts owner will go to auction in March at Christie's\nJim Irsay owned instruments from some of the world's most prominent musicians, including all four Beatles. (Credit: Getty Images)\nBy\nWill Stern\n—\nJanuary 22, 2026\nShare\nIt is a fool’s errand to offer any sort of grand unified theory that measures the quality of a collection.\nWhether speaking of the thrift-store scavenger or the the wealthy, monocle-wearing bidder, there is nothing that can possibly provide an objective rationale for the non-monetary motivation for collecting. Rarity, sentimental value and cultural merit are all measuring sticks, but none of those aspects carry the same weight to multiple observers.\nStill, by every metric under the sun, not the least of which being pure financial excess, Jim Irsay accumulated one of, if not\nthe\n, greatest cultural collections in history during his life. And the\nupcoming sale of his collection at Christie’s\nin March is poised to be one of the most significant in history — right up there with the estate sales of Paul Allen and Malcolm Forbes.\nBefore we get into some of the highlights of the collection and the stories behind them, it’s important to note just how crucial the role of provenance plays in an auction like this. While the term often refers simply to chain of custody, often for authenticity purposes, in special cases, it becomes a value driver itself. This is certainly true with respect to the Irsay Collection, as one can expect all of the items sold this year to prominently feature “former Irsay Collection” in the lot description each time a piece is re-sold.\nIrsay’s collection is simply so rarified, vast and dotted with premier pieces, that his taste alone brings added value.\nIrsay often paid multiple times pre-sale estimates for pieces he felt compelled to buy. Many of Christie’s estimates fall below or barely near his cost, reflecting what could be the impact of a mass injection of high-end material into a limited buyer pool.\nNow, let's look at some of the most jaw-dropping pieces coming to Christie’s in a series of sales this March including nearly 400 lots, beginning with items relating to sports, culture and music (historical pieces will come later this year).\nIrsay’s collection is perhaps best known as the home to “The Greatest Guitar Collection on Earth.”\nAmong the guitars on offer are some of the most valuable and important in the collecting world. Not to be overshadowed, of course, are pieces touching on sports and cultural history.\nKurt Cobain's 1966 Fender Mustang guitar (estimate: $2.5 million-$5 million)\nUsed during the recording of \"Neverm...",
    "title": "January 22, 2026Ranking the seven most eye-popping items in Jim Irsay's collectionFamed collection of late Indianapolis Colts owner will go to auction in March at Christie'sRead the story-->",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/auctions/ranking-the-seven-most-eye-popping-items-in-jim-irsay-s-collection",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:07.704320",
    "summary": "Famed collection of late Indianapolis Colts owner will go to auction in March at Christie's"
  },
  {
    "text": "Curt Cignetti's headset from national title sells for record $112,500Proceeds from the sale of the coach's game-worn headset will go to Indiana's NIL fundFebruary 09, 2026\n\nProceeds from the sale of the coach's game-worn headset will go to Indiana's NIL fund\n\nCurt Cignetti's headset from national title sells for record $112,500\nProceeds from the sale of the coach's game-worn headset will go to Indiana's NIL fund\nCurt Cignetti led Indiana to a 16-0 season and the first football national title in school history. (Credit: Bison Drop)\nBy\nWill Stern\n—\nFebruary 09, 2026\nShare\nOne collector now owns the headset of the coach who engineered one of the greatest and most shocking seasons in college football history.\nThe\nheadset worn by Indiana coach Curt Cignetti\nthroughout the Hoosiers' undefeated season, including their victory over Miami in the national title game, has sold for $112,500 at auction.\nBidding exploded in the final 24 hours of the sale, jumping from $20,000 to $112,500. There were a total of 212 bids on the headset, which was sold via Bison Drop, Indiana's site for authentic IU athlete gear auctions.\nProceeds from the Cignetti headset will go to Indiana’s NIL fund.\nThis isn't the first time someone paid big money for a coach-worn headset. Bill Belichick’s game-worn Super Bowl XXXVI Motorola headset fetched $10,200 in 2018. But like this season, Cignetti comes out on top.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "Curt Cignetti's headset from national title sells for record $112,500Proceeds from the sale of the coach's game-worn headset will go to Indiana's NIL fundFebruary 09, 2026",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/auctions/curt-cignetti-headset-from-national-title-game-up-for-auction",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:08.755738",
    "summary": "Proceeds from the sale of the coach's game-worn headset will go to Indiana's NIL fund"
  },
  {
    "text": "Bob Ross paintings stay hot with $787,900 sale at Bonham’sRoss painted “Change of Seasons\" during the 20th season of his popular show on PBSJanuary 27, 2026\n\nRoss painted “Change of Seasons\" during the 20th season of his popular show on PBS\n\nBob Ross paintings stay hot with $787,900 sale at Bonham’s\nRoss painted “Change of Seasons\" during the 20th season of his popular show on PBS\nProceeds from the latest sale of Bob Ross' work will benefit public television stations. (Credit: Bonham's)\nBy\nWill Stern\n—\nJanuary 27, 2026\nShare\nAn original Bob Ross painting, created during an episode of the television show “The Joy of Painting” in 1990, sold for $787,900 at Bonham’s on Tuesday.\nThe sale is the most recent in a series of rapidly rising auction prices for pieces painted by Ross, most recently seen in\nthe million-dollar sale conducted by John Oliver’s “Last Week Tonight.”\nBonham's conducted the sale on behalf of American Public Television, which has pledged to direct 100% of net proceeds to support public television stations nationwide.\nTitled “Change of Seasons,” the painting was composed during episode 11 of the show's 20th season and signed in the bottom left corner by Ross. He described the work in the episode as \"just a beautiful little painting\" and it has remained in storage since its creation in 1990.\nPrior to the Oliver sale, the record for a Ross painting was less than $318,000, set in late 2025.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "Bob Ross paintings stay hot with $787,900 sale at Bonham’sRoss painted “Change of Seasons\" during the 20th season of his popular show on PBSJanuary 27, 2026",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/auctions/bob-ross-paintings-stay-hot-with-787900-sale-at-bonham-s",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:09.565959",
    "summary": "Ross painted “Change of Seasons\" during the 20th season of his popular show on PBS"
  },
  {
    "text": "Ex-Heat security guard sentenced to three years in prison after theft of game-used itemsMarcos Tomas Perez, 62, pleaded guilty to transporting and transferring stolen goods across state linesJanuary 24, 2026\n\nMarcos Tomas Perez, 62, pleaded guilty to transporting and transferring stolen goods across state lines \n\nEx-Heat security guard sentenced to three years in prison after theft of game-used items\nMarcos Tomas Perez, 62, pleaded guilty to transporting and transferring stolen goods across state lines\nLeBron James' jersey from Game 7 of the 2013 NBA Finals was among the items stolen from the Heat facility. (Credit: Getty Images)\nBy\ncllct staff\n—\nJanuary 24, 2026\nShare\nA former Miami Heat security officer has been sentenced to three years in federal prison and ordered to pay $1.9 million in restitution after pleading guilty to transporting and transferring stolen goods across state lines, the Associated Press reported Friday.\nMarcos Tomas Perez, 62, pleaded guilty in the Southern District of Florida in August after being accused by federal officials of stealing more than 400 game-used jerseys from the Heat facilities.\nPerez had previously worked as a police officer for the city of Miami for 25 years before his employment with the Heat from 2016 to 2021 and then as an NBA security employee from 2022 to 2025.\n“This defendant was a former police officer who betrayed the public trust and exploited his access to our beloved hometown team for personal gain,” U.S. Attorney for the Southern District of Florida Jason Reding Quiñones said in a statement, per the AP. “The Miami Heat represent excellence built through hard work and discipline in South Florida — and this conduct was the opposite.”\nAccording to allegations from the U.S. Attorney’s Office, Perez stole jerseys and other items from a secured equipment room and sold them to online brokers, including more than 100 stolen items over a period of three-plus years for which he garnered $1.9 million, often selling items below market value.\nPerez, who was sentenced earlier this month, allegedly had access to the equipment room because he worked game-day security at the Kaseya Center. The equipment room had memorabilia set aside for a future Heat museum.\nRELATED STORIES:\nFormer Heat security officer pleads guilty to theft of jerseys\nEx-Miami Heat security officer charged in theft of more than 400 jerseys\nHeat probe includes game-used jerseys from LeBron, Shaq, D-Wade\nSources: Stolen Miami Heat memorabilia at center of federal probe\nA court filing related to the plea agreement alleged Perez would tell a co-worker he had to use the bathroom (or offer another excuse) and take the key, open the equipment room and leave the door propped open before returning the key. Later, he would return to steal items from the room.\nAccording to the same document, Perez utilized a third-party liaison to broker the deals, splitting the profits. Then he used his corporate entity, South Florida Signature Authenticators Incorpo...",
    "title": "Ex-Heat security guard sentenced to three years in prison after theft of game-used itemsMarcos Tomas Perez, 62, pleaded guilty to transporting and transferring stolen goods across state linesJanuary 24, 2026",
    "source": "Cllct",
    "category": "Auctions",
    "username": "cllct staff",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/ex-heat-security-guard-sentenced-to-three-years-in-prison-after-theft-of-game-used-items",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:10.357647",
    "summary": "Marcos Tomas Perez, 62, pleaded guilty to transporting and transferring stolen goods across state lines "
  },
  {
    "text": "Original Apple Computer document sells for $2.51 millionAgreement between Steve Jobs, Steve Wozniak and Ronald Wayne set original terms for company in 1976January 23, 2026\n\nAgreement between Steve Jobs, Steve Wozniak and Ronald Wayne set original terms for company in 1976\n\nOriginal Apple Computer document sells for $2.51 million\nAgreement between Steve Jobs, Steve Wozniak and Ronald Wayne set original terms for company in 1976\nSteve Jobs received 45% of the company in the original Apple agreement in 1976. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nJanuary 23, 2026\nShare\nThe most valuable document in American business history sold Friday for $2.51 million at Christie's.\nA three-page agreement between Steve Jobs, Steve Wozniak and Ronald Wayne, the contract was signed April 1, 1976, and set out the original terms for The Apple Computer Company.\nThe original Apple agreement set the stage for one of the most successful companies in business history. (Credit: Christie's)\nJobs and Wozniak, then 21 and 26 years old, respectively, each received 45% of the company, while Wayne, 41,  an engineer and draftsman at Atari, was awarded a 10% share.\nWayne was brought in to write the actual document, the early manual and, most importantly, to break ties in voting. Jobs very much wanted people to buy Apple and Apple products only. Wozniak was an early computer type who was willing to allow open source software to work with Apple's hardware.\nWayne famously left the company after 12 days because he was worried, understandably, that Jobs and Wozniak would run out of money and the onus would fall on him, the only one of the three who had his own bank account.\nApple went on to get an investment nine months later and reformed as Apple Computer Inc. An IPO a little less than three years later, made Jobs worth $256 million and Wozniak worth $116 million.\nFor his part, Wayne didn't find much business after Apple. Many years ago, Wayne saw a magazine ad from a company that sold autographs. He asked if they wanted to buy Apple's first document. They did, and Wayne received $500.\nIn 2011, Sotheby's estimated the document was worth $100,000 to $150,000\nIt sold for $1.4 million to Eduardo Cisneros of the holding company Grupo Cisneros out of Venezuela.\nEntering this auction 15 years later, Christie's estimated the document was worth $2 million to $4 million.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nDarren Rovell is the founder of\ncllct\nand one of the country's leading reporters on the collectibles market. He previously worked for ESPN, CNBC and The Action Network.",
    "title": "Original Apple Computer document sells for $2.51 millionAgreement between Steve Jobs, Steve Wozniak and Ronald Wayne set original terms for company in 1976January 23, 2026",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/auctions/original-apple-computer-document-sells-for-2-51-million-at-christie-s",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:11.194514",
    "summary": "Agreement between Steve Jobs, Steve Wozniak and Ronald Wayne set original terms for company in 1976"
  },
  {
    "text": "Novak Djokovic's 2012 Australian Open racket sells for record $540kDjokovic used the racket to beat Rafael Nadal in the longest Grand Slam final in historyJanuary 23, 2026\n\nDjokovic used the racket to beat Rafael Nadal in the longest Grand Slam final in history\n\nNovak Djokovic's 2012 Australian Open racket sells for record $540k\nDjokovic used the racket to beat Rafael Nadal in the longest Grand Slam final in history\nNovak Djokovic's 2012 Australian Open victory is considered one of the best matches in tennis history. (Credit: Getty Images)\nBy\nMatt Liberman\n—\nJanuary 23, 2026\nShare\nWhile Novak Djokovic couldn't capture his elusive 25th Grand Slam Sunday morning, he did shatter a hobby record.\nSCP Auctions sold\na match-used racket from Novak Djokovic's thrilling 2012 Australian Open title run\nfor $540,000, breaking the record for any game-used racket by more than $350,000. The final of that tournament is widely considered one of the best matches in history, if not the best.\nNo. 1-seeded Djokovic bested No. 2-seeded Rafael Nadal in the longest Grand Slam final ever, lasting five hours and 53 minutes. It also remains the longest match in Australian Open history.\nThe win also marked the second consecutive Grand Slam final in which Djokovic beat Nadal, having defeated the Spaniard just a few months earlier in the U.S. Open.\n\"It was obvious on the court ... that both of us, physically, we took the last drop of energy that we had from our bodies,\" Djokovic said in his trophy presentation. \"We made history tonight, and unfortunately there couldn’t be two winners.”\nThe two share what is quite possibly the greatest rivalry in the sport's history, having played 60 times, 10 more than any other men's pair. Djokovic won the all-time series 31-29. The two most recently played in the 2024 Olympics.\nThis racket is accompanied by a complete photo-match from Resolution Photomatching, which additionally matched it to Djokovic's quarterfinal win against David Ferrer and semifinal victory over Andy Murray, whom he defeated in the 2011 Aussie final. And the HEAD player-exclusive model has been conclusively photo-matched to the championship point.\nPrior to the auction, SCP Auctions president David Kohler told cllct he expected the racket to set the all-time record, and it certainly didn't disappoint.\nThe former record for any racket belonged to Carlos Alcaraz, who just beat Djokovic in the 2026 Australian Open Final. His Babolat racket from his first Wimbledon title, a victory over Djokovic in 2023, sold in October for $173,066 at tennis-only auction house Prestige Memorabilia.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nMatt Liberman is a reporter and video producer for\ncllct\n, the premier company for collectible culture.",
    "title": "Novak Djokovic's 2012 Australian Open racket sells for record $540kDjokovic used the racket to beat Rafael Nadal in the longest Grand Slam final in historyJanuary 23, 2026",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/auctions/novak-djokovic-2012-australian-open-racket-could-set-all-time-record",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:12.029282",
    "summary": "Djokovic used the racket to beat Rafael Nadal in the longest Grand Slam final in history"
  },
  {
    "text": "Adam Ireland on eBay's future in live commerce content and protecting collectors\n\nCllct's Darren Rovell chats with Adam Ireland, eBay's vice president and general manager of global collectibles. \n\n\n00:00:NaN\nAdam Ireland on eBay's future in live commerce content and protecting collectors\nAugust 11, 2025\nShare\nCllct's Darren Rovell chats with Adam Ireland, eBay's vice president and general manager of global collectibles.\nThe two dive into eBay's two biggest relationships in the collectible space, with both grading giant PSA and Goldin Auctions.\nPlus, how is eBay responding to ongoing controversies in the hobby in order to protect collectors and consumers?",
    "title": "Adam Ireland on eBay's future in live commerce content and protecting collectors",
    "source": "Cllct",
    "category": "Auctions",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/adam-ireland-on-e-bay-s-future-in-live-streaming-and-protecting-collectors",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:12.799904",
    "summary": "Cllct's Darren Rovell chats with Adam Ireland, eBay's vice president and general manager of global collectibles. \n"
  },
  {
    "text": "Fanatics' Michael Rubin and Mike Mahan join cllct from The National\n\nFanatics CEO Michael Rubin and Fanatics Collectibles CEO Mike Mahan join Darren Rovell from the 45th National Sports Collectors Convention in Rosemont, IL. \n\n00:00:NaN\nFanatics' Michael Rubin and Mike Mahan join cllct from The National\nAugust 02, 2025\nShare\nFanatics CEO Michael Rubin and Fanatics Collectibles CEO Mike Mahan join Darren Rovell from the 45th National Sports Collectors Convention in Rosemont, IL.\nThey chat about Fanatics Fest, the state of the hobby, card breaking, bad actors and much more.",
    "title": "Fanatics' Michael Rubin and Mike Mahan join cllct from The National",
    "source": "Cllct",
    "category": "Auctions",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/fanatics-michael-rubin-and-mike-mahan-join-cllct-from-the-national",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:13.581816",
    "summary": "Fanatics CEO Michael Rubin and Fanatics Collectibles CEO Mike Mahan join Darren Rovell from the 45th National Sports Collectors Convention in Rosemont, IL. "
  },
  {
    "text": "Spike Lee discusses his history of collecting, his relationship with Michael Jordan and Willis Reed's heroics\n\nFrom accumulating sports cards as a young kid in Brooklyn, to going after priceless artifacts from his beloved Knicks, Spike Lee has been a fixture of the collecting community for the last 50 years. \n\n00:00:NaN\nSpike Lee discusses his history of collecting, his relationship with Michael Jordan and Willis Reed's heroics\nJune 22, 2025\nShare\nLegendary director and filmmaker Spike Lee joins cllct to discuss his history of collecting.\nFrom accumulating sports cards as a young kid in Brooklyn, to going after priceless artifacts from his beloved Knicks, Lee has been a fixture of the collecting community for the last 50 years.\nHe tells stories he's never shared before about Willis Reed, working with Michael Jordan and his career in film.",
    "title": "Spike Lee discusses his history of collecting, his relationship with Michael Jordan and Willis Reed's heroics",
    "source": "Cllct",
    "category": "Auctions",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/spike-lee-discusses-his-history-of-collecting-his-relationship-with-michael-jordan-and-willis-reed-s-heroics",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:14.396916",
    "summary": "From accumulating sports cards as a young kid in Brooklyn, to going after priceless artifacts from his beloved Knicks, Spike Lee has been a fixture of the collecting community for the last 50 years. "
  },
  {
    "text": "CardsPaul Skenes' debut patch heads to auction in key moment for Fanatics CollectSale of most talked-about card in the hobby critical to battle for industry supremacySale of most talked-about card in the hobby critical to battle for industry supremacy1\n\nSale of most talked-about card in the hobby critical to battle for industry supremacy\n\nPaul Skenes' debut patch heads to auction in key moment for Fanatics Collect\nSale of most talked-about card in the hobby critical to battle for industry supremacy\nLivvy Dunne and Paul Skenes got an up-close look at the Pirates star's coveted card at a Fanatics red-carpet event. (Credit: Fanatics)\nBy\nBen Burrows\n—\nMarch 06, 2025\nShare\nNo card has had a journey quite like the Paul Skenes Rookie Debut Patch Autograph.\nWhat started as\nan 11-year-old boy’s request for a hobby box\nof 2024 Topps Chrome Update Baseball for Christmas turned into a once-in-a-lifetime pull and the redemption for the most talked-about card in recent memory.\nSkenes' Rookie Debut Patch Auto card has been on a cross-country tour since it surfaced publicly in January. (Credit: Topps)\nSince then, the Skenes RDPA has been on a roughly 7,000-mile cross-country trek over the last two months, leading to the card’s eventual sale in Fanatics Collect’s upcoming March Premier Auction.\nFollowing its creation at Topps’ Dallas-area facility in mid-January, the card was hand-delivered by Fanatics vice president Kevin Lenane to the boy’s Los Angeles-area home before making a pit stop at PSA’s Santa Ana office for grading.\nLenane then carried the card to New York for marketing obligations before it eventually landed in New Orleans, where it walked the red carpet alongside Fanatics CEO Michael Rubin at the Fanatics Super Bowl party — it was even briefly reunited with Skenes for a photograph before heading back to the West Coast.\nNow, the card will be the showcase item in Fanatics' March Premier Auction, which runs from Thursday until March 20.\nFor collectors, the sale of Skenes’ RDPA potentially provides an important series of data points, including the current health of the ultra high-end market, the hobby’s current risk tolerance for pitchers and even the status of the Rookie Debut Patch Autograph itself as possibly\nthe most coveted rookie card\nfor baseball’s best players.\nFor Fanatics Collect, the Skenes RPDA represents a chance for the marketplace to show it can handle the hobby’s most important consignments, and it can hold its own when compared to the industry’s other top auction houses, including Goldin and Heritage.\nMarred by conspiracies from the start\n— collectors questioned everything from the card’s existence at all to the identity of the card owner —  Fanatics Collect had to guarantee it could follow the family’s requests, most importantly the insistence their identities remain completely anonymous during the entire process.\nThis requirement meant Lenane would be the point of contact for the entire process, including traveling with the card on its...",
    "title": "CardsPaul Skenes' debut patch heads to auction in key moment for Fanatics CollectSale of most talked-about card in the hobby critical to battle for industry supremacySale of most talked-about card in the hobby critical to battle for industry supremacy1",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/paul-skenes-rookie-patch-heads-to-auction-in-key-moment-for-fanatics-collect",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:15.266787",
    "summary": "Sale of most talked-about card in the hobby critical to battle for industry supremacy"
  },
  {
    "text": "AuctionInside the complicated process of movie prop authenticationAuthenticating items from films can be much more nuanced than sports memorabiliaAuthenticating items from films can be much more nuanced than sports memorabilia2\n\nAuthenticating items from films can be much more nuanced than sports memorabilia\n\nInside the complicated process of movie prop authentication\nAuthenticating items from films can be much more nuanced than sports memorabilia\nBecause multiple props are often used in the same movie, authentication can be a tough process.\nBy\nWill Stern\n—\nJuly 18, 2024\nShare\nWhen it comes to authenticity, the world of TV and film memorabilia is a special case.\nUnlike a baseball jersey — which was either worn by the player or not — many of the most iconic props from cinematic history are far more complicated.\nMovie props are rarely produced as a one-off. It's common for films such as \"Castaway\" to produce many examples of famous props, such as the film's iconic volleyball, Wilson, which has become a mainstay of the auction scene in recent years. Appearing at multiple auction houses, often multiple times per year, examples of Wilson come with varying degrees of documentation.\nGiven the proper disclosures, this wouldn't be an issue. But, for novice collectors, a reading of the lot description merely describes the prop as the one from the film, so they could reasonably assume it is the only example in existence. Of course, given the difference in value between owning a one-of-a-kind item and a one-of-many item, this can cause major issues.\nA close viewing of the film will reveal the volleyball changes throughout the movie, not simply as star Tom Hanks converts it into a lifelike character, but even in smaller degrees in-between. Each of these changes could represent its own distinct prop, leaving room for dozens of authentic examples from the film, none more legitimate than the next.\nThe key for auction houses such as Propstore, as well as Julien's and Heritage, both of which have sold props (including Wilson) in the past with varying degrees of documentation, is how these items are presented at auction.\nAhead of its August auction, Propstore COO Brandon Alinger explained the nuances that determine authenticity for movie props (at least for Propstore’s specific guidelines).\nWhen a prop is identified as original, it means it was made for or acquired for the production of the film.\nSome, such as Wilson volleyballs, can be screen-matched utilizing a process which compares high-resolution images to stills from the film to identify unique details, indicating the prop is one and the same. That designation can add a hefty premium to an item, with screen-matched Wilson volleyballs selling for as much as $300,000.\nHowever, plenty of props are not able to be matched in the same way, whether due to its use in a wide shot or a lack of detail in the prop itself that makes identification difficult. Post-production digital editing can make a match impossible.\n“Yo...",
    "title": "AuctionInside the complicated process of movie prop authenticationAuthenticating items from films can be much more nuanced than sports memorabiliaAuthenticating items from films can be much more nuanced than sports memorabilia2",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/auctions/inside-the-complicated-process-of-movie-prop-authentication",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:16.085100",
    "summary": "Authenticating items from films can be much more nuanced than sports memorabilia"
  },
  {
    "text": "NewsSealed iPhones setting sales records, but not all are as advertisedcllct investigation reveals multiple sealed iPhones sold at auction were not authenticcllct investigation reveals multiple sealed iPhones sold at auction were not authentic3\n\ncllct investigation reveals multiple sealed iPhones sold at auction were not authentic\n\nSealed iPhones setting sales records, but not all are as advertised\ncllct investigation reveals multiple sealed iPhones sold at auction were not authentic\nAs Steve Jobs and Apple collectibles have become a hot market, original sealed iPhones have taken off. (Credit: Getty Images)\nBy\nWill Stern\n—\nJune 05, 2024\nShare\nThe rise of the sealed iPhone as a collectible has been one of the splashiest trends in collecting over the past few years, thanks to multiple six-figure sales and mainstream media coverage.\nIt also has been one of the most controversial, in large part due to the opaque nature of guaranteeing authenticity. Buyers have generally taken the word of auction houses the product is as advertised, sealed as it came from the factory.\nBut, as cllct has uncovered, multiple sales involved iPhones that were likely resealed and made to look brand new, fooling auction houses that failed to verify easy points of reference before placing items up for bid.\nDuring the course of cllct's investigation, Goldin Auctions removed a 4GB iPhone from its Pop Culture Elite Auction on Wednesday after a basic check of the iPhone's serial number revealed it had been activated and was not as advertised.\n“This is a new collectible,\" Goldin Auctions founder and CEO Ken Goldin told cllct. \"Goldin uses third-party experts wherever possible to authenticate everything we sell. And if it is brought to our attention that those third-party experts are not qualified to authenticate the item in question, we will stop using them.\"\n\"They are amazing investments, if they are real\"\nIt makes sense bad actors would have entered the space considering the mania surrounding the collectible.\nBeginning in 2021, sales of sealed original 2007 iPhones began notching noteworthy sums on eBay, averaging $8,848.89 across nine sales.\nIn 2022, two major auction houses offered 8GB examples, bringing the burgeoning collectible into the mainstream for the first time. RR Auctions sold a sealed iPhone for $35,414 in August 2022, establishing a new record. Then, LCG Auctions followed with a record of its own ($39,339 in October 2022).\nThe floodgates opened, with LCG selling another example for $63,356.40 in February 2023, then Goldin in March 2023 for $43,320 and RR a week later for $54,904.\nThis fed into the already-hot\nmarket for Apple and Steve Jobs memorabilia\n, which has long been coveted by collectors who believe in the power of Apple's cultural ubiquity.\n\"I think they are amazing investments, if they are real,\" industry-renowned pop culture appraiser Simeon Lipman said.\nJeremy Padawer, an entrepreneur and toy-industry executive, felt the same way when he purchased his s...",
    "title": "NewsSealed iPhones setting sales records, but not all are as advertisedcllct investigation reveals multiple sealed iPhones sold at auction were not authenticcllct investigation reveals multiple sealed iPhones sold at auction were not authentic3",
    "source": "Cllct",
    "category": "Auctions",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/sealed-iphones-setting-sales-records-but-not-all-are-as-advertised",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:16.989091",
    "summary": "cllct investigation reveals multiple sealed iPhones sold at auction were not authentic"
  },
  {
    "text": "CGC will raise prices for grading in early 2026New prices will take affect Jan. 6 and apply to comics, cards, video gamesDecember 09, 2025\n\nNew prices will take affect Jan. 6 and apply to comics, cards, video games\n\nCGC will raise prices for grading in early 2026\nNew prices will take affect Jan. 6 and apply to comics, cards, video games\nCGC submissions completed before the Jan. 6 deadline will be priced at the current levels. (Credit: CGC)\nBy\nWill Stern\n—\nDecember 09, 2025\nShare\nCertified Guaranty Company (CGC) announced price hikes across its comics, cards, video games and home-media categories Tuesday, with new fees set to take effective Jan. 6, 2026.\nFor the company’s card grading service:\nBulk tier will change from $14 to $15 per card.\nEconomy tier will change from $17 to $18 per card.\nStandard tier will change from $45 to $55 per card.\nExpress tier will change from $85 to $100 per card.\nWalkthrough tier will change from $275 to $300 per card.\nUnlimited Value tier will change from $275 + 1% FMV to $300 +1% FMV.\nThe fee per card for its pack-pulled autograph add-on service will rise from $2 to $5.\nSignature Series services will also go up, with standard tier rising from $65 to $70, Express tier from $110 to $125 and Walkthrough tier from $325 to $350.\nFor the company’s comic grading service:\nModern Bulk tier will change from $24 to $27, with the bulk minimum reduced from 50 to 25.\nModern tier will change from $27 to $30.\nA new tier called Vintage Bulk will be introduced at $42 per book with a max value of $400 per book and a minimum of 25.\nVintage tier will change from $42 to $45.\nHigh Value tier will change from $95 to $105.\nThe minimum for the Unlimited Value tier will change from $115 to $135.\nSee the full list of updated pricing here\n.\nThe new fees apply to online submission forms completed on or after the Jan. 6 deadline. Submissions which arrive prior to that date at CGC’s headquarters will qualify for current pricing.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "CGC will raise prices for grading in early 2026New prices will take affect Jan. 6 and apply to comics, cards, video gamesDecember 09, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/cgc-will-raise-prices-for-grading-in-early-2026",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:17.769654",
    "summary": "New prices will take affect Jan. 6 and apply to comics, cards, video games"
  },
  {
    "text": "On 40th anniversary, Joe Theismann's awful injury remains unforgettableLawrence Taylor's career-ending sack of Theismann is hard to watch, but endures as a collectibleNovember 18, 2025\n\nLawrence Taylor's career-ending sack of Theismann is hard to watch, but endures as a collectible\n\nOn 40th anniversary, Joe Theismann's awful injury remains unforgettable\nLawrence Taylor's career-ending sack of Theismann is hard to watch, but endures as a collectible\nJoe Theismann is taken off the field on a stretcher as Lawrence Taylor looks on. (Credit: Getty Images)\nBy\nKevin Jackson\n—\nNovember 18, 2025\nShare\nSadly, it's an expression we now hear on a regular basis when watching televised sports.\n\"You might want to look away from your screen. ... That's an injury so gruesome, we're choosing not to show it again.\"\nAny football fan from the 1980s remembers the exact moment when that warning entered the mainstream. A broken leg so horrifying that four decades later many fans remember exactly where they were when they saw it.\nNov. 18, 1985. Joe Theismann. Lawrence Taylor.\nIt happened on \"Monday Night Football\" in the era when everyone watched \"MNF.\" It was on ABC in the early days of cable, and there weren't hundreds of channels, streaming services or mobile phones to compete for eyeballs.\nIf you were a sports fan, and you were home, chances are you were watching the New York Giants travel to Washington to face their NFC East rivals in a Week 11 game with playoff implications.\nIn the second quarter at RFK Stadium, Washington ran a flea flicker and running back John Riggins tossed the ball back to Theismann, who was immediately pressured by Harry Carson and then swarmed from behind by Taylor as he attempted to pass.\nWhen he was taken to the ground, Theismann's right leg was shattered as he suffered a compound fracture to both his tibia and fibula.\nThe sight of Taylor frantically waving to the Washington sideline was the first sign a serious injury had occurred, and then the Hall of Fame linebacker put both his hands to his head in a moment of disbelief.\n\"Quickly, Lawrence Taylor was up, saying Theismann was hurt, and I don't believe Lawrence Taylor would have reacted that way unless Theismann was\nreally\nhurt,\" ABC's Frank Gifford told the \"MNF\" audience.\nIt ended up being the final play of Theismann's career, and going down in history as the awful injury others would be compared to for decades.\nIn a poll on ESPN.com's Page 2 in the early 2000s, the injury was voted as the most shocking moment in football history.\nTheismann, who was the 1983 NFL MVP, a two-time Pro Bowler, a Super Bowl champion and went on to become a broadcaster in the \"MNF\" booth himself, became more synonymous with the injury than anything else that happened during his career.\nThe play was even referenced in an episode of \"The Simpsons\" and the opening scene of the Oscar-winning film \"The Blind Side.\"\nTheismann often talks openly about the injury, and he has regularly signed autographs on tickets an...",
    "title": "On 40th anniversary, Joe Theismann's awful injury remains unforgettableLawrence Taylor's career-ending sack of Theismann is hard to watch, but endures as a collectibleNovember 18, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/on-40th-anniversary-joe-theismann-s-awful-injury-remains-unforgettable",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:18.685367",
    "summary": "Lawrence Taylor's career-ending sack of Theismann is hard to watch, but endures as a collectible"
  },
  {
    "text": "Michael Jordan's earliest autograph? Youth baseball program has rich historyAt age 12, His Airness signed a program for a 1975 state baseball tournamentDecember 19, 2025\n\nAt age 12, His Airness signed a program for a 1975 state baseball tournament\n\nMichael Jordan's earliest autograph? Youth baseball program has rich history\nAt age 12, His Airness signed a program for a 1975 state baseball tournament\nAlthough known as Mike Jordan as a youngster, the NBA legend signed the program with the name that made him famous. (Credit: Hunt Auctions)\nBy\nDarren Rovell\n—\nDecember 19, 2025\nShare\nLong before Michael Jordan was a six-time NBA champion with the Chicago Bulls, the future GOAT stood in the driveway of 505 North Watterson Street in Kings Mountain, North Carolina, with a basketball in his hand.\nIt was the winter of 1985, and the 22-year-old Jordan was in an intense free-throw contest with young Justin Jones, 10.\nAfter Jones hit eight of 10 at the stripe, it was MJ’s turn to show off his clutch gene. In typical Jordan style, he made 10 straight with his right hand, 10 straight with his left hand and 10 straight with his eyes closed.\nJordan was shooting hoops with a kid, instead of dazzling on an NBA court during his second season, because he had fractured a bone in his left foot and was back in the state where he grew up.\nWhy specifically here, in Kings Mountain?\nWell, a decade earlier, Jordan came to town with his youth team from Wilmington, N.C., to participate in the 1975 Dixie Youth Baseball State Tournament.\nBecause Jordan’s team had traveled 238 miles to the tournament and, like some other teams, could not return home in between games, Frank and Nina Mitchem volunteered to host Jordan and another player, Reggie Murrill. Jones is the grandson of the Mitchems.\nMichael Jordan would often visit Nina Mitchem and her family years after being hosted at their home as a youth baseball player. (Credit: Hunt Auctions)\nJordan, then 12, nearly threw a no-hitter and hit a three-run home run during the tournament for his team, the Cape Fear Optimist, and won “Mr. Baseball” for his age division. A completed bracket inside the tournament program suggests Jordan’s team went on to win it all.\nBefore Jordan and Mitchem left the house after the tournament, Nina, according to family lore, asked the boys to sign the program “for when they become famous.” Mitchem also had Jordan and Murrill write their home phone numbers so she and her husband could keep in touch.\nThe tournament was only six days, but Jordan and the Mitchems did keep in touch. The relationship was so special that even as MJ rose in prominence, he returned to Kings Mountain every summer until about 1988.\nWhen Nina Mitchem died in 1999, the family found letters exchanged between her and Jordan. But it wasn’t until 2012, in cleaning a closet in the house when the family found the signed Dixie program.\nIn the recent months, Jones, now the owner of his grandparents' program, was looking to add more insurance t...",
    "title": "Michael Jordan's earliest autograph? Youth baseball program has rich historyAt age 12, His Airness signed a program for a 1975 state baseball tournamentDecember 19, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/autographs/michael-jordan-s-earliest-autograph-youth-baseball-program-has-rich-history",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:19.694123",
    "summary": "At age 12, His Airness signed a program for a 1975 state baseball tournament"
  },
  {
    "text": "Honus Wagner-signed baseball sells for near-record $123,375As the T206 card has increased Wagner's legend in the hobby, his autographed items are climbingNovember 17, 2025\n\nAs the T206 card has increased Wagner's legend in the hobby, his autographed items are climbing\n\nHonus Wagner-signed baseball sells for near-record $123,375\nAs the T206 card has increased Wagner's legend in the hobby, his autographed items are climbing\nHonus Wagner played for 21 seasons and coached for 19 more, making his autographs abundant. (Credit: Hunt Auctions)\nBy\nDarren Rovell\n—\nNovember 17, 2025\nShare\nHonus Wagner's card made him a legend.\nThe T206 is somehow more well-known than Wagner's Hall of Fame career.\nYet autographed Wagner memorabilia is progressively getting more expensive.\nLast week, a single-signed Wagner ball, with an estimate of $25,000 to $50,000, sold at Hunt Auctions for $123,375, falling just short of the $126,000 record at Heritage in May 2021.\nThe Hunt signature was given a near mint 7 by PSA/DNA, matching a single-signed Wagner near-mint 7 sold by Goldin in 2013. That ball sold for $37,645.\nRELATED STORIES:\nHall of Fame program signed by Ruth, Cobb, Wagner sells for record $315k\nDespite $4.15 million bid, T206 Honus Wagner card fails to meet reserve\nWhy the $2 million price for T206 Honus Wagner is major cause for concern\nFor first time in 30 years, no T206 Honus Wagner sold publicly in 2024\nWagner's signatures are not rare. He played for 21 seasons, and he coached for 19 more. For 10 years, the member of the initial Hall of Fame class had a sporting goods store in Pittsburgh, where fans could get his autograph.\nThere are plenty of Wagner-signed index cards, business cards and government postcards, and they are still relatively cheap compared to balls — he signed much fewer than Babe Ruth — but even those haven risen in value.\nOn Sunday, a Wagner-signed government postcard sold for nearly $2,000 at Grey Flannel Auctions, roughly three times the price of what the equivalent signature sold 10 years ago.\nThe T206 Wagner card, which continually seems to set records, has undoubtedly augmented the shortstop to relevancy and gets an audience of people who never saw him play — his last season was 1917 — more impetus to look up just how great he was.\nThere's no argument, both in hitting and fielding that he was the greatest shortstop ever. In 21 years of playing in the \"Deadball Era,\" he won five batting titles, had a career average of .328 and had 3,420 hits. Using more modern stats, Wagner finished in the top 10 in OPS 15 times in his career.\nSaid Hall of Fame manager John McGraw: \"You can have your (Ty) Cobbs, your (Nap) Lajoies, your (Hal) Chases, your (John Franklin) Bakers, but I'll take Wagner as my pick of the greatest.\"",
    "title": "Honus Wagner-signed baseball sells for near-record $123,375As the T206 card has increased Wagner's legend in the hobby, his autographed items are climbingNovember 17, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/auctions/honus-wagner-signed-baseball-sells-for-near-record-123-375",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:20.492468",
    "summary": "As the T206 card has increased Wagner's legend in the hobby, his autographed items are climbing"
  },
  {
    "text": "Why Robert Redford ranks among Hollywood's most valuable autographsSigned items are very rare from the legendary actor, who died Tuesday at age 89September 17, 2025\n\nSigned items are very rare from the legendary actor, who died Tuesday at age 89\n\nWhy Robert Redford ranks among Hollywood's most valuable autographs\nSigned items are very rare from the legendary actor, who died Tuesday at age 89\nRobert Redford earned his first Oscar nomination in 1973 as Best Actor in \"The Sting.\" He won the Academy Award for Best Director in 1980 for \"Ordinary People.\" (Credit: Getty Images)\nBy\nDarren Rovell\n—\nSeptember 17, 2025\nShare\nWhen Tino Capobianco settled into his first-class seat on a flight from Boston to New York in June 2014, he had a strong indication he knew who going to be sitting next to him.\nAs an autograph collector, Capobianco had long tried to get a signature from Robert Redford, the award-winning actor who died Tuesday at the age of 89.\n\"He was the white whale,\" Capobianco told cllct of his quest to land an autograph from the legendary actor, filmmaker and environmental activist. \"It's not even (solely) for the value, because there are other signatures more valuable. But for the challenge, all of us wanted him in our collection.\"\nCapobianco had gotten close to Redford, but like many others, he had failed to land the Oscar winner's signature.\nAfter being rebuffed at UMass-Lowell, where Redford had been interviewed on-stage at an event called the Middlesex County College Forum, Capobianco learned Redford was headed to New York on a certain flight. The collector said he bought a first-class seat and sat down next to the star.\n\"It was a very short flight,\" Capobianco said. \"As the plane started to descend, I said, 'Mr. Redford, I travel with a baseball just in case I meet anyone famous, would you sign this for me?'\"\nRedford, Capobianco recalled, reached out his hand, took the baseball, signed it and then handed it back to Capobianco without saying a word.\n\"He wasn't happy about it, but he signed it beautifully,\" Capobianco said.\nIt was the 1984 movie \"The Natural\" that hooked so many collectors, forever connecting the actor to baseball.\nHis portrayal of Roy Hobbs in \"The Natural\" in 1984 endeared Redford to baseball fans. (Credit: Getty Images)\nIn 2022, a screen-matched Wonderboy bat from the film sold for an astounding $137,000, and in 2024, a replica signed Wonderboy bat sold for $4,800, a huge price for someone who was still alive.\nGlenn Gagnon might have been the most successful with getting the man behind the portrayal of Roy Hobbs. The autograph collector from Massachusetts said he got autographs from Redford three times, including once at a Brown graduation and another time thanks to some fancy attire.\nIn March 2009, Redford was being honored at a dinner at the Waldorf-Astoria Hotel in New York.\n\"There were other guys who got into the building early in hopes of getting his autograph, but I was the only one who walked out with one,\" Gagnon sai...",
    "title": "Why Robert Redford ranks among Hollywood's most valuable autographsSigned items are very rare from the legendary actor, who died Tuesday at age 89September 17, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/autographs/why-robert-redford-ranks-among-hollywood-s-most-valuable-autographs",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:21.353365",
    "summary": "Signed items are very rare from the legendary actor, who died Tuesday at age 89"
  },
  {
    "text": "MJ, Brady, Babe, Messi and Gretzky: How five GOATS signed one piece of paperAutograph collector Patrick Ryan recently completed a yearlong quest to have five legends sign one itemAugust 07, 2025\n\nAutograph collector Patrick Ryan recently completed a yearlong quest to have five legends sign one item\n\nMJ, Brady, Babe, Messi and Gretzky: How five GOATS signed one piece of paper\nAutograph collector Patrick Ryan recently completed a yearlong quest to have five legends sign one item\nTom Brady recently got a look at the finished piece with all five autographs. (Credit: The PRyan Collection on Instagram)\nBy\nPatrick Ryan, as told to Darren Rovell\n—\nAugust 07, 2025\nShare\nLast June, I spent $14,047.20 at Lelands Auctions on an autograph book featuring a bunch of signatures of baseball stars, including Babe Ruth and Lou Gehrig.\nWhen I won the auction, my plan was to get each page slabbed. But when I came up to the Ruth page, it seemed like the small signature on the large paper could create a special opportunity.\nKnowing I was going to be at the \"Sotheby's x Fanatics\" auction in September, and Tom Brady was going to be there, I thought about making a GOAT piece, adding Brady to my Ruth ... and then eventually icons from basketball (Michael Jordan), hockey (Wayne Gretzky) and soccer (Lionel Messi).\nRyan had the piece authenticated by PSA with the label \"Sports GOATS.\" (Credit: The PRyan Collection on Instagram\nAt the auction, I won a Jackie Robinson card and sat behind Brady, who didn't win any of the cards.\nWhen he got up, I said to Brady, \"Hey, I don't want you to leave empty-handed,\" and I gave him a ticket to \"The Catch\" — otherwise known as Joe Montana's epic pass to Dwight Clark — from 1982. Brady famously attended that historic NFC Championship Game as a kid.\nBrady said thanks, and I asked him quickly if he could sign an autograph, and he obliged. He was going through the motions of his usual signing when he looked down on the page, and his eyes widened — all of a sudden, he realized his signature was joining Babe Ruth's autograph.\nFor three months, Ruth and Brady sat alone, until Dec. 31, when Wayne Gretzky's autograph joined the bunch.\nIt wasn't an easy task. I had gone to Wrigley Field the night before the Winter Classic to see \"Gretzky's Basement,\" which was this awesome set up of what Gretzky's room as a kid looked like. He was supposed to be there that night. But when he didn't show, I had to do the unthinkable. I had to leave it to my friend to get it signed. You see, I was headed off to watch my Texas Longhorns beat Arizona State in the Peach Bowl the next day.\nThe original idea was to have the two team sport athletes whose sports didn't emanate in America — Gretzky with hockey and Leo Messi with soccer — sign on the side of the piece. I should have labeled the item with clear instructions, but when it comes to getting a free signature from\nThe Great One\n, beggars cant be choosers. Gretzky signed a little big, and I needed to consider how to fi...",
    "title": "MJ, Brady, Babe, Messi and Gretzky: How five GOATS signed one piece of paperAutograph collector Patrick Ryan recently completed a yearlong quest to have five legends sign one itemAugust 07, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Patrick Ryan, as told to Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/autographs/mj-brady-babe-messi-and-gretzky-how-five-goats-signed-one-piece-of-paper",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:22.193300",
    "summary": "Autograph collector Patrick Ryan recently completed a yearlong quest to have five legends sign one item"
  },
  {
    "text": "Harrison Bader gifts signed bat to young fan who lost home-run ballViral confrontation over baseball took internet by storm at Phillies-Marlins gameSeptember 06, 2025\n\nViral confrontation over baseball took internet by storm at Phillies-Marlins game\n\nHarrison Bader gifts signed bat to young fan who lost home-run ball\nViral confrontation over baseball took internet by storm at Phillies-Marlins game\nHarrison Bader presents a young fan with an autographed bat after the Phillies' win in Miami on Friday night. (Credit: Philadelphia Phillies)\nBy\nKevin Jackson\n—\nSeptember 06, 2025\nShare\nThe rules are pretty simple and straightforward: When you attend a sporting event, be a decent human being. And whatever you do, never take a souvenir away from a kid.\nThose basic tenants were violated again Friday night at the Phillies-Marlins game in Miami, where a confrontation ensued over a home-run ball off the bat of Philadelphia’s Harrison Bader.\nA Phillies fan retrieves a home run ball for his son and this woman is furious she did not get the ball\npic.twitter.com/kDMMJrw2R5\n— Jomboy Media (@JomboyMedia)\nSeptember 6, 2025\nBader’s fourth-inning blast landed in the left-field stands, a row in front of a woman wearing a Phillies sweatshirt. After she and a couple other fans reached down in pursuit of the baseball, a man in a red Phillies shirt emerged with the ball and immediately gave it to a young boy who was attending the game with him.\nAs the man presented the ball to the boy and began to hug him in celebration, the woman angrily rushed in and confronted him while shouting, “That was mine. You took it from me.”\nVideo replays — and there are no shortage of them as the incident took the internet by storm — showed the woman never had her hands on the baseball, and it was sitting free on the ground when the man scooped it up.\nTaken aback by the woman’s anger, the man decided to defuse the heated situation by giving the woman the baseball anyway.\nIf the story had ended there, it would be just another case of boorish fan behavior triumphing over a wholesome moment for a young fan.\nFortunately, the story does not end there.\nFirst, a representative from\nthe Marlins came into the stands\nto award the boy with a gift bag, including baseballs for him and his sister, and check to make sure he was OK.\nBader and the Phillies went even further, inviting the boy and his entire party down to meet Bader after the game,\nThe boy, who told Bader his name was Lincoln and said he would be celebrating his birthday in “a couple days,” was presented with an autographed bat by the Phillies outfielder.\nGoing home with a signed bat from Bader\npic.twitter.com/pCaXHSjLgL\n— Philadelphia Phillies (@Phillies)\nSeptember 6, 2025\n“Sorry you didn’t get a ball, but I’m going to sign a bat for you instead,” Bader said.\nThe Phillies won the game 9-3, but the real winner was ballpark karma.\nKevin Jackson is the chief content officer for\ncllct\n. He spent 25 years at ESPN Digital Media, where he was the fou...",
    "title": "Harrison Bader gifts signed bat to young fan who lost home-run ballViral confrontation over baseball took internet by storm at Phillies-Marlins gameSeptember 06, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/harrison-bader-gifts-signed-bat-to-young-fan-who-lost-home-run-ball",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:23.021074",
    "summary": "Viral confrontation over baseball took internet by storm at Phillies-Marlins game"
  },
  {
    "text": "Autograph dealer identified as man found dead in Indiana raid of fake memorabiliaBrett Lemieux, 45, detailed fraudulent scheme in alleged Facebook postJuly 17, 2025\n\nBrett Lemieux, 45, detailed fraudulent scheme in alleged Facebook post\n\nAutograph dealer identified as man found dead in Indiana raid of fake memorabilia\nBrett Lemieux, 45, detailed fraudulent scheme in alleged Facebook post\nSome of the memorabilia on the Mister Mancave site included autographed items from Kobe Bryant, Derek Jeter and Michael Jordan. (Credit: Mister Mancave)\nBy\nDarren Rovell and Kevin Jackson\n—\nJuly 17, 2025\nShare\nThe Hamilton County Coroner's Office identified autograph dealer Brett Lemieux, 45, as the man found dead when police executed a search warrant into a scheme involving fake sports memorabilia in Westfield, Indiana.\nIn a release Thursday, the coroner listed the cause and manner of death as pending, but in a statement Wednesday, Westfield police attributed \"a self-inflicted gunshot wound\" as the cause of death.\nA Facebook post attributed to Lemieux on the \"Autographs 101\" group sent shockwaves through the sports autograph industry Wednesday morning.\nIn the post allegedly written by Lemieux, he detailed a huge counterfeiting business that sold more than four million items and surpassed $350 million in sales.\nThe crux of the autograph forging operation was based in faking holograms of the largest companies in the hobby, including Panini, Fanatics, Tri-Star, James Spence Authentics, Mill Creek Sports, GT Sports Marketing and others.\nLemieux’s primary business was called Mister Mancave, which says on its website that it offers “the largest framed jersey inventory on the web.”\nA Facebook page for Mister Mancave says the business is located in Columbus, Ohio, but no records of a physical store there exist. Mister Mancave has been incorporated twice in Indiana between 2018 and 2023.\nIn the post attributed under his name, Lemieux said after Kobe Bryant died in January 2020, his company put out 80,000 fake items “into the marketplace.”\nSources told cllct Lemieux upset many companies that had official autograph deals with players because Lemieux's outlet would offer prices that were much lower and yet still featured holograms of authentication.\nAn Aaron Judge ball, for example, would sell on Fanatics for $699. Lemieux's website at Mister Mancave would offer a Judge ball, with a Fanatics hologram, for $399.\nA Fanatics spokesperson said the company made big changes to its hologram two years ago after receiving information its former holograms had been copied. The new hologram has not been replicated since, the spokesperson said. Fanatics is currently working with two other partners to make additional changes that will make its stickers more counterfeit-proof.\nSources say Fanatics has worked closely with law enforcement over the past few years, including the Lemieux case and the\nfake autograph ring in McKinney, Texas\n, that was unraveled earlier this year. Fanatics also e...",
    "title": "Autograph dealer identified as man found dead in Indiana raid of fake memorabiliaBrett Lemieux, 45, detailed fraudulent scheme in alleged Facebook postJuly 17, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Darren Rovell and Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/autographs/autograph-dealer-identified-as-man-found-dead-in-indiana-raid-of-fake-memorabilia",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:23.876234",
    "summary": "Brett Lemieux, 45, detailed fraudulent scheme in alleged Facebook post"
  },
  {
    "text": "Philadelphia man pleads guilty to selling forged Jason Kelce items worth $200kRobert Capone, 51, pleads to three felony charges, one misdemeanorAugust 06, 2025\n\nRobert Capone, 51, pleads to three felony charges, one misdemeanor\n\nPhiladelphia man pleads guilty to selling forged Jason Kelce items worth $200k\nRobert Capone, 51, pleads to three felony charges, one misdemeanor\nJason Kelce was a six-time All-Pro center and Super Bowl champion in 13 seasons with the Eagles. (Credit: Getty Images)\nBy\nBen Burrows\n—\nAugust 06, 2025\nShare\nThe owner of a Philadelphia marketing and booking firm pleaded guilty Tuesday to four charges related to the selling of forged Jason Kelce memorabilia valued at an estimated $200,000.\nOvertime Promotions owner Robert Capone, 51, of Philadelphia, pleaded guilty in Montgomery County (Pennsylvania) Court on Tuesday to conspiracy to commit theft by deception, theft by deception and deceptive business practices, all third-degree felonies, and forgery, a first-degree misdemeanor.\nRestitution will be determined following a pre-sentencing investigation into victim impact.\nCapone, along with LeeAnn Branco, 43, of Bristol, Rhode Island, and Joseph Parenti, 39, of Cranston, Rhode Island, were charged with 60 felony counts by the Montgomery County District Attorney in January.\nCharges against Branco, an independent contractor for Beckett Authentication, and Parenti, owner of memorabilia store Diamond Legends, were withdrawn in June following new evidence that showed the two weren’t part of the forgery scheme.\nCharges originally alleged Capone conspired with Branco and Parenti to forge more than 1,100 pieces of memorabilia with fake Kelce signatures.\nThe items were purportedly signed by Kelce, a former Philadelphia Eagles offensive lineman and Super Bowl champion, at the Valley Forge Casino Hotel in King of Prussia, Pennsylvania, on June 11-12, 2024. The forged items were later sold by Overtime Promotions and Diamond Legends.\nAlfred P. Sicoli, 51, of Penndel, Pennsylvania, was charged in March in connection with the alleged scheme. According to court documents, detectives alleged Sicoli was contracted by Capone to sign the forged Kelce autographs as well as inscriptions.\nBen Burrows is a reporter and editor for\ncllct\n, the premier company for collectible culture. He was previously the Collectibles Editor at Sports Illustrated. You can follow him on X and Instagram @benmburrows.",
    "title": "Philadelphia man pleads guilty to selling forged Jason Kelce items worth $200kRobert Capone, 51, pleads to three felony charges, one misdemeanorAugust 06, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Ben Burrows",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/philadelphia-man-pleads-guilty-to-selling-forged-jason-kelce-items-worth-200k",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:24.630035",
    "summary": "Robert Capone, 51, pleads to three felony charges, one misdemeanor"
  },
  {
    "text": "Rovell: The 10 coolest items I saw at the NationalCllct founder Darren Rovell loves the truly unique collectible — and he found several grails in ChicagoAugust 04, 2025\n\nCllct founder Darren Rovell loves the truly unique collectible — and he found several grails in Chicago\n\nRovell: The 10 coolest items I saw at the National\nCllct founder Darren Rovell loves the truly unique collectible — and he found several grails in Chicago\nA debut ticket, a movie helmet and a true work of art all caught Darren Rovell's eye in Chicago. (cllct photos by Darren Rovell)\nBy\nDarren Rovell\n—\nAugust 04, 2025\nShare\nROSEMONT, Illinois — I took a ton of steps at The National Sports Collectors Convention, and, after five days, I think I found my way to every table.\nThere were so many cards, boxes and mystery packs, but there also were several incredible pieces of memorabilia that stood out.\nHere are the Top 10 things that caught my eye.\n1. Texas State University autographed helmet\nThe \"Unnecessary Roughness\" helmet was awaiting Jim Kelly's signature. (cllct photo by Darren Rovell)\nIn the private autograph room, there was a lot of the same. Heisman-signed helmets and Hall of Fame items were everywhere.\nBut at cllct, we appreciate the true one of ones.\nAutograph dealer Matt Powers was helping a collector get Jim Kelly's autograph on a Texas State Armadillos helmet. Some of you might be too young for this, but TSU was the fictional team in the 1991 movie \"Unnecessary Roughness.\"\nThe helmet already had signatures from many of the players who had cameos in the film, including Ed \"Too Tall\" Jones, Jerry Rice and Dick Butkus. Impressively, Rob Schneider signed with a \"Fumbalaya Fumblerooski\" inscription. The only ones missing now? Swimsuit model Kathy Ireland and actor/comedian Sinbad!\n2. 1973 Wacky Packages\nI always stop by Baseball Card Exchange's booth to see what unopened boxes they are selling — all still in their original wrapped plastic.\nThis year, the most expensive box at the booth was a 1979-80 Hockey box for $165,000. But the one that caught my eye was\na box of Series 2 of Wacky Packages\n. Originally sold in 1973 for $2.80 for the entire box, this unopened box was going for $40,000.\n3. The Greek feet\nThe National was Giannis Antetokounmpo's first major autograph signing, and collectors were ready.\nThere must have been 500 pair of sneakers\nwaiting backstage for the Milwaukee Bucks star to sign. All were size 17, and many were player exclusives.\n4. An Elvis Presley pill bottle\nI held off on a number of major purchases at The National, but I got closest to buying one of Elvis Presley's used pill bottles from the Rockhurst Auctions booth.\nMost Elvis pills were prescribed at Memphis pharmacies. Love that this one was for weight loss for his Vegas shows.\n5. Rolling Stones ticket\nThe Rolling Stones' U.S. debut ticket was a true rarity. (cllct photo by Darren Rovell)\nOut of all the ticket submissions coming into The National, my friend Barry Slotnick had one of the coolest to...",
    "title": "Rovell: The 10 coolest items I saw at the NationalCllct founder Darren Rovell loves the truly unique collectible — and he found several grails in ChicagoAugust 04, 2025",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/rovell-the-10-coolest-items-i-saw-at-the-national",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:25.711803",
    "summary": "Cllct founder Darren Rovell loves the truly unique collectible — and he found several grails in Chicago"
  },
  {
    "text": "Johnny Manziel on NIL, Heisman legacies, and beating Alabama\n\nJohnny Manziel chats with cllct's Meghan Payton about Texas A&M, memorabilia, Heisman legacies, NIL, the transfer portal and much more.\n\n00:00:NaN\nJohnny Manziel on NIL, Heisman legacies, and beating Alabama\nAugust 23, 2025\nShare\nJohnny Manziel chats with cllct's Meghan Payton about Texas A&M, memorabilia, Heisman legacies, NIL, the transfer portal and much more.\nWhat is the one jersey his dad would never let him sell? Plus, does he resent current collegiate athletes who are able to earn money for their name, image and likeness?",
    "title": "Johnny Manziel on NIL, Heisman legacies, and beating Alabama",
    "source": "Cllct",
    "category": "Autographs",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/johnny-manziel-on-nil-heisman-legacies-and-beating-alabama",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:26.459511",
    "summary": "Johnny Manziel chats with cllct's Meghan Payton about Texas A&M, memorabilia, Heisman legacies, NIL, the transfer portal and much more."
  },
  {
    "text": "Seth Freakin' Rollins is amazed by the growth of the collectibles industry\n\nWWE superstar Seth Rollins joins cllct's Darren Rovell form the Javits Center at Fanatics Fest. \n\n\n00:00:NaN\nSeth Freakin' Rollins is amazed by the growth of the collectibles industry\nJune 24, 2025\nShare\nWWE superstar Seth Rollins joins cllct's Darren Rovell form the Javits Center at Fanatics Fest.\nRollins, who admits he isn't a big collector, saying \"less is more\", admits he has kept one item from his wrestling career that he cherishes.\nPlus, Darren makes Rollins a special promise.",
    "title": "Seth Freakin' Rollins is amazed by the growth of the collectibles industry",
    "source": "Cllct",
    "category": "Autographs",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/seth-freakin-rollins-is-amazed-by-the-growth-of-the-collectibles-industry",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:27.237680",
    "summary": "WWE superstar Seth Rollins joins cllct's Darren Rovell form the Javits Center at Fanatics Fest. \n"
  },
  {
    "text": "Kevin JacksonA $5 baseball, a priceless autograph and a lasting memory of Ryne SandbergForty years ago, the Cubs Hall of Famer gave some young fans a signature they'll never forgetForty years ago, the Cubs Hall of Famer gave some young fans a signature they’ll never forget1\n\nForty years ago, the Cubs Hall of Famer gave some young fans a signature they’ll never forget\n\nA $5 baseball, a priceless autograph and a lasting memory of Ryne Sandberg\nForty years ago, the Cubs Hall of Famer gave some young fans a signature they'll never forget\nHall of Fame second baseman Ryne Sandberg was a longtime fan favorite in Chicago. (Credit: Getty Images)\nBy\nKevin Jackson\n—\nJuly 28, 2025\nShare\nI can’t remember the first autograph I ever got from an athlete.\nBut I can vividly recall the first signature that truly meant something to me.\nOn an unseasonably gray morning on the last day of July in 1985, I walked into Wrigley Field for the first time.\nMy best friend, Tim Thatcher, had convinced his parents to let me tag along on a family trip to the Midwest, which would include seeing baseball games in Chicago, Cleveland and Cincinnati.\nWhile we were excited about watching the Yankees at the “Mistake by the Lake” and Pete Rose was in pursuit of Ty Cobb’s career hits record in Cincy, the clear highlight of the entire trip was going to be the afternoon at the Friendly Confines.\nKevin Jackson, left, and Tim Thatcher revisited Wrigley Field two decades after their first trip in 1985. (cllct photo by Kevin Jackson)\nI remember praying the night before that the rain would hold off long enough for the Cardinals and Cubs to play the game scheduled for 1:20 p.m. And if they couldn’t get in all nine innings, we at least hoped they’d open the park for a couple of 15-year-old fans to roam the bleachers.\nThe rains held off just enough, and we were lined at the intersection under the famous marquee at the intersection of Clark and Addison an hour before the gates opened.\nWhile we waited, Tim’s mom wandered to a nearby souvenir stand and purchased three $5 “souvenir” baseballs for Tim, his younger brother, Todd, and me. A Cubs logo was printed inside the curve of the laces and the packaging said the balls were “perfect for autographs.” In reality, they were those slick, plastic-like balls from the ‘80s that felt nothing like an authentic baseball.\nIt didn’t matter: Tim was on a mission, and that cheap ball was critical.\nTo say Tim was obsessed with Ryne Sandberg would be an understatement. The Nike “Cornerstone” poster of a leaping Sandberg hung above Tim’s bed, and my friend had almost an entire binder filled with Sandberg baseball cards — even though the Cubs’ Hall of Fame second baseman was in just his fourth season at the time.\nPlus, Sandberg was from Washington state — just like the two of us.\nI can still picture the gates opening, rushing the usher to tear our tickets and sprinting with Tim to the front row of the stands along the right-field line.\nAs we caught our first glimpse o...",
    "title": "Kevin JacksonA $5 baseball, a priceless autograph and a lasting memory of Ryne SandbergForty years ago, the Cubs Hall of Famer gave some young fans a signature they'll never forgetForty years ago, the Cubs Hall of Famer gave some young fans a signature they’ll never forget1",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/a-5-baseball-a-priceless-autograph-and-a-lasting-memory-of-ryne-sandberg",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:28.063383",
    "summary": "Forty years ago, the Cubs Hall of Famer gave some young fans a signature they’ll never forget"
  },
  {
    "text": "AutographsAfter 40 years, Michael J. Fox and 'Back to the Future' still rule autograph circuitAnniversary event in New Orleans shows why 1985 film remains so belovedAnniversary event in New Orleans shows why 1985 film remains so beloved2\n\nAnniversary event in New Orleans shows why 1985 film remains so beloved\n\nAfter 40 years, Michael J. Fox and 'Back to the Future' still rule autograph circuit\nAnniversary event in New Orleans shows why 1985 film remains so beloved\nMichael J. Fox and the \"Back to the Future\" cast were a huge draw for fans at an autograph signing in New Orleans over the weekend. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nJanuary 13, 2025\nShare\nNEW ORLEANS — A line of more than 500 people waits to get autographs from the man behind the curtain at the Ernest N. Morial Convention Center in New Orleans on Friday afternoon.\nSome are holding so many items, they are in tow with suitcases and portable wagons despite the fact it's $250 to $400 per autograph.\nFans lined up throughout the Ernest N. Morial Convention Center to get autographs from the cast. (cllct photo by Darren Rovell)\nAt 4:30 p.m., the line starts moving. One thing everyone notices? It's faster than any autograph line you'll ever see. There are no phones allowed, but what you'll see behind that curtain should be documented as a model of efficiency.\nAt the front of the line, the curtain pulls back. There are five men at the table.\nOne takes the customer's items. One matches up the pens. One hands the item to the man in the middle and points to where it needs to be signed. And one man hands the items back to the customer and points them to the exit.\nThere's music blasting. The man in the middle is at peak performance.\nThe rocking back and forth is an unfortunate effect of the Parkinson's Disease that has ravaged his body. He needs help getting to and from chairs, and his speech is often slurred, but what will define the life of Michael J. Fox is that he just kept going.\nAnd there's nothing more evident than what's happening here at the \"Back to the Future\" 40th anniversary event. His signature has definitely declined over the years — some autographs are better than others, some days are worse than others — but he keeps signing for his fans.\nFox, pictured with co-star Lea Thompson, left, keeps signing for his fans even while dealing with the effects of Parkinson's Disease. (Credit: Getty Images)\nEstimates are often hard to nail down, and the executives behind this particular show, FAN EXPO, won't share numbers. However, on this weekend in New Orleans, Fox likely signed more than 3,000 autographs in 48 hours.\nThat's close to grossing $1 million, and that's not even counting the photo opportunities.\nTo stand in between Marty McFly and Doc Brown for a photo is $372.\nThe fans have a love for the actor Fox was in many roles, but most of them are here to get his signature on items from \"Back to the Future,\" with the movie celebrating its four-decade anniversary.\nAnd here in New Orlean...",
    "title": "AutographsAfter 40 years, Michael J. Fox and 'Back to the Future' still rule autograph circuitAnniversary event in New Orleans shows why 1985 film remains so belovedAnniversary event in New Orleans shows why 1985 film remains so beloved2",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/autographs/after-40-years-michael-j-fox-and-back-to-the-future-still-rule-autograph-circuit",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:28.995800",
    "summary": "Anniversary event in New Orleans shows why 1985 film remains so beloved"
  },
  {
    "text": "AutographsWhy so many Michael Jordan autographs are fake: A cllct investigationJSA says it fails about 95 percent of MJ signatures; we explain how the fraud worksJSA says it fails about 95 percent of MJ signatures; we explain how the fraud works3\n\nJSA says it fails about 95 percent of MJ signatures; we explain how the fraud works\n\nWhy so many Michael Jordan autographs are fake: A cllct investigation\nJSA says it fails about 95 percent of MJ signatures; we explain how the fraud works\nDespite having certificates of authenticity, fake Michael Jordan-autographed items hit the market every day. (Credit: G.O.A.T. Authentics)\nBy\nDarren Rovell\n—\nSeptember 08, 2024\nShare\nFor at least 30 years, the most forged autograph in the world has been Michael Jordan.\nAt third-party authenticator James Spence Authentication, vice president Jimmy Spence says he sees at least one fake MJ autograph every single day.\nThe percentage of Jordan signatures Spence says he fails is an astounding 95 percent — 30 percent higher than the next highest, Tiger Woods.\nAs retail prices for Jordan memorabilia have skyrocketed — Upper Deck sold a signed basketball for $699 in 1994; the cheapest today is $7,999 — fraudsters have swooped in like never before. And because of some holes in the authentication process, they are getting away with selling counterfeit items at record levels.\nThe quality of fake Jordan autographs has improved over the last several years. This one? Not so much. (Credit: G.O.A.T. Authentics)\nFor years, Jordan's signature alone proved to be a safety measure of sorts, as his \"M\" and \"J\" were challenging to forge. But autopens got better, and so, too, did the humans. And the authenticity measures? They haven't changed.\nIn 1992, Upper Deck joined forces with then-Los Angeles Kings owner Bruce McNall to create Upper Deck Authenticated. The company took athletes it already had deals with — including Mickey Mantle, Reggie Jackson, Wayne Gretzky, Joe Montana and others — and came up with a \"patented five-step process\" to prove to collectors that signatures were real.\nAt the time, it seemed impressive and precedent setting.\nAll autographs witnessed. A notary on hand. Each item with its own number stored in a \"registered secure data bank,\" and, of course, a tamper-proof hologram that became the hallmark of Upper Deck in 1989, when the brand debuted its first set of baseball cards.\nThe company might be a shell of its former self from the days when it held all four U.S. pro sports licenses — as it hasn't had the NBA and MLB since 2009, and it lost the NFL in 2017. But one thing it did not lose was the star power on its Upper Deck Authenticated side, keeping Jordan and Tiger Woods, Gretzky and LeBron James (until recently).\nIf Upper Deck today still has among the best authentication systems, it's not because the company has gotten better; it's because others haven't evolved, either.\n\"I wouldn't say our program doesn't work,\" Upper Deck president Jason Masherah said. \"The vast ma...",
    "title": "AutographsWhy so many Michael Jordan autographs are fake: A cllct investigationJSA says it fails about 95 percent of MJ signatures; we explain how the fraud worksJSA says it fails about 95 percent of MJ signatures; we explain how the fraud works3",
    "source": "Cllct",
    "category": "Autographs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/autographs/why-so-many-michael-jordan-autographs-are-fake-a-cllct-investigation",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:29.827285",
    "summary": "JSA says it fails about 95 percent of MJ signatures; we explain how the fraud works"
  },
  {
    "text": "January 04, 2026Collector closing in on quest for every Michael Jordan NBA ticketHis Airness played 1,264 NBA games, and one Chicago collector is just 136 tickets away from amassing them allRead the story-->\n\nHis Airness played 1,264 NBA games, and one Chicago collector is just 136 tickets away from amassing them all\n\nCollector closing in on quest for every Michael Jordan NBA ticket\nHis Airness played 1,264 NBA games, and one Chicago collector is just 136 tickets away from amassing them all\nAndrew Goldberg has collected 1,128 of Michael Jordan's 1,264 NBA tickets, including every playoff game. (Photos courtesy of Andrew Goldberg)\nBy\nDarren Rovell\n—\nJanuary 04, 2026\nShare\nAndrew Goldberg isn't done yet, but he has some sense of accomplishment after acquiring two NBA playoff tickets last week.\nIn 2015, the native Chicagoan decided to seek to collect every ticket from the famous 1995-96 season when the Bulls won 72 games.\n\"I was spending so much time on it, and saw how much was out there, that I just figured, why not do it all?\" said Goldberg, the 52-year-old executive director of the Memphis Ballet.\nAnd with that, he decided to collect every NBA regular-season, postseason and All-Star Game that Jordan played in, a total of 1,264 games.\n\"I've always been collecting things, whether it be comic books or baseball cards,\" Goldberg said. \"I've never particularly been any good at it.\"\nGoldberg now stands 136 tickets away, but he has finished the playoff set, thanks to recently getting a 1986 game against the Boston Celtics and a 1988 contest against the Detroit Pistons.\nMichael Jordan's 63-point playoff game in 1986 was one of Goldberg's last missing postseason tickets. (Photo courtesy of Andrew Goldberg)\nThe 1986 game was the record-setting game when MJ set the NBA playoff record with 63 points in the Boston Garden. After the game, Larry Bird told reporters the performance was \"God disguised as Michael Jordan.\"\nGoldberg had held out because of the price of the record-setting game, but he finally decided to bite the bullet.\nThe other one was Game 2 of the 1988 playoffs against Detroit when Jordan's Bulls got their first ever playoff victory.\nGoldberg doesn't want to say how much he has paid, but he has subsidized his quest by selling duplicate tickets.\nGoldberg said his pursuit got off to a decent start with around 200 game stubs because, as a kid, he would save the tickets his father used as a Bulls season-ticket holder. The first year, he was able to buy or trade for 322 different tickets. The second year was 112. As he collected, there were fewer tickets to get. In 2025, he only got 19.\nThere are definitely some fans of teams who have seemingly done a less than admirable job of saving their tickets.\nShockingly, Goldberg needs 38 games from Jordan's days playing for the Washington Wizards.\n\"As far as the Bulls go, the two cities I need the most from are Atlanta (15 games) and Cleveland (10 games),\" Goldberg said.\nRELATED STORIES:\nFour tickets to Michael...",
    "title": "January 04, 2026Collector closing in on quest for every Michael Jordan NBA ticketHis Airness played 1,264 NBA games, and one Chicago collector is just 136 tickets away from amassing them allRead the story-->",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/ticket-stubs/collector-closing-in-on-quest-for-every-michael-jordan-nba-ticket",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:30.725119",
    "summary": "His Airness played 1,264 NBA games, and one Chicago collector is just 136 tickets away from amassing them all"
  },
  {
    "text": "Ticket from Lou Gehrig's 'Luckiest Man\" speech sells for $164,700Graded PSA 1.5, the ticket smashed its pre-sale estimate of $50kDecember 21, 2025\n\nGraded PSA 1.5, the ticket smashed its pre-sale estimate of $50k\n\nTicket from Lou Gehrig's 'Luckiest Man\" speech sells for $164,700\nGraded PSA 1.5, the ticket smashed its pre-sale estimate of $50k\nPSA has only graded nine tickets from Lou Gehrig's speech July 4, 1939. (Credit: Getty Images)\nBy\nWill Stern\n—\nDecember 21, 2025\nShare\nOne of the few surviving tickets from Lou Gehrig’s “Luckiest Man” speech July 4, 1939,\nsold for $164,700 at Heritage Auctions\non Saturday night.\nThe ticket is one of the most sought-after in baseball history. (Credit: Heritage Auctions)\nThe ticket stub is graded PSA 1.5 and is one of nine graded by PSA. Four have been graded higher.\nTickets from Gehrig’s iconic speech, which he delivered to a crowd of 60,000 at Yankee Stadium, are among the most significant in the ticket collecting hobby, right up there with Jackie Robinson’s major-league debut.\nIt is rare to see copies up for auction. Heritage sold a PSA 2 example for $108,000 in February 2022.\nIn 2014, before the prices for graded tickets took off, the sole autographed copy of a ticket from that day sold for $95,600.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "Ticket from Lou Gehrig's 'Luckiest Man\" speech sells for $164,700Graded PSA 1.5, the ticket smashed its pre-sale estimate of $50kDecember 21, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/auctions/ticket-from-lou-gehrig-luckiest-man-speech-hits-auction-block",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:31.545234",
    "summary": "Graded PSA 1.5, the ticket smashed its pre-sale estimate of $50k"
  },
  {
    "text": "Huge lot of iconic Ken Griffey Jr. tickets sells for $7k on eBayAuction includes major milestones from Junior's career, including his MLB debut, first homer and 600th HRDecember 08, 2025\n\nAuction includes major milestones from Junior's career, including his MLB debut, first homer and 600th HR\n\nHuge lot of iconic Ken Griffey Jr. tickets sells for $7k on eBay\nAuction includes major milestones from Junior's career, including his MLB debut, first homer and 600th HR\nKen Griffey Jr.'s career was filled with milestones — and this ticket lot includes almost all of them. (Credit: Getty/eBay)\nBy\nKevin Jackson\n—\nDecember 08, 2025\nShare\nGrowing up in Vadalia, Georgia, Will Driggers was about as far away from Seattle as you can get without leaving the United States — but that didn't stop him from becoming a huge fan of Ken Griffey Jr.\n\"Every summer morning, you wake up and you put on ESPN, and it's Ken Griffey Jr., Mark McGwire and Sammy Sosa,\" Driggers, 39, said. \"I already had friends who were Mark McGwire and Sammy Sosa collectors, so I figured I'd be Griffey. ...\n\"He was kind of my guy from then on.\"\nThat fandom turned into a serious collecting addiction — and Driggers can recall the exact moment when his Griffey bug really became contagious.\n\"How I got hooked on baseball cards was I bought a pack of 1989 Upper Deck when they were like $7 a pack in 1998,\" Driggers recalled. \"I pulled two Griffey No. 1s out of one pack. At that point, I think they were about $150 raw, and so when you're 11 or 12 years old in 1998, that's 300 bucks, man. That's huge money.\"\nDriggers found himself amassing a vast collection of Griffey Jr. cards and tickets, striving to get every one of the Mariners star's key rookie cards in the highest grades.\n\"Not to be like braggadocious or anything like that, but I would say I probably have one of the top two or three Griffey rookie card collections in the world,\" he said.\nDriggers' Griffey Jr. collection got considerably smaller Sunday night when\naround three-dozen tickets\nfrom the Hall of Famer's career sold for $7,001 on eBay.\nThe batch included most of Junior's major milestones, including his major-league debut, his first hit, stolen base, home run and grand slam, his 500th and 600th homers and his final major-league game. There also was the first game he played with his father, his consecutive-games with a HR record, his All-Star Game performances and autographed tickets from his minor-league stops in Burlington, Vermont, and Bellingham, Washington.\nDriggers started building the collection after first acquiring the most difficult ticket in the lot, Griffey Jr.'s 1989 MLB debut in Oakland, in an online auction, thinking it would be a \"cool relic\" to own.\n\"That was my intro to ticket collecting, in general,\" said Driggers, who said he thinks he bought the ticket at Goldin Auctions, and that purchase led to him wanting more and more Griffey Jr. tickets over the next decade.\n\"At one point, I had 20 to 30 saved searches on eBay, looking ...",
    "title": "Huge lot of iconic Ken Griffey Jr. tickets sells for $7k on eBayAuction includes major milestones from Junior's career, including his MLB debut, first homer and 600th HRDecember 08, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/ticket-stubs/ken-griffey-jr-collector-sad-to-part-with-huge-lot-of-iconic-tickets",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:32.437436",
    "summary": "Auction includes major milestones from Junior's career, including his MLB debut, first homer and 600th HR"
  },
  {
    "text": "How NFL tickets once helped capture criminals in a sting operationForty years ago, U.S. Marshals busted more than 100 law-breakers in a sting operation in WashingtonDecember 15, 2025\n\nForty years ago, U.S. Marshals busted more than 100 law-breakers in a sting operation in Washington\n\nHow NFL tickets once helped capture criminals in a sting operation\nForty years ago, U.S. Marshals busted more than 100 law-breakers in a sting operation in Washington\nArt Monk and Washington were one of the hottest tickets in the NFL in 1985. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nDecember 15, 2025\nShare\nMonday marked the 40th anniversary of Operation Flagship.\nWhat is Operation Flagship?\nWell, unless your a law-enforcement historian, a sports fan in the Washington area, or know the connection to Al Pacino's 1989 movie \"Sea of Love,\" Operation Flagship is probably lost to time.\nBut it's worth remembering because on Dec. 15, 1985, the U.S. Marshals Service pulled off one of the most incredible criminal roundups of all time.\nWith only a $22,000 budget, federal officials apprehended an astounding 144 criminals in a single sting operation.\nThe concept was simple.\nIn the 1980s, Washington's NFL team was one of the hottest tickets in America.\nThe scheme: Send an invite to the last known address of wanted criminals, saying if they showed up at a party announcing a new TV station, they would get a free lunch and two free tickets to the Cincinnati-Washington game that day. The invite also included the chance to win tickets to Super Bowl XX the following month in New Orleans.\nWhen the respondents showed up, they were ushered into a single room decorated as an elaborate party for Flagship International Sports TV, complete with balloons and cheerleaders.\nThe author holds a PSA-graded ticket to the Operation Flagship game. (cllct photo by Darren Rovell)\nThe law-breaking fans didn't know that F.I.S.T. was also an acronym for the Fugitive Investigative Strike Team.\nWith operatives all around them, the attendees were swarmed, handcuffed and brought to jail.\nThe \"sports ticket as a sting operation\" concept was so clever, it was recreated in Pacino's \"Sea of Love,\" with Yankees tickets used as the bait to lure law-breakers.\nThere is very little memorabilia from Operation Flagship, though the invitation and a Flagship hat is in the U.S. Marshals Museum in Fort Smith, Arkansas.\nAlthough game tickets were never given out to the criminals in attendance, tickets from that Cincinnati-Washington game, slabbed by PSA as the \"Operation Flagship\" game, experienced a decent bump in value to roughly $200.\nPSA has graded just four tickets to that game, compared to 14 from the infamous game the month before when Washington quarterback Joe Theismann's leg was broken in a career-ending injury after a sack by Lawrence Taylor.\nPerhaps with more fans learning of the \"Operation Flagship\" story, more tickets will come to light.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\nc...",
    "title": "How NFL tickets once helped capture criminals in a sting operationForty years ago, U.S. Marshals busted more than 100 law-breakers in a sting operation in WashingtonDecember 15, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/how-nfl-tickets-once-helped-capture-criminals-in-a-sting-operation",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:33.480039",
    "summary": "Forty years ago, U.S. Marshals busted more than 100 law-breakers in a sting operation in Washington"
  },
  {
    "text": "Globe Entertainment partners with cllct, offers Led Zeppelin collectibleNew partnership will preserve memorable moments in music, entertainmentDecember 04, 2025\n\nNew partnership will preserve memorable moments in music, entertainment\n\nGlobe Entertainment partners with cllct, offers Led Zeppelin collectible\nNew partnership will preserve memorable moments in music, entertainment\nThe first release commemorates Led Zeppelin's \"Show That Never Happened\" in 1980. (Credit: Globe Entertainment)\nBy\ncllct staff\n—\nDecember 04, 2025\nShare\nGlobe Entertainment and Media Corp, a subsidiary of Hard Rock International, and cllct, the leading collectibles and memorabilia agency, have joined forces to preserve the most powerful stories in music and entertainment, bringing fans closer than ever to the legends who shaped culture.\nThis new partnership launches with the foundation of Globe Entertainment’s historic acquisition of the Globe and Photofile archives, one of the most significant collections of music and entertainment photography ever assembled.\nTogether, Globe Entertainment and cllct will curate and create premium, limited-edition collectibles that allow fans to own a piece of history and celebrate the stories that continue to inspire generations.\nA Legendary Beginning: The Show That Never Happened\nThe first release, Led Zeppelin: The Show That Never Happened, honors one of rock’s most iconic untold stories.\nIn 1980, the world was ready for Led Zeppelin’s long-awaited return to the stage. Tickets were printed, anticipation soared, and fans were ready — until tragedy struck with the passing of drummer John Bonham, ending the tour before it began. Those untouched tickets became lasting symbols of rock’s greatest “what if?”\nNow, for the first time ever, Globe Entertainment, Hard Rock, and cllct have transformed that moment into a museum-quality commemorative collectible: an original concert ticket, framed with historic photography and the tour’s iconic poster art, authentically sourced from the Globe archive.\nEach limited-edition piece tells the story of the concert that never was — a timeless heirloom connecting collectors, fans, and music lovers to the heartbeat of an era.\nA New Era of Collectible Storytelling\nThe Led Zeppelin release is just the beginning. The partnership between Globe Entertainment and cllct will continue to unveil a series of remarkable, authenticated memorabilia releases, from music and film to sports and pop culture, all crafted with museum-level authenticity and artistic detail.\nEach piece will celebrate the stories behind the world’s most unforgettable moments, bridging the gap between history and ownership for fans who want to hold onto something truly real.\nCollectors and fans can be the first to own Led Zeppelin: The Show That Never Happened,\nnow on sale online\n.\nFollow @officialhardrock and @cllctmedia for launch updates, limited-edition reveals, and the next wave of cultural icons coming soon from this groundbreaking partnership.",
    "title": "Globe Entertainment partners with cllct, offers Led Zeppelin collectibleNew partnership will preserve memorable moments in music, entertainmentDecember 04, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "cllct staff",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/globe-entertainment-partners-with-cllct-offers-led-zeppelin-collectible",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:34.358355",
    "summary": "New partnership will preserve memorable moments in music, entertainment"
  },
  {
    "text": "Rare ticket to 1919 Kentucky Derby could set horse racing recordRace was first leg of first Triple Crown, won by Sir BartonDecember 03, 2025\n\nRace was first leg of first Triple Crown, won by Sir Barton\n\nRare ticket to 1919 Kentucky Derby could set horse racing record\nRace was first leg of first Triple Crown, won by Sir Barton\nA then-record crowd of 50,000 fans attended the 1919 Kentucky Derby. (Credit: eBay)\nBy\nDarren Rovell\n—\nDecember 03, 2025\nShare\nA ticket to the first leg of the first Triple Crown will sell Wednesday on eBay, with a chance to beat the all-time record for a horse racing ticket.\nThe ticket to the 1919 Kentucky Derby, which saw Sir Barton win in front of a then-record crowd of 50,000 fans, had reached a high bid of $30,058 as of Wednesday at 10:30 a.m ET, less than 10 hours ahead of the auction close.\nThat price is higher than Sir Barton’s ownership received for the win that day ($20,800), albeit not factoring for inflation.\n\"It's exceedingly rare and arguably the most significant Kentucky Derby ticket a collector could own,\" PSA's chief ticket authenticator Matt Fuller said. \"The PSA pop on this is only two, and I was lucky enough to see both of them come in.\"\nSir Barton was a co-favorite to win the race, but he had not posted a single win in his six career starts. He did a big advantage, however — the horse weighed 4 1/2 pounds less than any other horse in the field.\nThe record price paid for a horse racing ticket was $45,600 for a full 1937 Kentucky Derby ticket, the first of three wins by War Admiral.\nThe record paid for a Sir Barton piece of memorabilia is for the Derby trophy presented to the horse’s owner, J.K.L. Ross, which sold for $71,700 in 2015 at Heritage.\nSir Barton swept the Triple Crown races in a span of 32 days, leading wire-to-wire in the Kentucky Derby and the Preakness.\nThe three races — the Kentucky Derby, Preakness and Belmont Stakes — were formalized as a group of races in 1875, but the name Triple Crown wasn’t attached to the races until 1930 when Gallant Fox won it all, and Sir Barton wasn’t officially recognized as the first winner until 1950.\nIn 1920, Sir Barton famously took on Man O'War in the \"Horse of the Year\" race at Kenilworth Park in Windsor, Ontario. In Man O'War's final start, the horse beat the Triple Crown winner, making his career record 21-1.",
    "title": "Rare ticket to 1919 Kentucky Derby could set horse racing recordRace was first leg of first Triple Crown, won by Sir BartonDecember 03, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/ticket-stubs/rare-ticket-to-1919-kentucky-derby-could-set-horse-racing-record",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:35.187012",
    "summary": "Race was first leg of first Triple Crown, won by Sir Barton"
  },
  {
    "text": "Ticket to Michael Jordan's 'home' preseason debut sells for $7,647Jordan's third NBA exhibition game was played at high school in East Chicago, IndianaDecember 07, 2025\n\nJordan's third NBA exhibition game was played at high school in East Chicago, Indiana\n\nTicket to Michael Jordan's 'home' preseason debut sells for $7,647\nJordan's third NBA exhibition game was played at high school in East Chicago, Indiana\nThe game was billed as Michael Jordan's Bulls against Junior Bridgeman's Bucks — but Bridgeman was traded before the game. (Photo courtesy of David Blixt)\nBy\nWill Stern\n—\nDecember 07, 2025\nShare\nFor David Blixt’s 13th birthday in 1984, his parents got him tickets to see Michael Jordan.\nAs the former North Carolina star prepared for his NBA debut, the hype around the Bulls' top draft pick was palpable. The man who would later become known as “His Airness” was coming to play a preseason game just down the block from Blixt’s family’s home at Washington High School in East Chicago, Indiana.\n“You’re having true Chicago fans for the first time being able to really see him in proximity to Chicago,” Blixt explained of that preseason game.\nJordan wasn’t the only big name attracting fans to the game. Initially, marketing of the exhibition match surrounded Junior Bridgeman, who was from East Chicago and would be making a homecoming. However, the Bucks traded Bridgeman to the Clippers just two weeks prior to the game.\nBridgeman, who died earlier this year, would go on to become an incredibly successful entrepreneur following his NBA career, accumulating a net worth in excess of $1 billion.\n“Two future billionaires,” Blixt noted of the irony of the two men’s paths nearly crossing that day in Indiana.\nThe ticket features the names “Jr. Bridgeman” and “Michael Jordan” in parentheses under their respective teams.\nBlixt, who had never been to a Bulls game, recalled the preseason game as one of the most special memories from his childhood, attending with his sister, father and mother, who was an alumnus of the high school.\n“All I remember is Michael Jordan being on everybody’s lips,” Blixt said. “In my 13-year-old mind, he didn’t even look like he was from this Earth. He was so fast and so quick. Maybe because of the intimate setting of the high school gym, you could feel every dribble just pounding through your chest.”\nAfter the game, Blixt went home and placed the ticket and the program inside one of his binders of baseball cards. He didn’t think about the ticket again for 40 years.\nEarlier this year, Blixt’s mother, now 82, was looking through some of her silver coins and wanted to take them to a shop to see if they were worth anything.\n“I figured, if we’re gonna go, let me grab my Nolan Ryan rookie that I know I have somewhere and see what they have to say about that, too,” Blixt said. “If I didn’t look for that card, that ticket and program would still be in a box under the dresser with a bunch of dust on it.”\nBlixt put the ticket up for auction at Lelands,...",
    "title": "Ticket to Michael Jordan's 'home' preseason debut sells for $7,647Jordan's third NBA exhibition game was played at high school in East Chicago, IndianaDecember 07, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/ticket-stubs/ticket-to-michael-jordan-home-preseason-debut-found-in-box-under-dresser",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:36.048947",
    "summary": "Jordan's third NBA exhibition game was played at high school in East Chicago, Indiana"
  },
  {
    "text": "Washington Capitals to offer paper tickets for 2025-26 seasonCaps season-ticket holders will be able to get collectible tickets for all home gamesSeptember 10, 2025\n\nCaps season-ticket holders will be able to get collectible tickets for all home games\n\nWashington Capitals to offer paper tickets for 2025-26 season\nCaps season-ticket holders will be able to get collectible tickets for all home games\nFor the 2025-26 campaign, Washington Capitals season-ticket holders will have the option to get physical tickets to all home games. (Credit: Monumental Sports)\nBy\nDarren Rovell\n—\nSeptember 10, 2025\nShare\nThe Washington Capitals will offer paper tickets to their season-ticket holders for the entire 2025-26 campaign, the team announced Wednesday.\nYes, that’s right, paper.\nCaps fans won’t have to go up to the box office and say their phone died or make up some excuse to get a physical ticket. Instead, season-ticket holders will have a collectible representation of every game this season  — tickets with unique imagery on them, instead of just an ugly font on ticket stock.\nPhysical tickets are much like airplane food. No one talked much about them when they were there, but once they were gone, it became a travesty.\nOver the last 15 years, as tickets throughout sports and entertainment have gone from physical to digital, ticket collecting started to emerge as a new vertical in the hobby.\nAfter tickets were the second fastest growing sector of PSA grading in 2024, the world’s largest grader created a separate office for intake to handle demand.\nFor collectors, not having a ticket to an event when something special happened — a no-hitter, a star's debut or a band's final concert — seemed like a “miss.”\nTickets hold more than just collectible value. There’s also sentimental value.\nI remember years ago, when a father took to Twitter to ask the world if anyone had a physical ticket to the Mets game the day before — not because some historic feat occurred on the field, but because It was his first game with his son.\nMonumental Sports and Entertainment, the Capitals' parent company, has a close relationship with cllct. Monumental is one of the clients in our consultancy, the first of its kind in the collectible space.\nWe have worked together to create special pieces, such as the limited-edition collectibles celebrating Alex Ovechkin's 895th goal with game-used net and ice products that will hit Capital One Arena shortly. Our partnership has also resulted in meaningful conversations about pushing the envelope.\nWhen we met with the group about tickets, Jim Van Stone, Momumental’s president and chief commercial officer, had a bold suggestion: “Why don’t we just do paper tickets again for a year?”\nThere was silence in the room.\nSoon, the questions started coming. Aside from the tickets actually working — they will contain an NFC chip that works just like a barcode — the team asked, “What has to happen in order for them to be collectible?”\nSo, we got on the horn with PSA...",
    "title": "Washington Capitals to offer paper tickets for 2025-26 seasonCaps season-ticket holders will be able to get collectible tickets for all home gamesSeptember 10, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/ticket-stubs/washington-capitals-to-offer-paper-tickets-for-2025-26-season",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:36.824527",
    "summary": "Caps season-ticket holders will be able to get collectible tickets for all home games"
  },
  {
    "text": "Too good to be true? Evaluating a press pass from an all-time NHL momentPress pass said to be from Bobby Orr's 'Flying Goal' sells on eBay — but is it the real deal?July 31, 2025\n\nPress pass said to be from Bobby Orr's 'Flying Goal' sells on eBay — but is it the real deal?\n\nToo good to be true? Evaluating a press pass from an all-time NHL moment\nPress pass said to be from Bobby Orr's 'Flying Goal' sells on eBay — but is it the real deal?\nBobby Orr's \"Flying Goal\" to win the 1970 Stanley Cup final is commemorated with a statue outside the TD Garden. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nJuly 31, 2025\nShare\nOne of the main reasons I love collecting tickets is because there is great arbitrage value — especially when the buyer knows something the seller does not.\nBeing aware something historic happened at a certain game and then getting that ticket graded could yield a turnaround of thousands of dollars.\nThat said, there are also sellers who know collectors are seeking this advantage and play the game in reverse.\nA press credential\nsold on eBay for $76.\non Wednesday night. It was listed as \"Bobby Orr 'Flying Goal' Ticket Press Pass 1970.\"\nEvery detail on the press pass needed to be closely examined. (Credit: eBay)\nNow, Orr's flying goal is one of the greatest moments in hockey history and represents an iconic collectible that I'd love to own. So, I went deep in my evaluation to decide if I should bid on this lot.\nLet's take it step by step with the questions I asked as I investigated:\n1. Does the item appear authentic?\nThe credential certainly looks like it could be an old pass, though the gold color seems to be a little aggressive for the 1970s. I would expect it to be a mustard yellow.\nThe writing looks authentically faded. It has the markings of what would make sense with the game being \"SC4\" (Game 4 of the Stanley Cup final) and it being versus the \"STL Blues.\"\n2. Can you make the leap the item is from the game listed?\nAll the details on the press pass are hand-written, which leaves it more open to fraud than an item with all the elements printed on it. In fact, PSA won't grade a generic pass with no printing based solely on write-in details like we see here.\nThe description makes it sound as if the pass was found. Here is how the seller describes how he came upon this: 'We are a junk removal business in South Boston. Any items you see we found in a house cleanout. We do not claim that all used items work, and that all items are authentic. Please use your best judgment. Some items come w/ a story. Others do not. We offer no guarantees and no refunds. If you simply don't agree, please don't bid.\"\nThe seller then goes on to say, \"This appears to be the real deal, folks! An original press pass from May 10, 1970 ... this came out of a home in Boston, Massachusetts, last month. I assume it's real, but I'm not a sports guy.\"\nThese are worse disclaimers, and I often don't bid when people say, \"There's no guarantee it's real and if it's not,\" or \"the...",
    "title": "Too good to be true? Evaluating a press pass from an all-time NHL momentPress pass said to be from Bobby Orr's 'Flying Goal' sells on eBay — but is it the real deal?July 31, 2025",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/ticket-stubs/too-good-to-be-true-evaluating-a-press-pass-from-an-all-time-nhl-moment",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:37.910572",
    "summary": "Press pass said to be from Bobby Orr's 'Flying Goal' sells on eBay — but is it the real deal?"
  },
  {
    "text": "Kurt Warner on his journey from Hy-Vee to the Hall of Fame\n\nPro Football Hall-of-Fame quarterback Kurt Warner sits down with cllct's Darren Rovell from The National Sports Collectors Convention in Rosemont, Illinois.\n\n00:00:NaN\nKurt Warner on his journey from Hy-Vee to the Hall of Fame\nAugust 15, 2025\nShare\nPro Football Hall-of-Fame quarterback Kurt Warner sits down with cllct's Darren Rovell from The National Sports Collectors Convention in Rosemont, Illinois.\nThey chat about the modern collectibles industry and how fans interact with athletes.\nPlus, Warner shares how being cut from the Packers and having to play overseas led him to the MVP he became.",
    "title": "Kurt Warner on his journey from Hy-Vee to the Hall of Fame",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/kurt-warner-on-his-journey-from-hy-vee-to-the-hall-of-fame",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:38.641572",
    "summary": "Pro Football Hall-of-Fame quarterback Kurt Warner sits down with cllct's Darren Rovell from The National Sports Collectors Convention in Rosemont, Illinois."
  },
  {
    "text": "David Hunt showcases the best items from the Super Bowl LIX Auction\n\nThe auction features the first Super Bowl ring from an active player in the Patriots 28-3 Super Bowl comeback.\n\n00:00:NaN\nDavid Hunt showcases the best items from the Super Bowl LIX Auction\nFebruary 08, 2025\nShare\nFranco Harris, Jim Brown and Brian Urlacher are just a few of the names whose items are featured in the Super Bowl LIX Auction, hosted by Hunt Auctions.\nPresident David Hunt chats with cllct about the best items featured.",
    "title": "David Hunt showcases the best items from the Super Bowl LIX Auction",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/david-hunt-showcases-the-best-items-from-the-super-bowl-lix-auction",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:39.419810",
    "summary": "The auction features the first Super Bowl ring from an active player in the Patriots 28-3 Super Bowl comeback."
  },
  {
    "text": "MemorabiliaTiger Woods' top 10 collectibles: From cards to clubs ... to carts?In celebration of Masters week, the cllct 10 looks at Tiger's top memorabilia itemsIn celebration of Masters week, the cllct 10 looks at Tiger's top memorabilia items1\n\nIn celebration of Masters week, the cllct 10 looks at Tiger's top memorabilia items\n\nTiger Woods' top 10 collectibles: From cards to clubs ... to carts?\nIn celebration of Masters week, the cllct 10 looks at Tiger's top memorabilia items\nTiger Woods' \"Sunday Red\" Nike golf shirt became his trademark during his run of dominance.\nBy\nWill Stern\n—\nApril 10, 2024\nShare\nTiger Woods is scheduled to tee off Thursday for his 26th Masters appearance.\nWoods has won five Masters tournaments, most recently taking the Green Jacket in 2019 when he earned his first 15th major.\nDespite struggling with injuries and playing just a single full round on the PGA Tour in 2024, Woods remains one of the sport's biggest draws, in addition to a dominant force in the memorabilia market.\nWe took a look back at Woods’ most valuable memorabilia sales in the Tiger Woods cllct10.\nWoods' 2001 SP Authentic “Authentic Stars” Gold Card ranks as his most valuable card. (Credit: Goldin Auctions)\n1. Card record\nThe most valuable Tiger card ever sold is his 2001 SP Authentic “Authentic Stars” Gold Card, serial numbered to 100 and featuring an on-card autograph.\nOne of the 16 PSA 10 examples\nwent for $336,000 at Goldin Auctions\nin March 2021. The card was produced by Upper Deck, which has had an exclusive license with Woods for more than two decades.\n2. Ticket record\nGolden Age Auctions\nsold a signed ticket from Woods’ 1992 PGA debut\nat the Nissan Open for $104,694 in April 2022.\nIt’s one of just three examples signed by Woods and authenticated by PSA. In addition to featuring Fred Couples’ signature, Golden Age declared in its auction listing that it was signed contemporaneously by then-16 years old Tiger Woods.\n3. Clubs\nWoods’ irons, used to win four majors in his run known as the \"Tiger Slam\" in 2000-2001,\nsold for a record-shattering $5.16 million\nin April 2022. Not only is this the high watermark for any piece of Woods memorabilia, but it holds the record for any golf-related sale in history.\nThe clubs had sold at auction previously in 2010, when they were purchased for $57,242.\nWoods' irons from his \"Tiger Slam\" run sold for more than $5 million in 2022, a record price for golf memorabilia. (Credit: Golden Age)\n4. Golf shirt\nNext to the Green Jacket itself, no other piece of clothing in golf history can match the powerful symbolism of Woods’ \"Sunday Red\" Nike golf shirt.\nGolden Age obtained what is believed to be the only privately held example of a Woods' Masters-worn \"Sunday Red\" polo, directly from Upper Deck.\nWoods wore the shirt in the 2010 Masters, his return to the sport after his infamous 2009 Thanksgiving scandal.\nIt sold for $139,348 in December 2022.\n5. Hole-in-one ball\nIn Woods’ first professional tournament at the Greater Milwa...",
    "title": "MemorabiliaTiger Woods' top 10 collectibles: From cards to clubs ... to carts?In celebration of Masters week, the cllct 10 looks at Tiger's top memorabilia itemsIn celebration of Masters week, the cllct 10 looks at Tiger's top memorabilia items1",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/tiger-woods-top-10-collectibles-from-cards-to-clubs-to-carts",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:40.251629",
    "summary": "In celebration of Masters week, the cllct 10 looks at Tiger's top memorabilia items"
  },
  {
    "text": "News'Rudy' moment special enough to win over a Notre Dame haterDarren Rovell doesn't root for Notre Dame, but he can't get enough of Rudy Ruettiger collectiblesDarren Rovell doesn't root for Notre Dame, but he can't get enough of Rudy Ruettiger collectibles2\n\nDarren Rovell doesn't root for Notre Dame, but he can't get enough of Rudy Ruettiger collectibles\n\n'Rudy' moment special enough to win over a Notre Dame hater\nDarren Rovell doesn't root for Notre Dame, but he can't get enough of Rudy Ruettiger collectibles\nEven at a tradition-rich program such as Notre Dame, the events of Nov. 6, 1975, rank among the most memorable. (Credit: Darren Rovell)\nBy\nDarren Rovell\n—\nJanuary 20, 2025\nShare\nI’m not breaking any news here: Notre Dame is a polarizing team.\nYou know from a young age whether you root for or against the Fighting Irish.\nFor me, Notre Dame is part of the evil triumvirate that includes the Dallas Cowboys and New York Yankees.\nAnd yet, I have a whole shelf in my office with Notre Dame items. There’s a piece of one of the old wooden benches that were installed in Notre Dame Stadium in 1930 and removed in 2016.\nA stadium parking pass is among the \"Rudy\" items owned by Darren Rovell. (Credit: Darren Rovell)\nThere are three tickets, a signed game program, a stadium parking pass, a press pass and three pictures.\nWhy?\nBecause the “Rudy” game, to me, is one of the coolest moments in sports history.\nA 27-year-old, 5-foot-6 walk-on from the practice squad who was a live-in security guard at the Athletic and Convocation Center, got to go in for two plays at the end of a 24-3 blowout on Nov. 7, 1975. Somehow, Rudy Ruettiger was in on both tackles, including a sack of Georgia Tech quarterback Rudy Allen.\nIt’s the most against-all-odds story, even more so than little Milan winning the 1954 Indiana State High School title — a story told in “Hoosiers,” directed by David Anspaugh, who also directed “Rudy.”\nAnd it’s a collectible moment that wipes out any ill feelings I have toward Notre Dame.\nNeed proof?\nOutside of Tom Brady’s first start at Notre Dame in 1998, which has been graded by PSA a total of 97 times, and the 1988 game against Miami, referred to as the “Catholics vs Convicts” game (45), the “Rudy” game is the most-graded ticket with 40.\nThe availability and low cost of Dan “Rudy” Ruettiger at autograph events has made it more appealing, and he does a nice job. I have a program from the game detailing “The Sack\" in an extensive inscription.\nHe inscribed my ticket “The Real Rudy Ruettiger” and signed a movie prop press pass and a movie premiere ticket.\nThe amazing thing about the whole story is it hangs on just two newspaper accounts, both written the next day in the South Bend Tribune and the Chicago Tribune.\nBill Moor, South Bend Tribune: “Some of his teammates don’t even know his name is Dan Ruettiger. It has always just been “Ruetty.’”\nBill Jauss, Chicago Tribune: “Two touchdowns didn’t draw the largest roar from the crowd. The full house of 59,075...",
    "title": "News'Rudy' moment special enough to win over a Notre Dame haterDarren Rovell doesn't root for Notre Dame, but he can't get enough of Rudy Ruettiger collectiblesDarren Rovell doesn't root for Notre Dame, but he can't get enough of Rudy Ruettiger collectibles2",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/rudy-moment-special-enough-to-win-over-a-notre-dame-hater",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:41.078318",
    "summary": "Darren Rovell doesn't root for Notre Dame, but he can't get enough of Rudy Ruettiger collectibles"
  },
  {
    "text": "AuctionBought for $130, ticket lot with Ken Griffey Jr. debut sells for $40,100Full ticket for Griffey Jr's 1989 debut sat in a box for 35 yearsFull ticket for Griffey Jr's 1989 debut sat in a box for 35 years3\n\nFull ticket for Griffey Jr's 1989 debut sat in a box for 35 years\n\nBought for $130, ticket lot with Ken Griffey Jr. debut sells for $40,100\nFull ticket for Griffey Jr's 1989 debut sat in a box for 35 years\nPSA has never graded a full ticket to Ken Griffey's debut on Opening Day 1989. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nOctober 14, 2024\nShare\nIt turned out to be one of the most fortuitous ticket finds in collectible history.\nA 50-year fan of the Oakland A's, who missed many games in 1989 as a partial season ticket holder, sold a lot of 13 full tickets from that season for a whopping $40,100 on eBay. The lot featured 113 bids.\nHis combined cost for the 13 field level tickets, 35 years ago?\n$130!\nThe reason? One of the tickets, from Opening Day of that season, is the first full ticket from Ken Griffey Jr.'s debut that has ever been seen.\n“I’m amazed at this unexpected bonus in life and at a very timely moment,” the A's fan told cllct about his new windfall. “I have been trying to complete a decade’s long personal photography project, and it looks like funding might have arrived.”\nThe man, who requested to remain anonymous, originally posted the 13 tickets without any description, but after getting offers of up to $7,000 for the lot on eBay, told cllct it was time to do some research.\nBefore posting the tickets, the man said he has cross-checked the dates with highlights from the A's 1989 season — but he hadn't looked closely at the visiting teams.\nHe had moved from Oakland to New Mexico in retirement and had gone back through his boxes where he had stored his tickets to \"clean house\" after relocating.\n\"I didn't think of money when I was saving them,\" said the man. \"I kept them as souvenirs.\"\nTo date, PSA has graded 21 tickets to Junior's debut, but a full ticket had never surfaced before. The face value on the man's ticket was $10.\nIn the winter of 2022, the highest graded Griffey Jr. debut ticket at the time, graded a PSA 6, sold at Leland's for $43,550.40, which was the previous record. Since then, a signed ticket, graded PSA 7, also has surfaced.\nBut nothing like the full ticket this A's fan somehow saved for more than 35 years.\n\"Time to find new homes for many stored treasures,\" the man said. \"I lucked out on this one!\"\nDarren Rovell is the founder of cllct.com and one of the country's leading reporters on the collectible market. He previously worked for ESPN, CNBC and The Action Network.",
    "title": "AuctionBought for $130, ticket lot with Ken Griffey Jr. debut sells for $40,100Full ticket for Griffey Jr's 1989 debut sat in a box for 35 yearsFull ticket for Griffey Jr's 1989 debut sat in a box for 35 years3",
    "source": "Cllct",
    "category": "Ticket Stubs",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/auctions/bought-for-130-ticket-lot-with-ken-griffey-jr-debut-sells-for-40-100",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:41.974860",
    "summary": "Full ticket for Griffey Jr's 1989 debut sat in a box for 35 years"
  },
  {
    "text": "January 20, 2026Steph Curry jersey from '22 Finals sells for record $2.45 millionWarriors star wore jersey during title-clinching victory over the CelticsRead the story-->\n\nWarriors star wore jersey during title-clinching victory over the Celtics\n\nSteph Curry jersey from '22 Finals sells for record $2.45 million\nWarriors star wore jersey during title-clinching victory over the Celtics\nSteph Curry's Game 6 jersey from the 2022 NBA Finals now ranks as his most expensive piece of memorabilia. (Credit: Getty Images)\nBy\nWill Stern\n—\nJanuary 20, 2026\nShare\nA new record price has been paid for a Stephen Curry jersey.\nCurry’s jersey from Game 6 of the 2022 NBA Finals, the only one he wore in the Warriors' title-clinching victory in Boston, sold for $2.45 million in a private sale that was announced over the weekend. Curry scored 34 points in the game and won his only NBA Finals MVP.\nThe jersey was previously sold in 2022 by Barry Meisel of Meigray for $1.7 million. Meisel confirmed to cllct the initial sale was conducted through the Meigray Golden State Warriors game-worn program.\nThe new price paid is the highest ever for a Curry gamer, besting the previous record of $1.758 million paid last year for the second game of the star’s career in which he scored the first 3-pointer of his career.\nThe most expensive Curry card ever sold fetched $1.08 million, making this jersey the most valuable Curry-related piece of memorabilia to sell publicly.\nThe buyer was represented by Curio Advisor and wishes to remain anonymous.\n\"With this Curry jersey, there’s already a precedent established for his high-end market, so we can use previous comparable sales times his market multiple to find valuations that are comfortable for both parties,\" Curio Advisor's Bradley Calleja said. \"There’s more buy-side demand in sports memorabilia right now than I’ve ever seen, especially with items of the highest quality.\n\"We’ve also never had more engagement from institutions, investment funds and even countries that are looking to expand their portfolios to include not just blue-chip art, but game-worn memorabilia. Pieces like this are timeless, and sit at the confluence of authenticity, scarcity and virality.\"\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "January 20, 2026Steph Curry jersey from '22 Finals sells for record $2.45 millionWarriors star wore jersey during title-clinching victory over the CelticsRead the story-->",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/steph-curry-jersey-from-22-finals-sells-for-record-2-45-million",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:42.790015",
    "summary": "Warriors star wore jersey during title-clinching victory over the Celtics"
  },
  {
    "text": "Seahawks, Pats to wear 'USA 250' patches in Super Bowl LXPatriots choose their white road jerseys for the game, putting Seattle in home blueJanuary 29, 2026\n\nPatriots choose their white road jerseys for the game, putting Seattle in home blue\n\nSeahawks, Pats to wear 'USA 250' patches in Super Bowl LX\nPatriots choose their white road jerseys for the game, putting Seattle in home blue\nThe Patriots and Seahawks will wear a patch celebrate America's birthday — just like the Steelers and Cowboys did 50 years ago. (Credit: Instagram/Getty)\nBy\nKevin Jackson\n—\nJanuary 29, 2026\nShare\nThe Seattle Seahawks and New England Patriots will be sporting more than just Super Bowl LX patches on their jerseys when they take the field Feb. 8.\nContinuing the league's celebration of America's semiquincentennial, the teams will sport a \"USA 250\" patch on their uniforms for the big game in Santa Clara, California.\nThe Patriots and Seahawks will each wear a patch commemorating America's 250th celebration at Super Bowl LX.\nThe league began adding 250 logos to footballs this month.\nPhotos via\n@devinmccourty\npic.twitter.com/ki6VGeMBIh\n— cllct (@cllctMedia)\nJanuary 29, 2026\nThe first look at the patch was revealed Thursday in a social-media post by former Patriot and current NBC analyst Devin McCourty, who posted a photo of New England rookie running back TreVeyon Henderson in his full Super Bowl uniform.\nThe NFL announced in late November that it would celebrate the country's 250th anniversary throughout 2026, including the addition of the \"USA 250\" logo to game footballs in Week 18 and displaying the mark on-field in NFL stadiums across the country.\n\"The NFL is proud to participate in celebrating America's 250th anniversary,\" NFL Commissioner Roger Goodell said in a statement. \"The story of the NFL reflects the story of America, and the American spirit of resilience, innovation and teamwork has helped football grow into a cultural pastime that unites us all. We are excited to honor our country's history and celebrate our collective future.\"\nIt's not the first time the league has commemorated an American milestone. In 1976, both the Steelers and Cowboys wore patches celebrating the country's bicentennial in Super Bowl X.\nFor uniform junkies curious about what the Pats and Seahawks will be wearing, McCourty's post confirmed New England will be in its road look with white jerseys and white pants. The Patriots had their choice of jersey and chose their visiting ensemble.\nThe\nSeahawks announced they will wear\ntheir blue home jerseys with blue pants. Seattle has worn a 50th anniversary patch all season long, and all three patches were pictured on the jersey\nin an early look shared Thursday by the NFL\n.\nTeams wearing white jerseys are 37-21 all-time in the Super Bowl and have won 16 of the last 20 matchups.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nKevin Jackson is the chief content officer for cllct. He spent 25 years at E...",
    "title": "Seahawks, Pats to wear 'USA 250' patches in Super Bowl LXPatriots choose their white road jerseys for the game, putting Seattle in home blueJanuary 29, 2026",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/seahawks-pats-to-wear-usa-250-patches-in-super-bowl-lx",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:43.578544",
    "summary": "Patriots choose their white road jerseys for the game, putting Seattle in home blue"
  },
  {
    "text": "Patrick Ewing jersey from first NBA Draft Lottery heads to auctionKnicks exec Dave DeBusschere held up the jersey after New York won lottery in 1985January 12, 2026\n\nKnicks exec Dave DeBusschere held up the jersey after New York won lottery in 1985\n\nPatrick Ewing jersey from first NBA Draft Lottery heads to auction\nKnicks exec Dave DeBusschere held up the jersey after New York won lottery in 1985\nAfter four stellar seasons at Georgetown, Patrick Ewing was the consensus top NBA prospect in 1985. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nJanuary 12, 2026\nShare\nThe so-called \"frozen envelope\" has never emerged from the first NBA Draft Lottery in 1985, but the jersey now has.\nBrahm Wachter, Sotheby's head of modern collectibles, told cllct the auction house has been consigned the Patrick Ewing Knicks jersey that was\nonsite for the NBA lottery\nand the draft in 1985. The white home jersey, which was held up by Knicks executive Dave DeBusschere after New York won the lottery, has been photo-matched to both events.\nThe lottery took place May 12, 1985, at the Waldorf Astoria in New York City. Envelopes with logos of the seven teams that didn't make the playoffs were put into a drum and pulled out by NBA commissioner David Stern. When Stern pulled the logo of the team in the NBA's largest market, a conspiracy theory developed around the Knicks envelope being frozen or a corner being bent.\nStern and the NBA denied all conspiracy theories, pointing to the fact the process was overseen by an independent accounting firm. The NBA later went to ping-pong ball combinations instead of logos on envelopes in order to create even more transparency.\nRELATED STORY:\nSpike Lee details his most beloved Knicks collectibles\nDeBuscchere had the jersey ready for Ewing immediately, but there is actually some explanation to that.\nOne of the most prominent athletic equipment stores in the country at the time was Gerry Cosby & Co., which had its headquarters at Madison Square Garden. Even in 1985, fans could get jerseys customized onsite, so preparing a Ewing Knicks jersey was easy.\nPresentation jerseys have sold before, most notably the one Michael Jordan held up when he signed his first contract after being drafted by the Chicago Bulls in 1984. That jersey was bought by Rally for $320,000 at Julien's in 2020. Investors sold it for more than $500,000 in 2023.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nDarren Rovell is the founder of\ncllct\nand one of the country's leading reporters on the collectibles market. He previously worked for ESPN, CNBC and The Action Network.",
    "title": "Patrick Ewing jersey from first NBA Draft Lottery heads to auctionKnicks exec Dave DeBusschere held up the jersey after New York won lottery in 1985January 12, 2026",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/patrick-ewing-jersey-from-first-nba-draft-lottery-heads-to-auction",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:44.479200",
    "summary": "Knicks exec Dave DeBusschere held up the jersey after New York won lottery in 1985"
  },
  {
    "text": "John Riggins' Super Bowl MVP jersey sells for $470,000Riggins wore the jersey in 1983 when he made one of the most important runs in NFL historyFebruary 08, 2026\n\nRiggins wore the jersey in 1983 when he made one of the most important runs in NFL history\n\nJohn Riggins' Super Bowl MVP jersey sells for $470,000\nRiggins wore the jersey in 1983 when he made one of the most important runs in NFL history\nJohn Riggins' 43-yard TD run on fourth down help give Washington its first Super Bowl title in franchise history. (Credit: Getty Images)\nBy\nMatt Liberman\n—\nFebruary 08, 2026\nShare\nFourth-and-1. A little more than 10 minutes remaining. The Super Bowl hanging in the balance.\nTrailing Miami 17-13 late in Super Bowl XVII at the Rose Bowl, Washington faced that pressure-packed situation in 1983 as the franchise sought its first Super Bowl title.\nLuckily, the \"Diesel\" was there to carry the day.\nJohn Riggins broke a tackle at the line and not only got the first down, he rambled for a 43-yard touchdown that put the then-Redskins ahead to stay in a game they would win 27-17.\nThe jersey Riggins wore that day in an 166-yard performance that won him the game's MVP award sold at the Super Bowl LX Live Auction Event for $470,000, besting its high-end estimate by $270,000. The event marked the 18th year in a partnership between the NFL and Hunt Auctions.\nRiggins, who was elected to the Hall of Fame in 1992, played five seasons for the New York Jets before playing his most impactful football in Washington. Additionally, his Super Bowl ring sold for $105,750\n\"For me, without the fans, there was no football,\" Riggins said in a statement. \"You gave me something far greater than anything memorabilia can represent. Knowing my teammates and I helped create moments you’ll always remember is the only legacy I need. Now, it feels right to pass these keepsakes along to the people who made them matter in the first place.\"\nA portion of the proceeds from the auction will go directly toward charities of the NFL Auction Program.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nMatt Liberman is a reporter and video producer for\ncllct\n, the premier company for collectible culture.",
    "title": "John Riggins' Super Bowl MVP jersey sells for $470,000Riggins wore the jersey in 1983 when he made one of the most important runs in NFL historyFebruary 08, 2026",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/auctions/john-riggins-super-bowl-mvp-jersey-ring-headline-hunt-s-annual-auction",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:45.527409",
    "summary": "Riggins wore the jersey in 1983 when he made one of the most important runs in NFL history"
  },
  {
    "text": "Josh Allen's game-day hats raise $139k for Buffalo children's hospitalAllen has worn hats designed by young patients at a Buffalo hospital to each Bills' home game this seasonJanuary 11, 2026\n\nAllen has worn hats designed by young patients at a Buffalo hospital to each Bills' home game this season\n\nJosh Allen's game-day hats raise $139k for Buffalo children's hospital\nAllen has worn hats designed by young patients at a Buffalo hospital to each Bills' home game this season\nThe hat Josh Allen wore to the Bills' final home game sold for $30,100 in the charity auction. (Credit: Getty Images)\nBy\nMatt Liberman\n—\nJanuary 11, 2026\nShare\nIn all likelihood, Josh Allen won't repeat as NFL MVP this season. But there's zero doubt he's the MVP to the kids at Golisano Children’s Hospital in Buffalo, New York.\nAll this season, the Buffalo Bills quarterback has worn custom New Era hats to each home game that were designed by a different patient at Golisano, which was formerly called Oishei Children's Hospital before a Jan. 1 name change.\nThis is so incredible from\n@JoshAllenQB\nand\n@NewEraCap\n❤️????\n\"My job's not that hard. I play football. What you guys have to go through and continue to fight through is much harder than I do. And I look up to you as much as you look up to me.\" ➡️\nhttps://t.co/IQ523J9zDt\npic.twitter.com/uAUNnYieTF\n— cllct (@cllctMedia)\nJanuary 11, 2026\nAfter each game, Allen signed the respective hat before it was sent to auction. All proceeds from each sale then go to the Patricia Allen Fund (named after Allen's grandmother) to benefit critical care teams at Golisano.\nAfter nine home games and subsequent auctions this season, $139,095 was raised for the critical care units serving Western New York's children and families.\nThe week-by-week breakdown is as follows:\nWeek 18: Morgan’s cap - $30,100\nWeek 17: Nico’s cap - $16,050\nWeek 14: Ruby’s cap - $20,000\nWeek 11: Max & Ben’s cap - $14,100\nWeek 9: Carson’s cap - $13,550\nWeek 5: Bryn’s cap - $9,050\nWeek 4: Charlie’s cap - $3,600\nWeek 3: MaKenzie’s cap - $15,495\nWeek 1: Jaxson’s cap - $17,150\nIn November 2020, Allen scored a touchdown and pointed to the sky for his grandmother in a Bills win over the Seattle Seahawks. To support Allen, fans across the world began donating increments of $17 (his jersey number) to the hospital, a cause which has been close to Allen's heart since he was drafted to Buffalo in 2018.\nMore than 30,000 donors from all 50 states and 10 countries contributed, leading to the hospital to create the Patricia Allen Fund. Within the first month of its existence, the fund raised over $1 million. A wing of the hospital is now named in her honor.\nFootball fans might recall a video of Allen watching patients from the hospital congratulate him after winning MVP.\n\"My job's not that hard,\" Allen said after watching the video. \"I play football. What you guys have to go through and continue to fight through is much harder than I do. And I look up to you as much as you look up to me.\"\nIn ad...",
    "title": "Josh Allen's game-day hats raise $139k for Buffalo children's hospitalAllen has worn hats designed by young patients at a Buffalo hospital to each Bills' home game this seasonJanuary 11, 2026",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/josh-allen-game-day-hats-raise-139k-for-cancer-treatment",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:46.434709",
    "summary": "Allen has worn hats designed by young patients at a Buffalo hospital to each Bills' home game this season"
  },
  {
    "text": "Larry Bird jersey from last NBA Finals run sells for record $524,600Larry Legend wore the home Celtics jersey in all four games of 1987 East finals, including SI coverDecember 21, 2025\n\nLarry Legend wore the home Celtics jersey in all four games of 1987 East finals, including SI cover\n\nLarry Bird jersey from last NBA Finals run sells for record $524,600\nLarry Legend wore the home Celtics jersey in all four games of 1987 East finals, including SI cover\nLarry Bird was wearing the jersey when he appeared on his iconic cover of Sports Illustrated in June 1987. (Credit: Heritage Auctions)\nBy\nKevin Jackson\n—\nDecember 21, 2025\nShare\n\"And now there's a steal by Bird ... underneath to DJ, he lays it in!\"\nJohnny Most's famous call from Game 5 of the 1987 Eastern Conference finals ranks in Boston Celtics lore and symbolizes one of the last gasps of the Larry Bird-led dynasty of the 1980s.\nJust when it appeared Isiah Thomas and the Detroit Pistons were about to dethrone the Celtics, Bird stole Thomas' inbounds pass and helped Boston steal Game 5. The Celts would go on to win the series in seven games as Bird had 37 points, nine rebounds and nine assists in the clincher to give Boston its fifth trip to the NBA Finals in the 1980s.\nThe jersey Bird wore in all four home games of that classic East finals\nsold for a record $524,600\non Saturday, setting a new mark for the most ever paid for a Bird jersey.\nThe white jersey is photo-matched to seven playoff games during Boston's 1987 run and also appears on the June 8, 1987, cover of Sports Illustrated with the headline \"Celtic Pride.\" The jersey was worn by Bird in the first half of Game 5, but not when he made the historic steal in the game's final seconds.\nThe Celtics went on lose the 1987 NBA Finals in six games to the Lakers, and Detroit would fully take the baton the following season by winning the first of its back-to-back championships.\nClassic Bird jerseys don't come up for auction often and have become a coveted chase for NBA collectors from the 1980s. Bird was famous for reusing his jerseys, limiting the amount available to the game-used market.\nA Bird game-worn road jersey\nfrom his final regular-season meeting with arch-rival Magic Johnson in the 1990-91 season sold for $268,400 at Goldin on Saturday.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nKevin Jackson is the chief content officer for cllct. He spent 25 years at ESPN Digital Media, where he was the founding editor of Page 2, and nearly four years as the Executive Director for Digital Content at FOX Sports.",
    "title": "Larry Bird jersey from last NBA Finals run sells for record $524,600Larry Legend wore the home Celtics jersey in all four games of 1987 East finals, including SI coverDecember 21, 2025",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Kevin Jackson",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/larry-bird-jersey-from-last-nba-finals-run-up-for-auction",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:47.485885",
    "summary": "Larry Legend wore the home Celtics jersey in all four games of 1987 East finals, including SI cover"
  },
  {
    "text": "Sotheby's holding back some NBA jerseys to maximize auction valueAuction house announced this week it will delay sale of OKC Thunder jerseysDecember 12, 2025\n\nAuction house announced this week it will delay sale of OKC Thunder jerseys\n\nSotheby's holding back some NBA jerseys to maximize auction value\nAuction house announced this week it will delay sale of OKC Thunder jerseys\nWith Shai Gilgeous-Alexander and the Thunder off to a 24-1 start, Sotheby's will hold back OKC jerseys in anticipation of a potential record-breaking season. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nDecember 12, 2025\nShare\nSotheby's has altered its strategy for selling game-used NBA jerseys in an attempt to better capitalize on specific players and teams.\n\"In the past, we would get in the product and would quickly turn it around and sell it,\" Brahm Wachter, the auction house's head of modern collectibles, told cllct. \"Now, we are saying that it pays for us to wait for major moments or in-season catalysts before doing so.\"\nWachter announced on social media this week that Sotheby's was holding back Oklahoma City Thunder jerseys, as the defending NBA champions make a run at the best regular-season record of all time, owned by the 2015-16 Golden State Warriors (73-9). The Thunder are currently 24-1.\nWachter also said Sotheby's has held back the sale of some rookies' NBA debut jerseys.\n\"The season is long, and a lot of things can happen that can make that young player's jersey more valuable.\" Wachter said, adding that other jerseys from those rookies are available.\nTop pick Cooper Flagg's summer debut jersey sold for $95,520 in August.\nIn 2023, the NBA and Sotheby's announced a multi-year partnership for game-used memorabilia, which allowed product to go directly from the locker room to the high-end auction house for the first time.\nThis season, Sotheby's has broken out its NBA auctions into two groups: a weekly auction and a more premium auction that focuses on the best of the best. That premiere auction will include the jerseys worn in the upcoming Christmas Day games.\n\"We think this could be better for us, but I think it's also better for investors of the market,\" Wachter said. \"For example, those who bought Thunder jerseys last year will have better comps as a result of our strategy to protect prices.\"\nWachter said the company will not hold back LeBron James jerseys unless the Lakers star formally announces his 23rd season will be his last.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nDarren Rovell is the founder of\ncllct\nand one of the country's leading reporters on the collectibles market. He previously worked for ESPN, CNBC and The Action Network.",
    "title": "Sotheby's holding back some NBA jerseys to maximize auction valueAuction house announced this week it will delay sale of OKC Thunder jerseysDecember 12, 2025",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/sothebys-holding-back-some-nba-jerseys-to-maximize-auction-value",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:48.409483",
    "summary": "Auction house announced this week it will delay sale of OKC Thunder jerseys"
  },
  {
    "text": "Resolution Photomatching launches new podcastFirst episode of The Game Used Podcast dropped this weekDecember 18, 2025\n\nFirst episode of The Game Used Podcast dropped this week\n\nResolution Photomatching launches new podcast\nFirst episode of The Game Used Podcast dropped this week\nThe podcast is hosted by Resolution founder John Robinson and director of business operations and strategy Will Hamilton. (Credit: Resolution Photomatching)\nBy\nWill Stern\n—\nDecember 18, 2025\nShare\nFollowing the announcement of\na new pricing tier and membership program\nearlier this week, Resolution Photomatching is announcing a new podcast, The Game Used Podcast, and the addition of Sports Card Investor founder Geoff Wilson to the company’s advisory board.\nThe first episode of the podcast, hosted by Resolution founder John Robinson and Resolution’s director of business operations and strategy Will Hamilton,\nis now on YouTube\nand features an interview with longtime hobby veteran Mike Heffner.\nWilson joins founding advisors Marshall Fogel and Heffner on the newly formed board, which the company will lean on for advice and strategy on key decisions. Wilson, like the rest of the advisors, will serve in a fully voluntary capacity.\nWant more stories like this?\nSubscribe to the cllct newsletter\nand follow\ncllct on X\nand\nInstagram\n.\nWill Stern is a reporter and editor for\ncllct\n, the premier company for collectible culture.",
    "title": "Resolution Photomatching launches new podcastFirst episode of The Game Used Podcast dropped this weekDecember 18, 2025",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/resolution-photomatching-launches-new-podcast",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:49.528168",
    "summary": "First episode of The Game Used Podcast dropped this week"
  },
  {
    "text": "Fred Savage on watch collecting, \"The Wonder Years\" and being invited to the Smithsonian\n\nActor Fred Savage joins cllct from The National Sports Collectors Convention in Rosemont, Illinois to discuss his new company, Timepiece Grading Specialties, the world's first-ever watch grading service. \n\n\n00:00:NaN\nFred Savage on watch collecting, \"The Wonder Years\" and being invited to the Smithsonian\nAugust 13, 2025\nShare\nActor Fred Savage joins cllct from The National Sports Collectors Convention in Rosemont, Illinois to discuss his new company, Timepiece Grading Specialties, the world's first-ever watch grading service.\nPlus, he and cllct's Darren Rovell look back on \"The Wonder Years\".",
    "title": "Fred Savage on watch collecting, \"The Wonder Years\" and being invited to the Smithsonian",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "cllct",
    "url": "https://www.cllct.com/sports-collectibles/cllcttv/fred-savage-on-watch-collecting-the-wonder-years-and-being-invited-to-the-smithsonian",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:50.939209",
    "summary": "Actor Fred Savage joins cllct from The National Sports Collectors Convention in Rosemont, Illinois to discuss his new company, Timepiece Grading Specialties, the world's first-ever watch grading service. \n"
  },
  {
    "text": "NewsDolphins LB's holiday generosity creates 'teammates for life'Miami's Anthony Walker Jr. gifted high school jerseys to every player on team's rosterMiami's Anthony Walker Jr. gifted high school jerseys to every player on team's roster1\n\nMiami's Anthony Walker Jr. gifted high school jerseys to every player on team's roster\n\nDolphins LB's holiday generosity creates 'teammates for life'\nMiami's Anthony Walker Jr. gifted high school jerseys to every player on team's roster\nDolphins tight end Jonnu Smith, left, reacts after receiving a customized version of his high school jersey from teammate Anthony Walker Jr. (Credit: Miami Dolphins)\nBy\nMatt Liberman\n—\nDecember 24, 2024\nShare\nAnthony Walker Jr.’s request was certainly not a small one.\nThe Miami Dolphins linebacker wanted to give personalized high school jerseys to the entire team.\nWhen Walker went to Anthony Castro, the founder and CEO of\nAll Stars Miami\n, a company which customizes high school jerseys, Castro just requested Walker give him the 53-man active roster.\nBut Walker didn’t want jerseys for just the active roster. He wanted them for everyone on the practice squad, and he wanted them for coaches.\n“You sure?” Walker remembered Castro asking.\n“Absolutely.\"\nWalker Jr. wanted to go above and beyond with gifts for his Dolphins teammates. (Credit: Getty Images)\nOn Dec. 14, when Walker presented replica jerseys to each of his teammates for Christmas, the reaction in the locker room was exactly what he and Castro had hoped for — but the national reception was even more overwhelming.\nThe video, which the Dolphins posted to their social media channels, has been shared around the country and shown to millions, with unanimous praise.\n“He really deserves the love that he's getting,” Castro said. “He really went above and beyond.”\nBut this was never supposed to be a holiday gift.\nWalker, a 29-year-old Miami native, signed with the Dolphins this past offseason. His home, though, is in Dallas. With little time to go back to Texas and bring his entire wardrobe to Miami before the season began, Walker decided he would wear high school jerseys of Miami legends to all home games.\n“The guys that have helped me,” Walker said, “that have really shown me the way.”\nWalker contacted Castro to purchase the jerseys. The two met in September, and immediately an idea sparked.\nSince starting All Stars Miami two years ago, Castro had always wanted to build out the entire Dolphins roster as a special project. He even pitched the idea to the Dolphins’ team barbers in January.\nHe just needed a player willing to execute the idea.\n’Tis the season for NFL players giving each other expensive gifts.\nDolphins LB\n@__AWalkJr\nwanted to do something special — and his thoughtful gesture for the ENTIRE ROSTER forged “teammates for life.\"\npic.twitter.com/e6UQrlzOgD\n— cllct (@cllctMedia)\nDecember 24, 2024\n“I know the impact,” Castro said. “I know it. ... Whoever does it, whoever's down for it, man, they're gonna have teammates for lif...",
    "title": "NewsDolphins LB's holiday generosity creates 'teammates for life'Miami's Anthony Walker Jr. gifted high school jerseys to every player on team's rosterMiami's Anthony Walker Jr. gifted high school jerseys to every player on team's roster1",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/dolphins-linebacker-anthony-walker-jr-holiday-generosity-creates-teammates-for-life",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:52.103004",
    "summary": "Miami's Anthony Walker Jr. gifted high school jerseys to every player on team's roster"
  },
  {
    "text": "AnniversariesCollectors still searching for Bobby Orr's jersey from 'Flying Goal' gameOrr's goal won the 1970 Stanley Cup final for Boston, but his historic sweater has yet to surfaceOrr's goal won the 1970 Stanley Cup final for Boston, but his historic jersey has yet to surface2\n\nOrr's goal won the 1970 Stanley Cup final for Boston, but his historic jersey has yet to surface\n\nCollectors still searching for Bobby Orr's jersey from 'Flying Goal' game\nOrr's goal won the 1970 Stanley Cup final for Boston, but his historic sweater has yet to surface\nBobby Orr's \"Flying Goal\" from the 1970 Stanley Cup final is commemorated with a statue outside TD Garden in Boston. (Credit: Getty Images)\nBy\nDarren Rovell\n—\nMay 10, 2024\nShare\nJerseys from the good ol' days are hard to find for a couple reasons.\nThere's the supply issue, as players used to often wear the same uniforms for an entire season. And there also was an awareness issue, as game-worn items were not recognized as anything more than clothing decades ago.\nSo, many of the greatest jerseys of all time were either passed off to a random person, or handed down to a minor-leaguer after logos and names were scrubbed off.\nMickey Mantle's 1957 uniform, currently up for auction at Goldin, was saved by a minor-leaguer in Triple-A. The interlocking \"NY\" was scrubbed off in favor of the minor-league affiliate's \"Triplets\" nickname, but Mantle's name sewn into the jersey at the bottom tipped off the minor-leaguer that it was worth saving.\nWhich brings us to one of the jerseys the memorabilia world is still looking for: Bobby Orr's jersey from the 1970 Stanley Cup final. This incredible piece of hockey history is still missing as we hit the 54-year anniversary of his famous \"Flying Goal\" on Friday.\nSeveral Orr jerseys have sold at auction through the years, but not the one from his most famous moment. (Credit: Getty Images)\nAccording to one memorabilia dealer in Massachusetts, a man once claimed to have Orr's jersey in his dusty basement. The urban legend, the dealer tells cllct, was that the man’s wife was dating Orr at the time and gave her his jersey as the “Flying Goal” yielded Orr's first Stanley Cup.\nThe overtime goal in Game 4 of Boston's sweep against the St. Louis Blues capped an amazing season in which Orr won the Hart, Norris, Art Ross and Conn Smythe trophies.\nThe dealer said that, despite several approaches, the man has not produced the jersey.\nDan Imler, vice president of sports, private sales and consignments for Heritage isn't ready to write off the search for the Orr \"Flying Goal\" uniform.\n\"There's a lot of stories about teammates or team personnel being gifted jerseys, and I would find it hard to believe that someone wouldn't keep that over time,\" Imler said. \"I'm not ruling out that it would turn up one day.\"\nHeritage has sold five game-used Orr jerseys. The most expensive sale was for a jersey from Orr's rookie season of 1966-67, which sold for $191,200 in April 2010. A 1970-71 jersey sold for...",
    "title": "AnniversariesCollectors still searching for Bobby Orr's jersey from 'Flying Goal' gameOrr's goal won the 1970 Stanley Cup final for Boston, but his historic sweater has yet to surfaceOrr's goal won the 1970 Stanley Cup final for Boston, but his historic jersey has yet to surface2",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/collectors-still-searching-for-bobby-orr-s-jersey-from-flying-goal-game",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:53.113025",
    "summary": "Orr's goal won the 1970 Stanley Cup final for Boston, but his historic jersey has yet to surface"
  },
  {
    "text": "Game-wornImage is everything: Game-worn memorabilia captures moment for many collectorsWith photo-matching easing their concerns, buyers are spending top dollar on high-end, game-used memorabiliaWith photo-matching easing their concerns, buyers are spending top dollar on high-end, game-used memorabilia3\n\nWith photo-matching easing their concerns, buyers are spending top dollar on high-end, game-used memorabilia\n\nImage is everything: Game-worn memorabilia captures moment for many collectors\nWith photo-matching easing their concerns, buyers are spending top dollar on high-end, game-used memorabilia\nBy\nWill Stern\n—\nApril 17, 2024\nShare\nOver the past few years, the market for high-end, game-worn memorabilia has boomed.\nA Michael Jordan jersey from the 1998 NBA Finals sold for more than $10 million.\nA set of six Lionel Messi jerseys from the 2022 World Cup went for $7.8 million.\nA 1958 Mickey Mantle jersey garnered $4.68 million.\nJust to name a few.\nOf the current top 10 most expensive sales of game-worn jerseys, nine have come since 2019.\nThe number of game-worn sales topping $1 million has nearly doubled from seven in 2021 to 13 in 2023, according to Russell Lieberman, founder of Altan Insights.\nBehind these seven- and eight-figure sales is a group of super-fans, forever chasing the high of a connection with their favorite athletes.\nThis tight-knit group of collectors barely number in the dozens — at least, in terms of the most dedicated and obsessive hobbyists.\nA group with a wide range of collecting interests, all united by nostalgia and the sheer joy of owning a piece of history — only fueled by the now-ubiquitous NBA highlights machine that is social media, which many believe can elevate a game-worn jersey or sneaker by virtue of association.\nDespite this romanticism, the game-worn community is not exactly welcoming of newcomers.\nThe best collectors play it close to the vest. Forging relationships is key. Befriending the right ball boy can unlock an entire season’s worth of jerseys, sneakers, and sweatbands. But as that circle grows wider, collectors worry about their sources being swept up by a competitor.\nThis discretion carries through to the inner sanctum of the community, where collectors tend to keep their treasures to themselves — a near-solitary pursuit, in many cases, secrets kept even from their closest friends and families.\nNotoriety is starting to come, however, thanks in part to the community’s embrace of social media, its newly found place among legacy auction houses such as Sotheby’s, and, perhaps most importantly, the mass-adoption of an authentication process known as photo-matching.\nThe ties between a game-worn jersey and meaningful imagery have always been the primary appeal for collectors, but the ubiquity of the NBA on social media, as well as the ever-growing community of fans, has supercharged the significance of these on-court moments (and, therefore, the game-worn apparel).\n“You sort of have this virality element where y...",
    "title": "Game-wornImage is everything: Game-worn memorabilia captures moment for many collectorsWith photo-matching easing their concerns, buyers are spending top dollar on high-end, game-used memorabiliaWith photo-matching easing their concerns, buyers are spending top dollar on high-end, game-used memorabilia3",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/image-is-everything-game-worn-memorabilia-captures-moment-for-many-collectors",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:54.006397",
    "summary": "With photo-matching easing their concerns, buyers are spending top dollar on high-end, game-used memorabilia"
  },
  {
    "text": "cllct10Michael Jordan game-used jerseys: His 10 most important to sellFrom UNC to the Olympics to the Bulls and Wizards, the cllct 10 counts 'em down\n\nFrom UNC to the Olympics to the Bulls and Wizards, the cllct 10 counts 'em down\n\nMichael Jordan game-used jerseys: His 10 most important to sell\nFrom UNC to the Olympics to the Bulls and Wizards, the cllct 10 counts 'em down\nMichael Jordan game-used jerseys are among the most sought-after in the hobby. (Credit: Getty Images)\nBy\nWill Stern\n—\nMarch 12, 2025\nShare\nThe\nfirst jersey Michael Jordan ever wore\non an NBA court — albeit in a 1984 preseason game — went to auction last week at Sotheby's.\nWith that historic artifact hitting the market, cllct got to thinking about all the best Jordan jerseys to ever surface at auction.\nFrom the Tar Heels to the Olympics to the Bulls and Wizards (and Stefanel Trieste?!?), our latest cllct 10 list focuses on MJ's most important gamers.\n1. 1983 North Carolina jersey\nAmong the earliest Jordan jerseys to ever hit the market, the North Carolina jersey he wore during his sophomore season ranks near the top of the list. Jordan also wore the blue road uniform on the cover of The Sporting News when he was named Player of the Year in 1983.\nAfter a December 1983 game in the Stanford Invitational, a high school student named Chris Williamson, who was working as Stanford’s visiting team manager, told his friend and fellow team assistant, Steven Cauchi, he had traded some Stanford gear for UNC jerseys, shorts and socks.\n“He showed me the stuff on the way home from the game, and that was when I saw that he had obtained MICHAEL JORDAN'S jersey,” Cauchi wrote in a letter of provenance. “The jersey was still soaking wet with sweat. I made the comment to Chris that maybe if he rubbed a little of Michael Jordan's sweat on his shoes, he might be able to jump like Michael Jordan. When we got to my house, he gave me Sam Perkins' shorts and a pair of the Tar Heel game socks.\"\nThe jersey was originally sold at auction in 1999 for a record $63,500.\nIt sold at Heritage Auctions\nin May 2021 for $1.38 million.\n2. 1984 Olympics jersey\nAs part of the last U.S. amateur-only team to win a gold medal in the Olympics, Jordan wore the No. 9 jersey in the tournament, which he led the team in scoring with more than 17 points per game.\nGrey Flannel sold the red U.S. jersey\nfor $273,904 in 2017.\n3. First NBA contract signing\nChicago Bulls GM Rod Thorn presented Jordan with his first official Bulls jersey following his contract signing Sept. 12, 1984. Jordan held the jersey up in front of a sea of reporters and photographers during the news conference.\nIt has sold multiple times over the years, including\nfor $320,000 in 2020 at Julien’s Auctions\nand for $513,985 via Rally in 2024.\nSotheby’s will sell Jordan’s pre-season debut jersey this spring, with an estimate around $10 million.\nRELATED STORIES:\nMichael Jordan, Kobe Bryant debut jerseys go to auction with $10 million estimates\nRare Michael Jordan aut...",
    "title": "cllct10Michael Jordan game-used jerseys: His 10 most important to sellFrom UNC to the Olympics to the Bulls and Wizards, the cllct 10 counts 'em down",
    "source": "Cllct",
    "category": "Game Worn",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/michael-jordan-game-used-jerseys-his-10-most-important-to-sell",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:54.977692",
    "summary": "From UNC to the Olympics to the Bulls and Wizards, the cllct 10 counts 'em down"
  },
  {
    "text": "Cooper Flagg NBA debut jersey sells for $1 million in private saleFlagg was the No. 1 overall pick in the 2025 NBA DraftByWill Stern—February 19, 2026\n\nFlagg was the No. 1 overall pick in the 2025 NBA Draft\n\nCooper Flagg NBA debut jersey sells for $1 million in private sale\nFlagg was the No. 1 overall pick in the 2025 NBA Draft\nFlagg made his NBA debut on Oct. 22, 2025 against the Spurs (Credit: Getty)\nBy\nWill Stern\n—\nFebruary 19, 2026\nShare\nCooper Flagg's NBA debut jersey sold privately via Sotheby's earlier this month for $1 million, the auction house announced Thursday morning.\nThe price is a record for any Flagg-related collectible and comes mid-way through his rookie campaign, during which he is averaging 20.4 points, 6.5 rebounds and 4.1 assists for the Dallas Mavericks.\n\"The $1 million result for Cooper Flagg’s rookie debut jersey is a powerful testament to the significance collectors place on true ‘first moments’ in sport,\" Brahm Wachter, Sotheby’s Head of Modern Collectibles, said in a statement. \"This jersey captures the very beginning of a special career, one carrying huge expectations and excitement.”\nFlagg's Summer League debut jersey sold in August for $95,250 in a Sotheby's auction.\nSotheby's is the NBA's official game-worn partner, and generally offers jerseys from key games in public auctions, such as the 2023 sale of Victor Wembanyama's debut jersey for $762,000. However, the auction house has recently become more strategic with its inventory, holding back jerseys that have the potential to gain in value.\nCollectors will have the chance to scoop up other key rookie debut jerseys at auction this month, however, as Sotheby's will sell gamers from the first games of VJ Edgecombe, Kon Knueppel, Dylan Harper, Derik Queen and more, with bidding opening Thursday.\nWill Stern is a reporter and editor for cllct, the premier company for collectible culture.",
    "title": "Cooper Flagg NBA debut jersey sells for $1 million in private saleFlagg was the No. 1 overall pick in the 2025 NBA DraftByWill Stern—February 19, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/cooper-flagg-nba-debut-jersey-sells-for-1-million",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:56.058634",
    "summary": "Flagg was the No. 1 overall pick in the 2025 NBA Draft"
  },
  {
    "text": "Why did this ticket to a 1992 Phillies-Pirates game sell for over $1,500?The ticket even sold for twice as much as Paul Skenes' debut ticketByDarren Rovell—February 18, 2026\n\nThe ticket even sold for twice as much as Paul Skenes' debut ticket\n\nWhy did this ticket to a 1992 Phillies-Pirates game sell for over $1,500?\nThe ticket even sold for twice as much as Paul Skenes' debut ticket\nMorandini played for the Phillies from 1990-1997 and later managed the team (Credit: Getty)\nBy\nDarren Rovell\n—\nFebruary 18, 2026\nShare\nWhen Mickey Morandini pulled it off, it came so quickly, even the announcers didn’t realize what happened.\nAnd who could blame them? An unassisted triple play had only happened eight times in Major League Baseball history.\nWhy are we talking about Morandini’s magical moment? Because, on Tuesday, a ticket to the Sept. 20, 1992 game featuring Morandini’s Philadelphia Phillies against Barry Bonds’ Pittsburgh Pirates — sold for a whopping $1,540.\nTo put that in perspective of Pirates tickets, the most recent sale of Bill Mazeroski’s Game 7 World Series walk-off was $945. Paul Skenes' rookie debut ticket last sold for $708. But unlike those two, PSA had never graded an exemplar from this game.\nAt the time, Morandini, who caught a fly ball from Jeff King, doubled off a runner who left second and tagged Bonds on his way to second, was also ticked about not thinking about the memorabilia.\nVideo shows Morandini, who batted .268 in 11 years in the majors, flipping the ball up in the air as he runs by the mound.\n“That was stupid on my part,” he told reporters after the game. “It was probably hit as a foul ball to some fan.”\nDarren Rovell is the founder of cllct and one of the country's leading reporters on the collectibles market. He previously worked for ESPN, CNBC and The Action Network.",
    "title": "Why did this ticket to a 1992 Phillies-Pirates game sell for over $1,500?The ticket even sold for twice as much as Paul Skenes' debut ticketByDarren Rovell—February 18, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/ticket-stubs/why-did-this-ticket-to-a-1992-phillies-pirates-game-sell-for-over-1-500",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:56.839122",
    "summary": "The ticket even sold for twice as much as Paul Skenes' debut ticket"
  },
  {
    "text": "Upper Deck signs World No. 2 golfer Nelly Korda to exclusive dealKorda is a 2-time major champion and has racked up 21 professional winsByWill Stern—February 17, 2026\n\nKorda is a 2-time major champion and has racked up 21 professional wins\n\nUpper Deck signs World No. 2 golfer Nelly Korda to exclusive deal\nKorda is a 2-time major champion and has racked up 21 professional wins\nKorda joins an elite group of golfers who have exclusive agreements with Upper Deck (Credit: Getty)\nBy\nWill Stern\n—\nFebruary 17, 2026\nShare\nUpper Deck has signed golfer Nelly Korda to an exclusive deal, the company announced Tuesday morning.\nKorda, a two-time Major winner in the LPGA and the winner of a gold medal for Team USA at the 2020 Olympic Games, is currently ranked No. 2 in the world and has been a mainstay atop the leaderboards since turning pro at age 17.\nUpper Deck already boasts Tiger Woods as a longtime athlete partner, and this latest signing marks an extended commitment to the world of golf, building on its roster which already includes Collin Morikawa, Rose Zhang and Lydia Ko.\nIn addition to a new Upper Deck Authenticated memorabilia collection highlighting her career, Korda will also appear on a Young Guns trading card as part of 2026 Upper Deck Golf.\n“Upper Deck has a long history of working with world-class athletes like Nelly who transcend their sport and become cultural icons,” said Jason Masherah, President of Upper Deck, in a statement. “She can bring new collectors to the hobby, and in turn we’ll deliver the Upper Deck standard: premium trading cards and memorabilia that reflect Nelly as a one-of-a-kind athlete.”\nCurrently, Korda’s most valuable card is her 2020 S.I. For Kids, which has sold for as much as $1,000.\n“I’ve seen firsthand the passion and joy that collecting brings to so many people, and the way that Upper Deck honors that passion and creates memorable experiences for collectors and fans. I’m excited to collaborate with Upper Deck and engage with the community,” Korda said in a statement.\n“It isn’t just about creating collectibles; it’s about working with a company that knows how to best represent your brand and help connect with fans all over the world – which Upper Deck has done for years with the most notable athletes of all time.”\nWill Stern is a reporter and editor for cllct, the premier company for collectible culture.",
    "title": "Upper Deck signs World No. 2 golfer Nelly Korda to exclusive dealKorda is a 2-time major champion and has racked up 21 professional winsByWill Stern—February 17, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/upper-deck-signs-world-no-2-golfer-nelly-korda-to-exclusive-deal",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:57.685140",
    "summary": "Korda is a 2-time major champion and has racked up 21 professional wins"
  },
  {
    "text": "Pikachu Illustrator $16.5m sale is as much about the value of attention as the card itselfIn a world run by social media, huge events must follow suitByWill Stern—February 16, 2026\n\nIn a world run by social media, huge events must follow suit\n\nPikachu Illustrator $16.5m sale is as much about the value of attention as the card itself\nIn a world run by social media, huge events must follow suit\nThe Pikachu Illustrator set the world record as the most expensive card ever publicly sold (Credit: Darren Rovell)\nBy\nWill Stern\n—\nFebruary 16, 2026\nShare\nIn one of the most highly-publicized collectible auctions in history, Logan Paul sold his Pikachu Illustrator for $16,492,000 early Monday morning at Goldin Auctions.\nThe sale is the most expensive publicly known result for any card in history, by $3.5 million.\nAnd while the record-breaking price tag  is surely indicative of the perceived value and cultural significance of the card within the Pokémon and greater card collecting universe, it is also a prime example of the ways in which splashy auction results have emerged as a vehicle for promotion and PR value, both on the sell-side and the buy-side.\nIn the run-up to the sale, it is difficult to imagine a card, let alone a Picasso, gaining more wall-to-wall coverage in the modern social media landscape.\nFirst made famous as a diamond-encrusted accessory to Paul’s WrestleMania 38 walk-out, the negotiation and announcement of the sale at Goldin came via season 3 of the Netflix series “King of Collectibles: The Goldin Touch.”\nThen, during the weeks-long auction, Paul promoted the sale to his tens of millions of followers across various social media channels.\nMore than $14 million was bet on the final price of the card’s auction on prediction markets PolyMarket and Kalshi.\nAn interesting component of this heavy promotional push is that the card, unlike one of Paul’s CPG products, like PRIME, was likely never going to be bought by someone in his core demographic, or, frankly, anyone who simply saw a post on social media and decided to impulse bid millions.\nUnlike a new pair of sneakers or hyped-up designer jacket, the possible buyers for such an expensive item are likely in the dozens and require a white glove approach rather than a scatter-shot campaign.\nBut the massive coverage wasn’t designed to convince the eventual buyer. It served instead to raise the awareness level of the public that the card was being sold, it was considered a “grail,” and, in so many words, the eventual buyer would not only own the card, but the entire cultural movement that had been created around it.\nThen comes Sunday night.\nThe buyer was A.J. Scaramucci, founder of Solari Capital and son of former White House communications director Anthony Scaramucci.\nHe immediately used the attention of the sale to announce his new project, a site called TreasureTrove.com, which will be used to document his hunt for the world’s treasures.\nPaul, never one to be outdone or miss the chance to capita...",
    "title": "Pikachu Illustrator $16.5m sale is as much about the value of attention as the card itselfIn a world run by social media, huge events must follow suitByWill Stern—February 16, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/pikachu-illustrator-16-5m-sale-is-as-much-about-the-media-as-the-card-itself-1",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:58.510129",
    "summary": "In a world run by social media, huge events must follow suit"
  },
  {
    "text": "Selling Sunset, buying Diesel: Jason Oppenheim buys Riggins Super Bowl XVII jerseyOppenheim plans to make the jersey available for all Washington fansByMatt Liberman—February 13, 2026\n\nOppenheim plans to make the jersey available for all Washington fans\n\nSelling Sunset, buying Diesel: Jason Oppenheim buys Riggins Super Bowl XVII jersey\nOppenheim plans to make the jersey available for all Washington fans\nOppenheim believes Riggins' 43-yard touchdown is the most important play in team history (Credit: Getty)\nBy\nMatt Liberman\n—\nFebruary 13, 2026\nShare\n\"Selling Sunset\" reality star and president of The Oppenheim Group Jason Oppenheim has revealed that he is the buyer of John Riggins' Super Bowl XVII jersey.\nOppenheim bought the Super Bowl MVP jersey for $470,000, as it headlined the Super Bowl Live Auction conducted by Hunt Auctions.\n\"I would have gone higher,\" Oppenheim told ESPN, \"a decent amount higher.\"\nThe $470,000 was already $270,000 more than the high estimate. He also bought Riggins' Super Bowl ring for another $105,750.\nOppenheim, a lifelong Washington fan, told ESPN he that Riggins' iconic 43-yard touchdown run in the 27-17 victory is the most important play in team history. Super Bowl XVII marked Washington's first Super Bowl in franchise history and Riggins ran for 166 yards and a touchdown in the game.\nOppenheim also told ESPN he intends to make the jersey and ring available for all Washington fans to see.\n\"I wanted to make sure these items were not controlled by someone who would hoard them, keep them from the fan base and have it as some type of investment opportunity,\" he said. \"I don't feel I own these things; I feel they're owned by the fans. To be a custodian is an honor.\nMatt Liberman is a reporter and video producer for cllct, the premier company for collectible culture.",
    "title": "Selling Sunset, buying Diesel: Jason Oppenheim buys Riggins Super Bowl XVII jerseyOppenheim plans to make the jersey available for all Washington fansByMatt Liberman—February 13, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/selling-sunset-buying-diesel-jason-oppenheim-buys-riggns-super-bowl-xvii-jersey",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:35:59.465453",
    "summary": "Oppenheim plans to make the jersey available for all Washington fans"
  },
  {
    "text": "Iconic Joe Frazier robes heading to auction from fights vs Muhammad AliBoth robes were worn for weigh-ins ahead of legendary fights vs Muhammad AliByWill Stern—February 12, 2026\n\nBoth robes were worn for weigh-ins ahead of legendary fights vs Muhammad Ali\n\nIconic Joe Frazier robes heading to auction from fights vs Muhammad Ali\nBoth robes were worn for weigh-ins ahead of legendary fights vs Muhammad Ali\nJoe Frazier went 1-2 in his three career fights vs Muhammad Ali (Credit: Bonham's)\nBy\nWill Stern\n—\nFebruary 12, 2026\nShare\nTwo robes worn by Joe Frazier during his trilogy of bouts against Muhammad Ali are set to hit the auction block at Bonham’s, with estimates for both in the six figures.\nThe first robe\ncomes from the 1975 “Thrilla in Manila” fight and was worn by Frazier as he entered the ring.\nThe robe sold in 2008 for $40,000 and now has an estimate of $125,000-$150,000 with a starting bid of $75,000.\nThe second robe\nwas worn at the weigh-in for “The Fight of the Century” in 1971 at Madison Square Garden. Frazier would go on to win the fight in 15 rounds, marking the first professional loss of Ali’s career.\nThe robe sold for $20,000 in 2008 and now has an estimate of $100,000-$120,000 with a starting bid of $50,000.\nBidding on both lots closes on Feb. 25.",
    "title": "Iconic Joe Frazier robes heading to auction from fights vs Muhammad AliBoth robes were worn for weigh-ins ahead of legendary fights vs Muhammad AliByWill Stern—February 12, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/iconic-joe-frazier-robes-heading-to-auction-from-fights-vs-muhammad-ali",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:00.290993",
    "summary": "Both robes were worn for weigh-ins ahead of legendary fights vs Muhammad Ali"
  },
  {
    "text": "Rovell: Topps' top 75 list was good, not greatWhere did Topps go right? Where did it go wrong?ByDarren Rovell—February 12, 2026\n\nWhere did Topps go right? Where did it go wrong?\n\nRovell: Topps' top 75 list was good, not great\nWhere did Topps go right? Where did it go wrong?\nFrom error cards to the best of the best, Topps ranked their top 75 cards\nBy\nDarren Rovell\n—\nFebruary 12, 2026\nShare\nIn celebration of its 75th anniversary of making Topps baseball cards, Topps unveiled what it felt was the top 75 baseball cards in its history. After seeing the list, I brought in Simeon Lipman, an awesome collector who some of you know from \"Antique Roadshow\" to discuss.\nAnd like any list, we thought there were some good calls and some bad ones.\nThe 1952 Topps Mantle is definitely No. 1, but both of us felt the 1952 Willie Mays was high at No. 2.\nThe Paul Skenes Debut patch and the 2018 Topps Update Shohei Ohtani Rookie Debut are important cards, but we also both felt that they should be outside the Top 10.\nThe most egregious one in the top 10 to us seemed to be the 1986 Topps Traded Barry Bonds. It's just the wrong Bonds card. While it wasn't the rookie and certainly less valuable, the Bonds card that defined Topps baseball was the wood borders of the 1987 set and the skinny full-bodied Bonds was more important. The list also put Jose Canseco's 1986 Topps Traded Card. Again, it was rarer, but there's virtually no argument that it was a bigger card to collectors than the gold cup All-Rookie Team card.\nSimeon's biggest card missing was the 1979 Ozzie Smith rookie. How in the heck did they miss that? That was followed by the 1985 Dwight Gooden card. We are both New York boys but nationwide, that beats the Clemens, which made the list. Putting the 1985 Kirby Puckett card on the list was even stranger.\nSpeaking of Mets, to put Gregg Jefferies 1989 Future Star card on this list is completely disengenuous. No one cared about that card because Topps got beat by Fleer to feature Jefferies a year before.\nWhat was missing from the list in my opinion? The fun.\nThey included the 1969 Aurelio Rodriguez card, which turned out to be a picture of batboy Leonard Garcia. But that card was never really chased as an error. Cards were in a different place in 1969. The error card you must have is the 1989 Al Leiter Future Stars rookie, in which Topps mistook the \"SG\" written on Steve George's glove as the 56 of Leiter. Topps corrected it, which made the chase even more exciting.\nAnd how do they not include the 1976 Topps Traded Oscar Gamble with the afro? Isn't the greatest hair in card history worth a nod in the top 75? What makes this card so special is Topps took Gamble in his Indians uniform and did its best, in the non-photoshop era, to make Gamble a Yankee. Of course when Gamble arrived at Spring Training, Yankees owner George Steinbrenner made him cut his hair immediately and even paid for the Afro Sheen endorsement he lost.\nFinally, for me, the 1955 Roberto Clemente is a mu...",
    "title": "Rovell: Topps' top 75 list was good, not greatWhere did Topps go right? Where did it go wrong?ByDarren Rovell—February 12, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/rovell-topps-top-75-list-was-good-not-great",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:01.289104",
    "summary": "Where did Topps go right? Where did it go wrong?"
  },
  {
    "text": "Topps hiding a '52 Mantle in one 2026 Series 1 packTopps ranked the '52 Mantle as the most important baseball card in the company's historyByMatt Liberman—February 11, 2026\n\nTopps ranked the '52 Mantle as the most important baseball card in the company's history\n\nTopps hiding a '52 Mantle in one 2026 Series 1 pack\nTopps ranked the '52 Mantle as the most important baseball card in the company's history\nThe card will come delivered with a grade from PSA (Credit: Topps)\nBy\nMatt Liberman\n—\nFebruary 11, 2026\nShare\nTopps is celebrating 75 years of Topps Baseball in a big way.\nThe trading card giant launched 2026 Topps Baseball Series 1 Wednesday morning, it's first official baseball product of the season.\nAnd mixed in the millions of cards is a redemption for a '52 Topps Mickey Mantle, unequivocally the most important card in the history of all Topps sports.\nWhile Mantle was recently supplanted as having the most expensive card in history by the Michael Jordan-Kobe Bryant Dual Logoman purchased by Kevin O'Leary's team, there's zero doubt that should any of the three PSA 10 Mantles in existence come to market, they would shatter the all-time record for a card.\nNow this card certainly will not be a PSA 10. But Topps confirmed to cllct the card will be delivered with a PSA grade.\nHere are the most recent sale prices for each grade of a '52 Mantle:\nPSA 1:\n$37,820 (2026)\nPSA 2:\n$98,626 (2026)\nPSA 3:\n$72,136.16 (2025)\nPSA 4:\n$96,000 (2025)\nPSA 5:\n$231,484 (2026)\nPSA 6:\n$213,500 (2025)\nPSA 7:\n$347,700 (2025)\nPSA 8:\n$1,555,500 (2025)\nPSA 9:\n$5,200,000 (2021)\nAdditionally, there will be redemption cards for two tickets to the 2026 World Series.\nMatt Liberman is a reporter and video producer for cllct, the premier company for collectible culture.",
    "title": "Topps hiding a '52 Mantle in one 2026 Series 1 packTopps ranked the '52 Mantle as the most important baseball card in the company's historyByMatt Liberman—February 11, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/topps-hiding-a-52-mantle-in-one-2026-series-1-pack",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:02.076976",
    "summary": "Topps ranked the '52 Mantle as the most important baseball card in the company's history"
  },
  {
    "text": "Is \"Maye Mania\" here to stay?Maye has been the most popular athlete among card collectors for the last six monthsByMatt Liberman—February 11, 2026\n\nMaye has been the most popular athlete among card collectors for the last six months\n\nIs \"Maye Mania\" here to stay?\nMaye has been the most popular athlete among card collectors for the last six months\nMaye led the Patriots to the Super Bowl in his first full season as a starter (Credit: Getty)\nBy\nMatt Liberman\n—\nFebruary 11, 2026\nShare\nDrake Maye's first Super Bowl appearance certainly didn't go how many expected. He was running for his life all game, being sacked seven times and he turned the football over three times as well. Even the 29-13 final score makes the game seem much closer than it actually was.\nStill, despite the crushing loss, Maye Mania is very real in the hobby and appears to be here to stay.\nIf you look at GemRate's 50 most-graded athletes of all time, which the company released in January, the top 10 produces names you'd probably expect.\nMichael Jordan, Ken Griffey Jr., Kobe Bryant, LeBron James, Tom Brady, etc. There are really only two modern-day unicorns in the top heap, Shohei Ohtani and Victor Wembanyama.\nAnd while Maye doesn't really have a chance of affirming himself in that list among graded cards - this was only his first full season as a starter - he is on par with, if not ahead of nearly everyone else in other metrics since the football season began.\nNot even \"His Airness\" Michael Jordan had as many card sales over the previous 180 days. Maye leads all athletes with 159.9 sales, more than 10,000 more than MJ and over 50,000 more than anyone else. And if you extend the time frame to a full year, he still trails only Jordan, sitting more than 35,000 cards above third-place Jayden Daniels.\nPerhaps what is even crazier though, to show just how robust Maye's market became, is the total amount of money spent on Maye's cards. Maye sits third on the leaderboard over the last 90 days, trailing just Jordan, Ohtani and James, who all have average sale prices of at least $345.\nMaye's average sale? A cool $87.54, the lowest of anyone in the top 15 of sales volume. Over the last month, more money has been spent on Maye than Brady, Caleb Williams and Patrick Mahomes combined - No. 2, 3 and 4 in sales volume.\nWhen you put up numbers like that, it's hard to ever imagine slipping out of the top tier of hobby relevancy. But who knows? Just as quickly as he jumped to the top of the heap, Maye could descend on the charts if he fails to live up to his potential.\nMatt Liberman is a reporter and video producer for cllct, the premier company for collectible culture.",
    "title": "Is \"Maye Mania\" here to stay?Maye has been the most popular athlete among card collectors for the last six monthsByMatt Liberman—February 11, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/is-maye-mania-here-to-stay",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:02.899054",
    "summary": "Maye has been the most popular athlete among card collectors for the last six months"
  },
  {
    "text": "D.B. Cooper ransom money more mysterious than the escape itselfOn this date in 1980, $5,800 of D.B. Cooper ransom money was discoveredByDarren Rovell—February 11, 2026\n\nOn this date in 1980, $5,800 of D.B. Cooper ransom money was discovered\n\nD.B. Cooper ransom money more mysterious than the escape itself\nOn this date in 1980, $5,800 of D.B. Cooper ransom money was discovered\nOnly $5,800 of $200,000 in ransom money was discovered (Credit: Getty)\nBy\nDarren Rovell\n—\nFebruary 11, 2026\nShare\nThere are a handful of people and stories that never get out of my head. They are, in order of my fascination: The JFK Assassination, D.B. Cooper, the sinking of the Titanic and the 1962 Alcatraz Escape.\nAll of these have one thing in common: How the hell did they ever happen?\nJFK is pretty self-explanatory. It's such a deep rabbit hole, because, well, the truth is likely more complicated than we will ever know. The Titanic's makers tempted fate by calling the boat \"Unsinkable.\" But how an iceberg wasn't seen because of a combination of hubris and a missing key to a binoculars case is astounding. The 1962 escape from Alcatraz, was led by Frank Lee Morris, a prisoner with a 133 IQ. Not only did they escape from the inescapable, but substantive remnants of their escape, for the most part, were never found in the water.\nThere's one element of D.B. Cooper has than none of the others have. There was an encore.\nFrom November 1971 through January 1980, the only unsolved American hijacking wasn't all that well known nationwide. But when an 8-year-old boy named Brian Ingram came across  $5,800 in $20 bills that matched the FBI dossier from the Cooper ransom list, the legend expanded its reach.\nIt also made no sense, which added to the mystery. Ingram found the bills bundled together in a Columbia River beach called Tena Bar. Except Tena Bar wasn't close to the FBI flight path, so, either the flight path was wrong or the money would have had to flow down smaller rivers into the Columbia. But how was the money bundles still intact with the rubber bands? Could it mean that, at some point, the bundles were in the bank bag that the money originally came in? Or was it deposited at a later time to throw things off.\nEither way, the FBI didn't find more money and never found \"Cooper,\" dead or alive.\nAfter holding on to 14 of the bills, the FBI released the money in 1986 to Ingram and the Royal Globe Insurance Co., the insurance provider of Northwest, who was forced to pay the airline for the Cooper ransom after losing a lawsuit. The money was now technically also theirs now.\nRoyal Globe said it would immediately start to sell their lot as collectors items, but there's no evidence that ever happened. Ingram has parted with very little, other than selling a few through Heritage Auctions in 2008.\nIn 2023, I got the chance to buy one of Ingram's bills that had popped up from the original buyer. But I was recently put in touch with someone who had a bill from Royal Globe Insurance's all...",
    "title": "D.B. Cooper ransom money more mysterious than the escape itselfOn this date in 1980, $5,800 of D.B. Cooper ransom money was discoveredByDarren Rovell—February 11, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/d-b-cooper-ransom-money-more-mysterious-than-the-escape-itself",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:03.805317",
    "summary": "On this date in 1980, $5,800 of D.B. Cooper ransom money was discovered"
  },
  {
    "text": "Dodgers celebrate incredible World Series Game 7 comeback with bobbleheadsYoshinobu Yamamoto headlines the series of four bobbleheads whose plays changed baseball historyByMatt Liberman—February 10, 2026\n\nYoshinobu Yamamoto headlines the series of four bobbleheads whose plays changed baseball history\n\nDodgers celebrate incredible World Series Game 7 comeback with bobbleheads\nYoshinobu Yamamoto headlines the series of four bobbleheads whose plays changed baseball history\nLos Angeles won its second straight World Series in 2025 (Credit: Getty)\nBy\nMatt Liberman\n—\nFebruary 10, 2026\nShare\nThe phrase \"Game 7\" is often labeled as the best two words in sports. And last season for the Dodgers, it's hard to argue otherwise.\nLos Angeles trailed the Toronto Blue Jays 4-2 entering the eighth inning, before going on a magical run filled with home runs, great defensive plays and the pitching performance of a lifetime to win 5-4 in extra innings and win the team's second consecutive World Series.\nNow, the Dodgers are sharing relics of that historic comeback with fans. The team announced Monday this upcoming 2026 season would feature a Game 7 Bobblehead Series. There will be four different bobbleheads in the series, each depicting one of the game-changing plays in the team's Game 7 comeback.\nThe first will come on Saturday, March 28 vs the Arizona Diamondbacks, the team's third game of the season and first weekend game. It will be Will Smith bobblehead night. Smith hit the go-ahead home run in 11th inning of Game 7.\nThe second bobblehead in the series features Miguel Rojas, who became the first player in MLB history to hit a game-tying home run in the 9th inning or later of a World Series Game 7. This bobblehead will be featured on Friday, May 8 vs the Atlanta Braves.\nThe third bobblehead, and perhaps the most important of the three, is the Yoshinobu Yamamoto \"Game 7 Last Out\" Bobblehead on Wednesday, May 27 vs the Colorado Rockies. Yamamoto provided a Herculean effort in Game 7, pitching 2.2 innings of shutout baseball on zero days rest, having just dominated Game 6. It put an exclamation point on what was already one of the most dominant World Series runs by any pitcher in history.\nThe final bobblehead in the series comes on Friday, June 19 vs the Baltimore Orioles, showcasing the final out of the game. Mookie Betts, who spent a decade as a perennial Gold Glove outfielder, shifted to play shortstop for the Dodgers due to team injuries and has now made the position home.\nHe made the final play of the World Series, producing an unassisted 6-3 double play to end the game and the series.\nThe Dodgers will celebrate their remarkable Game 7 comeback with bobbleheads\nWhile these four bobbleheads certainly make up quite the showcase, the Dodgers have a staggering 24 bobblehead nights this season, despite leading the league every year in attendance since 2013.\nIndividual game tickets go on sale to the public on Thursday, February 12 at 1 PM ET.\n_Matt Liberman is a report...",
    "title": "Dodgers celebrate incredible World Series Game 7 comeback with bobbleheadsYoshinobu Yamamoto headlines the series of four bobbleheads whose plays changed baseball historyByMatt Liberman—February 10, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Matt Liberman",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/dodgers-celebrate-incredible-world-series-game-7-comeback-with-bobbleheads",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:04.817253",
    "summary": "Yoshinobu Yamamoto headlines the series of four bobbleheads whose plays changed baseball history"
  },
  {
    "text": "PSA increasing prices, turnaround time due to high demandPricing for new submissions will rise by $5 per categoryByWill Stern—February 10, 2026\n\nPricing for new submissions will rise by $5 per category\n\nPSA increasing prices, turnaround time due to high demand\nPricing for new submissions will rise by $5 per category\nPSA last raised prices in September and turnaround time in Novemeber\nBy\nWill Stern\n—\nFebruary 10, 2026\nShare\nPSA announced increased pricing and turnaround times Tuesday morning, citing increased submission volume and demand from collectors.\nPricing Updates for New Submissions\nValue Bulk: $21.99 → $24.99\nValue: $27.99 → $32.99\nValue Plus: $44.99 → $49.99\nValue Max: $59.99 → $64.99\nRegular: $74.99 → $79.99\nEstimated Turnaround Time Updates for New Submissions\nValue Plus: 40 → 45 business days\nValue Max: 30 → 35 business days\nRegular: 20 → 25 business days\nTCG and Value Bulk have been combined to a single service exclusive to PSA's Collectors Club members and all Bulk submissions will now be under a single multi-category service level (Value Bulk).\n\"Consolidating Bulk services allows us to better align demand with capacity while providing Collectors Club members with a clear, consistent Bulk option,\" PSA said in a post on their website.\nCredit: PSA\nUpdated prices and service levels will apply to any new submissions as of Feb. 10, while submissions already created will be honored at the original prices.\n\"In 2021, PSA was grading approximately 15,000 cards per day globally. Today, PSA grades approximately 90,000 cards per day globally,\" the company said.\nWill Stern is a reporter and editor for cllct, the premier company for collectible culture.",
    "title": "PSA increasing prices, turnaround time due to high demandPricing for new submissions will rise by $5 per categoryByWill Stern—February 10, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/sports-cards/psa-increasing-prices-turnaround-time-due-to-high-demand",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:05.711431",
    "summary": "Pricing for new submissions will rise by $5 per category"
  },
  {
    "text": "We have WINNERS for the best Patriots and Seahawks collections!Collectibles.com and cllct partnered to find the most passionate collectors for the two Super Bowl LX teamsByDarren Rovell—February 07, 2026\n\nCollectibles.com and cllct have partnered to find the most passionate collectors for the two Super Bowl LX teams\n\nWe have WINNERS for the best Patriots and Seahawks collections!\nCollectibles.com and cllct partnered to find the most passionate collectors for the two Super Bowl LX teams\nOld-school QB collectibles set these two winners apart (Credit: Getty, Collectibles.com)\nBy\nDarren Rovell\n—\nFebruary 07, 2026\nShare\nWhen we announced the Super Bowl contest to find the best New England Patriots and Seattle Seahawks collection on Collectibles.com, I honestly didn't know what we would find.\nThere were plenty of cards submitted, but nothing really stood out. There were collections of autographed jerseys — primarily Tom Brady and Rob Gronkowski — but they were ones that you could easily buy at any moment.\nWhat I did fall in love with is the real 1/1 of stuff. The pieces which proved these collectors were real fans through and through. Now I'm not saying that real fans have to have a 20-year history, but the fact that our two winners clearly had that made them stand out.\nNot only did these guys have these items, but they uploaded them with pride to Collectibles.com for the world to see.\nOur Seahawks winner is David Ellis.\nYou can check out his collection here\n. Sure, there's the great game-used jerseys — a 1999 Christian Fauria, a 2001 Brock Huard, a Cortez Kennedy and team-issued Steve Largent. But the one that stood out for me was a team-issued 1991 Dan McGwire. All us kids of the 1990s knew about Mark McGwire's baby brother, who wasn't exactly a baby (6-foot-8). The Seahawks drafted him 16th overall in 1991, 17 picks before a guy named Brett Favre. What makes this jersey great is McGwire, unlike his brother, was a bust and McGwire only played one game in that rookie 1991 season, completing just three passes for 27 yards! So when I saw that McGwire jersey, I said \"Real Old School Fan.\"\nAnd guess what, I would have been wrong. When I called David Ellis to inform him he won, he told me he wasn't even born in 1991 and his collection is only five years old.\n\"I used to collect retail throwback Seahawks jerseys and one day I saw a cool Eugene Robinson on eBay that looked a little bit different — it was at least team issued,\" Ellis told cllct. \"And from there I just found a whole community of Seahawks collectors.\"\nOver the past five years, Ellis has stepped it up and now has 60 team-issued or game-worn jerseys and 20 helmets. The jersey he spent the most money for was for a Mike Teel jersey. Mike Teel who didn't play a single snap in the NFL?\n\"Yes, that Mike Teel,\" Ellis said. \"It was one of those jerseys in 2009 when the Seahawks wore that awful green. It turns out that only three of those have hit the market and so when one hit the market it didn't matter ...",
    "title": "We have WINNERS for the best Patriots and Seahawks collections!Collectibles.com and cllct partnered to find the most passionate collectors for the two Super Bowl LX teamsByDarren Rovell—February 07, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/we-have-winners-for-the-best-patriots-and-seahawks-collections",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:06.726179",
    "summary": "Collectibles.com and cllct have partnered to find the most passionate collectors for the two Super Bowl LX teams"
  },
  {
    "text": "Rovell: cllct enters social-first eraWe want to meet you where you areByDarren Rovell—February 05, 2026\n\nWe want to meet you where you are\n\nRovell: cllct enters social-first era\nWe want to meet you where you are\nBy\nDarren Rovell\n—\nFebruary 05, 2026\nShare\nYou may have noticed we haven’t published much on cllct.com the last few days.\nThat’s on us -- and it’s a fair thing to notice.\nThe way people consume media has changed, and the way brands support media has changed with it.\nThe audience is on social. Distribution is on social. The partnerships that power growth right now are built around socially native storytelling -- not just long-form articles living on a website.\nSo we’re shifting cllct to a social-first model: more reporting, more storytelling, more points of view - delivered where you actually spend time (X, Instagram, TikTok), at a higher cadence and with more consistency.\nIt broadens our ability to reach new audiences, creates more conversation and community and allows us to tap into more voices to make the stories better -- for you!\nThis will compliment and even further power the work we have already been doing as an advisor on collectibles culture, working with the top brands, teams and leagues in the world to make collectibles a central part of their marketing and revenue strategies.\nThat doesn’t mean the website is going away. It’s still an important home for our work -- and it will continue to be the place where stories live longer, get archived, and go deeper. What changes is the mix and the rhythm: social becomes the daily front door, and the site becomes the library and the destination for the pieces that deserve more room.\nWe’re also tightening up execution so this doesn’t feel like a stop-start experience again -- including working with\nBuster Scher\nto ensure we’re running best practices across platforms and building a consistent publishing cadence across social and .com.\nIf you came to cllct for thoughtful, credible coverage of collectible culture: that’s staying. We’re just meeting the audience where it lives - and building the model that lets us keep doing the work.\nDarren Rovell is the founder and editor in chief of cllct and one of the country's leading reporters on the collectibles market. He previously worked for ESPN, CNBC and The Action Network.",
    "title": "Rovell: cllct enters social-first eraWe want to meet you where you areByDarren Rovell—February 05, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Darren Rovell",
    "url": "https://www.cllct.com/sports-collectibles/memorabilia/rovell-cllct-enters-social-first-era",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:07.559544",
    "summary": "We want to meet you where you are"
  },
  {
    "text": "Jersey from Wayne Gretzky's final NHL game up for auctionGretzky played 20 seasons in the NHL and is the all-time leading scorerByWill Stern—February 05, 2026\n\nOne of Wayne Gretzky's final jerseys is up for sale\n\nJersey from Wayne Gretzky's final NHL game up for auction\nGretzky played 20 seasons in the NHL and is the all-time leading scorer\nWayne Gretzky recorded one assist in his final career NHL game. (Credit: Getty)\nBy\nWill Stern\n—\nFebruary 05, 2026\nShare\nWhen the time came for “The Great One” to hang up his skates in 1999, he was well-aware of the value of his jerseys.\nThat’s why Wayne Gretzky wore four jerseys for his final game for the Rangers — one in warm-ups and one for each period.\nThe jersey Gretzky wore pre-game and for the first period is now on the auction block at Classic Auctions,\nwith bidding currently sitting just below $100,000.\nAnother jersey from the game sold for $715,120 in 2023. His final jersey from the third period of the game now sits in the Hall of Fame.\nWill Stern is a reporter and editor for cllct, the premier company for collectible culture.",
    "title": "Jersey from Wayne Gretzky's final NHL game up for auctionGretzky played 20 seasons in the NHL and is the all-time leading scorerByWill Stern—February 05, 2026",
    "source": "Cllct",
    "category": "News / Memorabilia",
    "username": "Will Stern",
    "url": "https://www.cllct.com/sports-collectibles/game-worn-jersey/jersey-from-wayne-gretzky-s-final-nhl-game-up-for-auction",
    "post_date": "2026-02-20",
    "_logged_date": "2026-02-20T09:36:08.348433",
    "summary": "One of Wayne Gretzky's final jerseys is up for sale"
  }
]