[
  {
    "text": "HALL OF FAME AUTO!  SERIES 1 JUMBOS FACE OFF!\n\nHey everybody, welcome back to the brand new video. Today we have a face off for you. I know it's a Monday and usually we do mail on Mondays, but the post office is closed today for President's Day. So, I figured let's just go ahead and do this face off challenge that we were going to do this Friday anyway, except we had the new release pristine come out. So, I just postponed this one a couple days. What we have here is we have a brand new 2026 series 1 jumbo box against a 2025 series 1 jumbo box from last year. Same series, both series 1, both high print runs. We'll see if one of the boxes is better than the other. We can definitely tell you the blaster boxes this year way worse. Now the jumbos, are they that much worse? They did make a little tweak and they did make them a bit worse. They took out a relic. There's one relic and one auto per box. Used to be one auto and two relics. So, we're down a a hit, but that's the only difference. Let's see and compare these boxes. Thank you very much for joining us. I hope you're having a very pleasant day. We'll start off with the newest one here and rip a jumbo here for Camille. Camille's going to get all of these. By the way, it's going to be 2026 series 1 starting us off. So, the way this usually works is we'll open the box, we'll go through the cards, and I'll take out the top five cards from each box, and we'll just determine which box was better. Simple as that. So, let's see what we can find here. And good luck to Camille. All right, here we go. We're going to start off with pack number one. Hoping that we can find once again some big stuff. Maybe again there's only going to be one auto and one relic. That's not that much of a difference from last year. Let's keep an eye on what the numbered cards look like. Are there is it going to be a down trend of numbered stuff or not? We'll see. Here's all the base cards. We'll just show those to you. You've probably seen them a bunch if you've been watching our breaks. We got a Jonathan India sand glitter card. The good stuff's in the middle. Unfortunately, the first pack doesn't have too too much going on. And I'm probably not going to take out any of those cards there for the top five maybe pile as I like to call it. On to pack number two. It'll be a busy week. We got a consignment coming tomorrow. We'll be live on whatnot tomorrow with a bunch of 2026 Tops series 1 singles. It looks like those are due in tomorrow to the PO box. And then uh maybe we'll do a couple breaks tomorrow, but Wednesday's our big break day and we will we should have Stadium Club for you on Wednesday along with all the other stuff. Jonathong's a good rookie right there. Sand Glitter, that's a nice one. We'll put that one aside. Shad Mayfield on the first pitch card. People like those first pitch cards and they also can be signed. Although that one's just a base, so probably not too crazy. So far, 042. Next pack up. Vlad Jr. is going to start this one off. There's Jonath once again.",
    "title": "HALL OF FAME AUTO!  SERIES 1 JUMBOS FACE OFF!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=SSaAo2Oj8yo",
    "username": "Jabs Family",
    "post_date": "2026-02-17",
    "_logged_date": "2026-02-17T13:36:51.208070",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_SSaAo2Oj8yo"
  },
  {
    "text": "I Bought a Shohei Ohtani On-Card PSA 10 Auto #/10 âš¾ï¸ #shorts\n\nShow Otani 2022 tops PSA 10 blue auto numbered to 10 on card auto of the best player in baseball by a mile without a doubt but you know in the conversation for one of the greatest to ever play backtoback World Series there. I think was he won four MVPs at this point. Big time card. Definitely a big addition. >> Comes back in. It's lifted to deep right field. TOWARDS THE CORNER. GOODBYE.",
    "title": "I Bought a Shohei Ohtani On-Card PSA 10 Auto #/10 âš¾ï¸ #shorts",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=H_R5FxBhubw",
    "username": "CardCollector2",
    "post_date": "2026-02-17",
    "_logged_date": "2026-02-17T13:37:23.268728",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_H_R5FxBhubw"
  },
  {
    "text": "I Ripped $5,000+ Of FOTL National Treasures Football! ðŸ˜± *1/1 Hit!*\n\nOh my god, this box is on fire. >> Nobody runs train nights like we run nights. >> Mr. Ch, how you doing? >> Let's go. Yes, sir. >> Try to bring that to the next generation, bring it to other people uh to hopefully inspire them. This is not possible without you. All right. What's going on, YouTube? Card Collector 2 coming at you here with a brand new video. Ladies and gentlemen, a massive box opening today. Not one, but two National Treasures first off the line football boxes. This is a uh this is a big time break here. This is high risk, high reward, major potential in here. Uh should have a Stars and Stripes RPA in each one of these boxes. looking for names like Shadur, Travis Hunter, Scataboo, Ashton Genty, our guy Coulson Loveland, uh Tyler Warren, Tyler Shook, uh a a bunch of different players. Uh have RPAs in this going to be looking for some big stuff. Again, these are uh these are high-risisk, high reward. Uh I think again I haven't checked market on these but I know uh you know these got near the bottom of first off the line sellout price which was like 2500 bucks 2,000 bucks. Uh so that's plus tax and that's just if you got them at that price. So I would imagine resell on these is a little bit higher. So we're talking over $5,000 for I mean how many cards are in a box? Eight 10. This is uh this is for all the marbles right here. So, obviously, rip at your own risk, but today for the sake of this, we're hoping we get a winner. All right, last ever National Treasures with a license. Obviously, Topps is uh taking over here before too long. It's kind of cool. Maybe we'll keep that to kind of commemorate commemorate this. This box is like bursting out of the seams, though. Absolutely. Uh a fat pack here. Could be a booklet. Could be I mean I don't extra cards. I think these came out like what was it last week? All right, let's see. Hopefully there's like a nuke in here though. Hopefully there's no Bills rookies and maybe Ashenti. Hopefully not Jack Beck right off the rip. The 13 AJ Brown. Not terrible. Gosh, there's a lot of cards in this. No peeking. You guys know the rules. I don't want to I don't want to look at the bottom. If that's where the the bonus card is. I think it might be in the middle. I think it might be right there. Gosh, I'm nervous, man. This is uh the box prices seem to uh constantly rise. These things get more and more nerve-wracking here. All right, here goes nothing. AJ Brown to 13 gold. Chase Jamar. Wow, that's a winner. We'll take that one right there. Jamar Chase to 35. I would argue best receiver in football. I don't know how you would say differently. JSN dog, but Puka, great. Jamar's been doing it forever. Rogers, three of 99. All right, so three base cards right off the rip. How many base cards we get in this? Another base card. No, this is different. It's a 49. Tua patch is disgusting. Disgusting patch. Tua is not who I uh who I want. Another jersey in 99 Texans. Nico, I mean, gotta give Panini credit. These are",
    "title": "I Ripped $5,000+ Of FOTL National Treasures Football! ðŸ˜± *1/1 Hit!*",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=VG8WaNPu3JI",
    "username": "CardCollector2",
    "post_date": "2026-02-17",
    "_logged_date": "2026-02-17T13:37:24.928901",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_VG8WaNPu3JI"
  },
  {
    "text": "SUNDAY NIGHT LIVE BREAKS!  (Whatnot simulcast)\n\nSail across Hey everybody, welcome back to another brand new Sunday night stream. I hope everybody's having a very pleasant Sunday. And it's a long weekend for some of us. I don't have to go to work tomorrow. It's President's Day, so we're off. So, really no restriction on how long I can go tonight. Usually on a Sunday night, I'll probably wrap up shop around 11:00 or so, but we can go as long as you guys want to. So, thank you very much for joining us. We got a Walmart video that is currently being uploaded. I think it is uploaded, but it's not um processed up to 4K yet. Probably another hour for that to happen. So, if you are wondering where tonight's YouTube video is, I was waiting on it, but looks like it's going to take a little bit longer, but uh no problem there. We'll get it upload here around 7:00 or so. So, thanks for joining us. We're going to start off with some museum collection tonight. I see Knucks just grabbed some spots in this round, which is almost sold out. It also comes with series 1, 2026 Topps series 1, a hobby box of that. We got that case sitting over here. We've hopefully we can continue to find some good stuff out of the brand new release. And it also comes with a Bowman Draft Mega Box along with the jersey. So, all of our pick your team rounds pretty much all come with jerseys. I think they all do. So, we have plenty of those to give away tonight. We also have free packs of cards we'll be giving away left and right. We'll start one of those up here in a second. And I just had to go grab my bow and draft megas. It's a little bit of a labyrinth to get over to the other side of this office, even though it's a kind of a small office. Got to like weave around. Chris just picked up a spot. Padres's in black and white. Thank you very much. All right. Well, here's a free pack of cards. Wh Never mind. I didn't load all the free packs of cards in. Let me do that real quick for you so you can get a freebie. It only takes 30 seconds to do that. Free pack of 2026 top series 1. Oh, let's you know what? Let's call it free pack of cards. Free pack of cards. Sometimes we have people that are just Gibby goblins and never even say thank you. And for them, I'll send them a pack of 1990 don. So go to if you're in the chat, you're buying spots, you're participating. You don't even have to buy spots. If you're just here and you're cool off to say thank you and uh participate in the chat, I'll get you a hobby pack of 2026. Go to our profile and bookmark all of our upcoming live shows. Just to remind people to do that. All right, that'll be running here in a second. It just has to populate the list. I'm going to put 50 packs in there just to get us started. And there's one for you right now. Alrighty. So, we only have one team left here in Museum Collection. It's the Nationals. Let's read off who's got what. We're ready to go for the museum collection. Getting us started tonight. I like museum collection a lot. It's pick your team round number",
    "title": "SUNDAY NIGHT LIVE BREAKS!  (Whatnot simulcast)",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=OZ7a-cIJEx4",
    "username": "Jabs Family",
    "post_date": "2026-02-16",
    "_logged_date": "2026-02-17T13:36:53.282400",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_OZ7a-cIJEx4"
  },
  {
    "text": "WALMART RETAIL REVIEW!  TINS, HANGERS AND BLASTERS OF 2026 TOPPS SERIES 1!\n\nHey everybody, welcome back to the brand new video. It's the retail review. We went to Walmart this past week. I think this was Thursday right after all the 2026 Top Series 1 came out and we picked up a bunch of the blasters, the hangers, and also the tins. So, here you see what's on the shelf. A lot of basketball and football. And then there's the main target for today. It's all of their baseball card stuff. So, we're going to rip almost $300 worth of retail in this video, and hopefully by the end of the video, you'll know what's best for you. Is it the blaster boxes, which are $25 a piece, or these tins, which are checking in at $15 a piece, or the blaster boxes, which are also now $15 a piece. So, hit that subscribe button. Let's see what we can find. All right, everybody. We've got about $300 worth of stuff. all types of retail stuff that's available at Walmart and also Target and other retail locations. The only thing we're missing here are fat packs. I didn't see any fat packs out at Walmart. So, if I come across them anytime soon, I'll go ahead and check those out and tell you if they're any good. But, we did a video yesterday, the blaster boxes. We'll start there. I only picked up three blasters and I did a lot more with the hangers and the tins. So, since we already covered the blasters, we'll go ahead and do those first. I will tell you that I thought the blasters weren't that good. I think the blasters, at least right now, I'm expecting them to maybe be your worst return on your investment. These cost $25. And they deleted a pack. They just got rid of it. It's just gone. You don't get that seventh pack anymore. Instead of seven pack, you get six. And the cards per pack are the same. So, you get 12 less cards per pack. That's a big drop. It's the equivalent of paying $29.15 for a blaster box if the cards would have stayed the same amount. So, they raised the price and there's not a lot of numbered stuff. We did $250 worth of blasters yesterday. That's 10 blasters. We pulled two numbered cards and that was it. You get a lot of base. You get those spring training foil parallels and not much else. Probably better off going for the hobby of the jumbos, but we'll see how this stacks up against the other configurations out there. I Well, let's start with these three blasters and get them done. Like I said, nothing at all in this first one. There's the spring parallel. Then you get your Titans of the game right there. By the way, somewhere underneath these blasters hidden is the sponsor of this video. It's Justin Murray. So, Justin, thank you very much for allowing us to rip open a bunch of series two or series one, sorry, in this video for you. I'm really getting ahead of myself. Series two. All right, here's our next box. I've been reading the comments. Some people said the tins did them pretty good. So, we'll see about how those tins go. An interesting thing here is the hanger boxes have stayed at 59 cards, which is what they were last year",
    "title": "WALMART RETAIL REVIEW!  TINS, HANGERS AND BLASTERS OF 2026 TOPPS SERIES 1!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=G0cS1gqoOGg",
    "username": "Jabs Family",
    "post_date": "2026-02-16",
    "_logged_date": "2026-02-17T13:36:54.628442",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_G0cS1gqoOGg"
  },
  {
    "text": "They were JUST TALKING about this card and then THEY PULLED IT ðŸ˜±\n\nHot take. >> I would like to see Seattle. >> Who is the best hire in the north? McCarthy, Mentor, or Monkin? I I mean I don't What do you have? Manga. >> Color blast. >> Oh, >> Color Blast. >> And Color Blast is still lit. >> Color Blast. >> Show me big. Show me big. >> Yes, guys. I'm so happy I was able to find one for you tonight. >> Good luck, guys. Color blast incoming. Is it duel? Is it duel? Dang. >> WE WERE JUST >> CHASE. >> LET'S GO. >> DANG. >> GOING TO CAR. >> WOW. WE were literally just talking ABOUT THIS CARD. >> THAT'S HUGE. THAT'S CLEAR. >> OH MY GOSH. >> Let's go.",
    "title": "They were JUST TALKING about this card and then THEY PULLED IT ðŸ˜±",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=l0Bn6--0Caw",
    "username": "Sports Card Investor",
    "post_date": "2026-02-16",
    "_logged_date": "2026-02-17T13:37:07.350723",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_l0Bn6--0Caw"
  },
  {
    "text": "Ripping Packs From 2003 Searching For My DAY ONE PC ðŸ’ª #shorts\n\nSage Hit Football 2003. This is one of my few chances to rip a pack and actually pull uh my day one PC. Speaking of Ken Dorsy, Kevin Curtis. So, there's one of the autos was like the first batch. Brad Banks. Hey, not Donnie Nikki, but I actually had a Brad Banks jersey card in one of the videos before and I kept it. Brad Banks was the first jersey card I ever remember pulling. Charles Rogers, Chris Sims, Terry Pierce, Larry Johnson, Suggs. That's a good auto right there in all honesty. Willis McGee. I don't know if I've ever hit a Willis McGee auto in one of these videos. Matt Wilhim, another Buckeye. Senica Wallace. Jason Whitten. The biggest name in the product for sure. Chris Sims. Chris Brown auto. Donnie Nick, you're busting this one. There he is. It's crazy, man. Of course, got a little little nick on it, but we're keeping it, so it doesn't matter. Boss Bailey, Georgia auto. Matis, Dallas Clark auto. Oh, it's a good auto. Uh, Terrence Newman. Not for me. Got a gold coming up. Hey, uh, we got close. We got close. Crant",
    "title": "Ripping Packs From 2003 Searching For My DAY ONE PC ðŸ’ª #shorts",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=DUgW7SAEhYo",
    "username": "CardCollector2",
    "post_date": "2026-02-16",
    "_logged_date": "2026-02-17T13:37:26.493512",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_DUgW7SAEhYo"
  },
  {
    "text": "BLASTERS ARE BAD THIS YEAR?! INCREASED PRICES, LITTLE YIELD. \n\nHey everybody, welcome back to another brand new release preview video. Today we're taking a look at the last boxes. We already covered the jumbo boxes and the hobby boxes and they were pretty good. Can't say that there's much of a anything to talk about negatively about them except the fact that the jumbo boxes got rid of one of your hits. Hobby box have been great. Now we're looking at blasters and I'm not so sure before I even rip any of these how I feel about these blasters. First of all, they went up in price. You don't realize it, but they went up in price. Let's talk about how. Boxes from 2025, they were $25 a piece. Boxes from 2026 are also $25 a piece. Except the big difference here is used to get 84 cards in last year's blaster boxes. Now you only get 72. So, they have taken a pack out. A complete pack is gone. Instead of seven packs per box at 12 cards each, you now get six. So, what does that mean for your price? Well, I do the math. Last year, you got 84 cards at $24.99. That's 29.75 cents a card. This year, the price is still the same for the box, but at 72 cards, you're paying 34.7 cents per card, which is the equivalent of paying the price of $29.15 per box. All you do is take that 34.7, multiply it by 84 cards, and that's what you know, that's what the price increase is is gone to. So, basically, it it's almost like buying the S last year's box for 29 bucks. So, big price increase on these blasters by $4 to $5. And are they going to be worth it? Well, I don't know. We'll go ahead and check it out right now because you've seen these out at Walmart. You've seen them at Target. You've seen them out there. And you might wonder, should I spend some money on this? Should I maybe buy like, I don't know, four blasters, or should I go buy a hobby box? Let's find out. We're going to open up 10 of these blasters in this video. We're going to start with this one right here. This is for Keith. Good luck, Keith. I've been opening a lot of series 1, especially in our whatnot breaks. Hope you can check those out. I'm going to open up tomorrow's breaks and put those on sale here this afternoon very shortly. So, Keith, good luck to you. Unfortunately, one less pack now in 2026. That's just the way things are going. You can see Stars of MLB are going to be back, although they're not in every pack anymore. So you don't have to deal with that every single pack, which is good. I don't know of anybody that liked Stars of LB, was a serious collector last year. Half the cards are going to be those Titans of the game, and the other half are going to be Stars of LB. I like that. I That's a step in the right direction. All right, let's see what we do here. I would like them eventually to maybe make six different little insert sets if that's what they're set on. Maybe just one one of them per pack per box. There's a Kuna on the 91 stars of them will be on the Simei Bayio. There's your design. Basio's a good rookie. It's had a long-term deal with the Orioles ",
    "title": "BLASTERS ARE BAD THIS YEAR?! INCREASED PRICES, LITTLE YIELD. ",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=YL6PvYqYX3Y",
    "username": "Jabs Family",
    "post_date": "2026-02-15",
    "_logged_date": "2026-02-17T13:36:56.093538",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_YL6PvYqYX3Y"
  },
  {
    "text": "We Just Spent $220,000 on Rare Cards at the Dallas Card Show! ðŸ˜³\n\nWe're here at the Dallas Card Show and Ryan, this is one of the card shows where the biggest deals go down every time it happens. >> Yeah. Yeah. This is my favorite show. >> So, my question for you is, can we be part of those big deals? You got your buying station set up? >> It's all set up. It's looking good. We need a ton of cards. >> I want you to buy some big stuff today. You ready? >> That's the goal. >> All right. Let's see what he gets. You guys fine? >> Yeah, I am. >> Good to see you again. >> Yeah, good to see you again. Let's >> see here. These are all the Kobes and Jordans and a bronze here. >> I mean, there's a chance I'd be interested in a lot of this. All right. Jeez. Wow. >> Oh my goodness. >> I mean, every card is crazy after crazy after crazy. This would be a six figure deal. I >> think there's around two two and a half million. >> Is there a certain percentage that you feel comfortable with like high-end cards like this? some of the higher ones, especially the Michaels and Kobe's probably at least 90%. That's a pretty one. >> Yeah, that's gorgeous. >> Couple cool vintage ones. >> I Yeah, I need that, too. >> Now, I will say some of these chunks are could be 6 month, they could be higher, they could be lower. I just I I I really put them on there. I don't sell a bunch. I haven't sold hardly any cars, but I put them on there just for me for me to know really, you know, >> like this one, you have 50 on it, but this is trading at like 35,000. >> Yeah. Um, I'm incredibly interested in that one. >> What What you looking for? Like more vintage? Uh, >> I I like everything. Maybe I should just take a look a little bit. >> Sure. Yeah, go ahead. It's all you. >> Jeez. A nice Kobe. Another nice Kobe. Another nice Kobe. How can you choose? This is only the fifth card. Jordan Auto. We definitely need a Jordan auto. There's another Jordan auto. He's just card after card after card after card. There's a Star Jordan. That's actually a really good price on that one. Oh, now we got the LeBron rookie auto numbered. Another LeBron. It's just crazy. Crazy card after crazy card. I mean, just based on the first row, there's a color blast. Gold Kabooms are extremely hot right now. There's a logo men. Carine Towns. He's a collector now. >> So, what's the story of like how you got all these cards? Have you been collecting for a while? >> Yeah, just for a while. I uh my son's actually wanting to open up a card shop at at some point. And so I started collecting more to kind of get him some inventory really is what I what I've been doing. Believe it or not, anything that's newer in here was actually full. We've opened hundreds of paces. Like as an example, I pulled this one. When I pulled it, a guy had sold one for 113,000. So, but now it's it's gone down. All these I pulled. >> All right, let's start with this and then maybe we'll look at their >> These are all football on this side. Uh, I'll actually take a look at those. >> Take a look. Sure. Yeah. It's a",
    "title": "We Just Spent $220,000 on Rare Cards at the Dallas Card Show! ðŸ˜³",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=rua_pUjupvA",
    "username": "Sports Card Investor",
    "post_date": "2026-02-15",
    "_logged_date": "2026-02-17T13:37:08.757598",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_rua_pUjupvA"
  },
  {
    "text": "Buying a Caleb Williams Prizm Silver PSA 10 At The Dallas Card Show ðŸˆ #shorts\n\nany Caleb. >> Um, >> I know you have a silver 10 in the showcase. Any others in here? >> I don't think there's any others in here. That might be it. The other stuff I might have somewhere in. >> What do you want on the silver 10? >> Yep. Eight stickered. >> 760. >> 750. >> Are you sure? >> Okay. Nice and",
    "title": "Buying a Caleb Williams Prizm Silver PSA 10 At The Dallas Card Show ðŸˆ #shorts",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=Cg5i7B42m_4",
    "username": "CardCollector2",
    "post_date": "2026-02-15",
    "_logged_date": "2026-02-17T13:37:27.931130",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_Cg5i7B42m_4"
  },
  {
    "text": "FIND THE AUTO FRIDAY AND FLASH SALES!\n\nsave. >> Hey everybody, welcome back to another episode of Find the Auto Friday. We've got some flash sales that we'll get set up as well. find the auto and flash sales be coming up here in a little bit. And we also have some breaks we have opened up as well. We have I'll go I'll cycle through them for the breaks. We have the closest one to going. And when we do do the pick your team breaks, this will be one that goes first it looks like is going to be Hobby Hysteria which is down to six spots left. It's pinned at the bottom of your screen. We've got black and white back again. That's got 15 left. We've got Museum Collection. That's got 15 left. The Tops Jumbo round is pretty close. That's got 10 left. Roman Draft Super, which is always a really, really nice box. Both of the last boxes that we've opened, four out of five of the autos have been first round draft pick autos for the last two Bowman Draft Supras. So, this case has been on fire and loaded that we've been pulling from. Also, we have Pristine in here. There's It's a brand new product. Just came out today. 13 spots left there. So, thank you very much for joining us, everybody. Hope you're having a very pleasant evening. Let's start things off with a free pack of cards. There you go. And let's go and do a break first. The one that's closest to going is Hobby Hysteria. So, the jumbo box will wait. That'll be when we do it. I think next up, we're going to do a uh find the auto Friday with the jumbo over there. Got a whole bunch of jumbo boxes. But we've got three of these bad boys. I like that 75 on the side. I think that's pretty cool. We've got the Hobbies. Man, the Hobbies on fire. Did you check out the video I did of two hobby boxes? One of the boxes was It gave us a $2,000 return. It was pretty wild. There's only six teams left here. If you'd like to grab any of them, I'll go ahead and run them off. Here's a team for a dollar called the Miami Marlins. We'll start off with them. Yeah, that was probably the best toy box I've ever opened up. It in any preview video is absolutely bonkers. Here's the teams that are gone and off the board. We'll read them off for you. In this picker team round number six, we have the Arizona Diamondbacks going out to Clarky Post is going to have the Atlanta Braves. 62 Nevin is going to have the Boston Red Sox. What else do we got here? Five teams left now. How about How about the Orioles? I'm starting the Orioles way down at a dollar. Also, somebody gets a Mookie Bats jersey in this round. O's for a buck. Justin A just picked up the Dbacks in the Cosmic round. Thank you very much. David Shei has the Cubbies in this one. Travis Wills got the White Socks looking for Kyle Teal and Coulson Montgomery. Nick is going to have the Cincinnati Reds. Cleveland going to Uncle. We got Rob. Rob Lawn with the Colorado Rockies. Travis just grabbed the O's. Thanks, Trav. Only four teams left. We'll get started. How about all the Astros for a dollar? Looking for Bryce Matthew",
    "title": "FIND THE AUTO FRIDAY AND FLASH SALES!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=BrdWWqOYS-g",
    "username": "Jabs Family",
    "post_date": "2026-02-14",
    "_logged_date": "2026-02-17T13:36:57.584022",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_BrdWWqOYS-g"
  },
  {
    "text": "SO BAD!  TOPPS REALLY MESSED UP THESE BOXES. NEW RELEASE - 2025 PRISTINE BASEBALL\n\nHey everybody, welcome back to the brand new release preview video. Man, a lot of new releases coming out. We only got to really enjoy 2026 Top Series 1 for two days until we're hit with another new one. Here it's 2025 Pristine Baseball. Yeah, they're behind 2025 products still coming out even after 2026 Tops has come out. Isn't that weird? I don't like it. But this is a pretty cool product. We open it every year, of course. And we're going to open two boxes in this preview video. And both of the boxes are going out to TJ. So TJ, let's see what we can find for you. And I hope there's going to be some nice stuff. Now, these boxes sold out really quick on Top's website on Wednesday when they want to I think it was No, was it Wednesday? May have been. I can't even remember. But they're $669 a piece right now if you want to grab one on Blowout Cards. So, about $650 to $700 per box. Inside each box, there's six tri packs. That's the nesting doll, the Russian nesting doll packs, if you remember, where it's a pack within a pack within a pack. It's a really weird concept, but you get these six packs. And there's going to be three autographs per box. Two oncard autos and a relic auto. So, let's see what we can find. Everything going to TJ. Every pack will have one magged up magnetic one-touch card in here. There's 300 total cards in the set. And there's our first pristine magnetic one-touch. It's a pretty good one there. Dylan Cruz rookie card numbered to 50. Not a bad start. Now, here's our next pack. And you'll see another pack inside. And you're going to get a PCA right there along with the Handy Ramirez. The Ramirez is numbered to to 15. And then our last bit here. We've got Cole Reagan's starting it off along with Chase Dander, Real Martinez, and a plated and polished Aaron Judge. Nice looking insert card right there. There's a couple Chaser inserts to look out for called Pearlescent, amped Prowers, and Monogram. Those are the rare ones. Plated and polished is not one of the rare ones, but still a pretty nice one there in the fact that it's Aaron Judge. All right, on our next one, we got Jack Saml numbered to 99 as our next hit. Again, three hits per and one of them will be in a relic auto. The relic auto is always within one of these inner packs. It might be right here. We'll see. Got to be careful getting these out. And everything's kind of stuck together here. Brent Rooker along with Ronald Akunius. That's pretty nice. TJ likes the Braves. So, he'll enjoy that. Akunia numbered to 199. Nice one right there. And then here's the last pack which is somewhere in the middle of that one. We're going to have Roberto Clemente starting off with this one. These are nice looking cards. Christian Yelich. And then we have a Perseverance Bryce Harper. 14 seasons now Harper's been in the league. Wow. 14 years. Bryce Harper, I think, is going to be a Hall of Famer. I don't see how he can't be. And uh 14 seasons, he's starting to really rack up the stats. Here we g",
    "title": "SO BAD!  TOPPS REALLY MESSED UP THESE BOXES. NEW RELEASE - 2025 PRISTINE BASEBALL",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=z0-WcFqSg3s",
    "username": "Jabs Family",
    "post_date": "2026-02-14",
    "_logged_date": "2026-02-17T13:36:59.441707",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_z0-WcFqSg3s"
  },
  {
    "text": "The Best Card You've Ever Pulled Is... ðŸ‘€ðŸ‘€\n\nHey, what's the best card you've ever pulled? >> Best card I ever pulled was during one of my breaks, the one of one Superfrator Auto Shitaroi. >> Wow. >> Oo, that's nice. >> What's the best card you've ever pulled? >> I pulled a one of one Ellie de la Cruz Super Fractor right here at Cards HQ in a break. That was a pretty solid hit. >> What's the best card you've ever pulled? >> Say Ethan Ho from Destin Rivals. Probably the best card I pulled. >> I would say the best card that I've ever pulled is a Shi Otani Dynasty patch auto number five. say that was my best pull of it. Uh, so I opened a collector booster of uh, Bloomberg for Magic the Gathering and I pulled a refractor Glanor Elves. >> It was out of the Pokemon 151 pack and it was the demigod where it had the Charmander, Charmeleon, and Charizard. So that three in one kind of. So that's probably my best pull. Let's say the Sylveon VMAC Alart from Evolving Scratch. >> U most recently a Max for Stopen Dynasty F1 patch. >> It's probably going to have to be a Wembi 2023 Select card. It was like a out of 99. My son and I pulled a white mezzanine parallel of Wemi like right during his rookie year out of a select. I think it was either a mega or a blaster box that we sold for like 800 bucks raw. So that was the best card we've hit. It was a 2017 uh Topps chrome UFC auto of Conor McGregor Rat of five. >> Probably a Show Otani black cosmic auto out of 10. And that's probably the biggest card I've ever pulled.",
    "title": "The Best Card You've Ever Pulled Is... ðŸ‘€ðŸ‘€",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=1w6ICVoCSVs",
    "username": "Sports Card Investor",
    "post_date": "2026-02-14",
    "_logged_date": "2026-02-17T13:37:10.000627",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_1w6ICVoCSVs"
  },
  {
    "text": "TOP 5 HOTTEST SPORTS CARDS!\n\nThe number one card on today's list is not a single card. It is an entire category of cards that has gone up so much over the last few weeks that it is going to blow your mind. I'm here in the Arena Club studio and I'll tell you what cards they are. Now, hello sports card investors and welcome to another top five cards. I hope you're having a wonderful weekend out there. Of course, it is the first weekend in quite a while without football, so that's a little bit sad. But hopefully, you're getting some weekend enjoyment by looking at your cards because chances are you probably own some cards that have gone up a lot because there are a lot of cards going up in the sports card market right now. We'll tell you about them next. And of course, today's top five is sponsored by WhatNot. Whatnot has awesome live auctions every day and night starting at just $1 for packs, boxes, breaks, singles, and more. It's a lot of fun. And if you scan the QR code on your screen or use the special link in our show description below, we will hook you up with $15 in free credit when you sign up for whatnot. All right, let's start the show by taking a quick look at the overall sports card market with a market pulse by market movers. And you can see what I'm talking about. The SEI 500 index of 500 of the most prominent sports cards continues to go up. In fact, since January 1st, just, you know, a month and a half ago, this thing is up almost 6%. It is picking up right where last year left off. Last year it was up over 30%. So far in a month and a half it's up over 6%. This year sports cards have never been hotter. And let's hope this momentum continues to build. But now let's talk about the cards that are going up and down the most. It is time for today's top five. We're starting today with a cold card as we do every week because it is a reminder that sometimes the hot cards featured on this program can [music] quickly turn cold in the sports card market. So, please invest carefully. And that is exactly what happened with CJ Strad, [music] the quarterback for the Houston Texans. Now, CJ Strad had a strong end to the regular season. The Texans actually looked really, really good down the stretch. Many people thought that the Texans were going to make a deep playoff run this year. Of course, [music] their defense especially looked amazing, but Straoud was playing pretty well, but that did not translate over to the postseason. In the postseason, in the playoffs, Straoud struggled with accuracy and timing. He threw multiple interceptions. He failed to generate explosive plays. And honestly, he just didn't look good at all to the point where some fans were calling for him to be benched. And the back of Davis Mills to be brought in. And you can imagine that was not good for CJ Stout's card prices. They unfortunately ended the playoffs on a very, very down note. Let's take a look here in Market Movers. I'll show you what I'm talking about. This is the last 30 days of some of CJ S",
    "title": "TOP 5 HOTTEST SPORTS CARDS!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=PnFWRgwsp0c",
    "username": "Sports Card Investor",
    "post_date": "2026-02-14",
    "_logged_date": "2026-02-17T13:37:11.837958",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_PnFWRgwsp0c"
  },
  {
    "text": "I Bought THREE 2012 Prizm Black Finite 1/1's ðŸ˜± #shorts\n\nOne of the biggest additions to the collection in a minute is inside this box right here. Let me show you what is inside. If you've watched the content for the last 6 months or so, I would say maybe longer, probably since the national, uh you know how much I believe in this set right here. Um so I went out and bought a couple of them. These don't pop up very often, so I'm uh excited to add these to the PC. So, shout out to Matt for the deal. Not one, not two, but three 2012 Prism Black Finites. Uh, to me, this is one of the top five most important or historical trading card sets ever produced. The Panini Prism era is almost effectively over with a licensing. Uh 2012 was the first year of Prism Football. Uh and there's no doubt about it that Prism changed the modern-day trading card. There's no no doubt about it. Prism Football will live forever and 2012 was the very first year of it. I believe it's a 200 card base set um in 100 rookies. I think it's a 300 total card set, but fortunately I was able to pick up three important ones for the collection. Uh Chris Long, I think he won a Super Bowl on that Patriots team. Brandon Carr, uh this is actually cool for my PC as I collect Odell Beckham. Uh Brandon Carr was the corner that OBJ had the infamous catch on, right? So Brandon Carr was actually the corner in that play. If you weren't around during the time, you don't know what Miles Austin was like during the Miles A, you know, during his uh his prime. Guy was special. didn't have an insanely long career, but uh an underrated Dallas Cowboy. Uh I would guess most would probably tell you a fan favorite. So, a pretty cool card there. This is what started it all. And as Prism comes to a uh comes to an end here very very soon, figured these will uh these will be ones to look back on in time and say this was the beginning of Prism Football. Oh.",
    "title": "I Bought THREE 2012 Prizm Black Finite 1/1's ðŸ˜± #shorts",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=AYmyzI_F30Q",
    "username": "CardCollector2",
    "post_date": "2026-02-14",
    "_logged_date": "2026-02-17T13:37:29.127842",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_AYmyzI_F30Q"
  },
  {
    "text": "UNREAL $2,000 RETURN FROM A $100 BOX!  NEW RELEASE!  2026 TOPPD SERIES 1 HOBBY BOXES!\n\nHey everybody, welcome back to another brand new release preview video. 2026 TOPS is out and it's everywhere. You saw us open up a bunch of it last night in our whatnot breaks. I think we did 10 rounds of breaks. Everything that was open last night has been shipped. The best card we hit last night, by the way, was a diecut Echiro numbered to 75 autograph. About a $500 card. And we're going to hope that we could find something similar to that out of one of these. I've got a good feeling about these boxes. I do think that we're going to hit at least one autograph. We'll see. We opened a whole bunch of hobby boxes last night. Every single round I put 2026 in there in some way, either a hobby box or a jumbo. So, I've got a good feel for these. And I'll talk a little bit about how I'm feeling about the hobby boxes in this video. So, thank you very much for watching. I hope that you guys have a great day today or have had a great day today. And we're going to bring in our sponsors. We've got Camille and we've got Mason taking these two boxes. So, let's get right to it. So, we've already kind of talked about the release in yesterday's video. We did a jumbo box. We talked about the set. 350 cards in the set. And here we're going to be just taking a look at the different configurations that you have here. So yesterday's jumbo box, that's about a It's all sold out now, by the way, on tops. It's completely sold out. So you're probably paying about $280 on some of those websites like Blowout Cards and David Adams and stuff like that. If you missed the boat on Tops, Tops had them for 209. Now, I'll tell you that these are still left for the time being. These hobby boxes, they're $100 a piece over there on Top's website. Once they're gone, you're probably going to be paying around$140. Again, that's what I saw them for yesterday. So, anyways, let's see what we can do for Camille. Nothing in the first pack here on our next one. There's Christian Moore. The good rookies, by the way. Christian Moore's got some potential. We had a rough season last year, but you're looking at Roman Anthony is the consensus number one for the Red Sox. Jack Kaggleon, there he is. We pulled his gold rookie card last night. He's a good one. Probably number two despite really struggling last year. Then there's a whole bunch of other nice names in this like Bubba Chandler and Nolan Mlan and Jonath Kyle Teal and the list goes on and on. It's a really deep class. So, this could end up being a really nice Oh, and Casey's a nice prospect right there. I guess rookie. Now, here's our first numbered card. It's Spencer Strider numbered to 250. So, one numbered card so far. I'll let you know that we, like I said, we probably did like eight eight or nine of these hobby boxes yesterday in our breaks. Maybe even more than that because one of the rounds had three of them in it. We probably did 10 to 12 of these boxes. And the average numbered card output per box was anywhere from zero to two. The hi",
    "title": "UNREAL $2,000 RETURN FROM A $100 BOX!  NEW RELEASE!  2026 TOPPD SERIES 1 HOBBY BOXES!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=TtkrPJI51Nc",
    "username": "Jabs Family",
    "post_date": "2026-02-13",
    "_logged_date": "2026-02-17T13:37:01.064707",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_TtkrPJI51Nc"
  },
  {
    "text": "I Pulled Multiple Cards Of the SAME Person In This $600+ Box ðŸ’µ #shorts\n\nNow we're on to finest. We're on the finest F1. In terms of value, I would tell you this is the best F1 product ever made. Mononttoya Pro. Hey, Senna 1099. We'll take that refractor and then a Gastly Xfractor. Let's uh continue on. Another blue. Pure Gastly to 200 Alpine for life. Gold Albon. All right, we'll take a driver gold to 50. Alonzo and Pier Gassley to 99. Another one. >> Sure, I'll take that. Hey, there he is. The world champion himself. Finest Intimidators XFactor Lando Norris. Pro Duned 99. Hey, another Pier Gastly. My goodness. Another one. 25 finest finishers. I think that's a case hit. Golly, what a freaking box for Alpine Manel. Signs. Didn't really want signs. They really wanted really wanted my guy Charleslair. James Hunt. Hey, wow. What's that? Number two to 20. I thought it was a five. Taylor Barnhard. Barnard to 20. And then uh Magnus, World's Finest. Not a bad box.",
    "title": "I Pulled Multiple Cards Of the SAME Person In This $600+ Box ðŸ’µ #shorts",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=Fc1RBajkwX8",
    "username": "CardCollector2",
    "post_date": "2026-02-13",
    "_logged_date": "2026-02-17T13:37:30.537928",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_Fc1RBajkwX8"
  },
  {
    "text": "I PULLED A 1/1 From A 20 Year Old Box Of Exquisite Football! ðŸ¤¯ *2006 Exquisite Football*\n\nThis card sat in a pack for 20 years and it is crazy. There's a 101 in this box. Nobody runs train nights like who runs nights. >> Mr. Tre, how we doing? >> Let's go. Yes, sir. amazing. >> Try to bring that to the next generation and to bring it to other people uh to hopefully inspire them. This is not possible without you. All right, what's going on YouTube? Card Collector 2 coming at you here with a brand new video. Ladies and gentlemen, today Throwback Thursday returns for the first time in a long time. And this box right here, this box right here is worth the wait. This, ladies and gentlemen, is a rare box. This is 2006. Exquisite Exquisite Football. Uh, this is incredible to still have a box sealed. I picked this up actually at the National. I don't think this deal was filmed. Uh, this gentleman, collector, dealer, uh, was actually set up not too far from where our booth was on the national show floor in Chicago in 2025. And uh we bought a couple boxes from them. Um but most importantly was an exquisite box. I think looking back on this, this is secondyear exquisite. I know Rogers has an exquisite RPA and that is 2005. Uh it's a vertical Exquisite patch auto and then this year I believe they're they're horizontal. They have actually jumbo patch autos and exquisite. Uh we've ripped a few different exquisites on this channel. I believe I know one of them I'll always remember is 2007 exquisite Adrien Peterson, Calvin Johnson, Marshon Lynch, uh dear Draw Rivas, Joe Thomas, Jamarcus Russell, Troy Smith, Ted Gin, like that that that's a great class. Um, but this is uh this is 06. So, Reggie Bush, Vince Young, Matt Liner. This is the first year I ever got into cards. Uh was 2006 football. this box. This box, six cards. Six cards per pack. You You think about some of the high-end now. You've got flawless, that's 10 or more cards. You've got National Treasures, that's usually eight to 10 cards. Uh you know, some of the the bigger products are multicard. Dynasty and in, you know, from tops has one card. Um you know, Diamond Icons has again I don't know the exact amount. I think it's more than six. Um, it's it's it's early uh in the exquisite game just for what it is. 03 04 exquisite and basketball is obviously iconic. LeBron James exquisite RPA, but 06 football. Got to rip it. Got to do it today. I'm going to I'm going to enjoy this one. All right, here it goes. Don't want to like smoke the box because I would like to keep this. All right, here goes nothing. Oh man, it's one of those things like you want to open it, want to keep it kind of forever and just be like, \"Oh, that's cool. I have a box of 06 exquisite, but you know, want to see what's inside.\" Would love there to be a really cool card of like a Hall of Famer, just something you don't see as much like a maybe a person that doesn't have as many cards these days. I don't want to smoke the box. That's the thing is I can get this open, but I don't want to like smoke it. I think I'm going to have ",
    "title": "I PULLED A 1/1 From A 20 Year Old Box Of Exquisite Football! ðŸ¤¯ *2006 Exquisite Football*",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=LHXon4jsHk4",
    "username": "CardCollector2",
    "post_date": "2026-02-13",
    "_logged_date": "2026-02-17T13:37:32.527405",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_LHXon4jsHk4"
  },
  {
    "text": "2026 TOPPS SERIES 1 BREAKS!\n\n[clears throat] Hey everybody, happy release day. Welcome back to another brand new live stream and a it's our first break of 2026 Top Series 1. Just I just got it when I got home from work. In fact, the FedEx man built a wall. I couldn't even get into my front door. He like built this wall that I that I it was so weird. Like why not just put it on the porch? Like totally blocked me off. Should have taken a picture of it. But got a whole bunch of cases of this and we are going to be ripping some series one tonight. So, thank you very much for joining us. We also have buyer appreciation program. We've always done this. I always do like a recent release as long as I have it in stock. If I run out or run low, then I'll go back and do something else. Like I think last week I got low and I started I went back and I ripped open some 2024 Allen and Gter hobby packs. Those were like $350 boxes and I was sending those off. But today, every five teams that you get, that free hobby pack, it's going to be a 2026 Top Series 1 pack. So, every five teams you get, you're going to get a sealed hobby pack inside of your package. Just so you know. So, I mean, you know, if you're at like four teams at the end of the night and you want to buy a cheap team, just so you know, you don't I'm no pressure, but just throwing that out there. So, let's go ahead and get started. I can always add more rounds if you like. I've got whole bunch of other new stuff in a bunch of museum collection left and right. So, we have just boxes upon boxes of upon boxes of museum. We can add another round of that. We have one round of that currently set up, but we can set up some more. I really enjoy museum collection. We could set up some more black and white or uh Cosmic under wraps. Hobby Hysteria is there as well. So, the one that's closest to going tonight, what we'll do is I'm just going to go and cycle through them and I'm going to give you a free pack. So, if you're here and you haven't gotten your hands on 20 26 tops yet, maybe it's, you know, maybe your hobby shop sold out of them already. I don't know. Maybe you don't live near a hobby shop. I'm going to send you a free hobby pack if you win this one. Top right hand corner of your screen. Free sealed pack of 2026 Top Series 1. It's for you if you're watching. So, here's the breaks we have per uh picker team one is pinned. There's only two spots left in it. We're going to start with that one. Ross, I think it was out there. There's a bunch of cases out there. Black and white has 17 spots left. Cosmic has 25 left. under wraps. The sign base is 25. The hobby hysteria with a bunch of hobby boxes is down to 10 left. Looks like Jedi just picked up a spot. Thank you very much. My favorite break museum collection is at eight or 16 or 18. I can't. My eyes aren't very good anymore. Sixes look like eights and eight looks like sixes to me. Top series one jumbo with bow and draft. That one has 17. And then we got a bow and draft super. Man, thos",
    "title": "2026 TOPPS SERIES 1 BREAKS!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=wvFbQzjAy4I",
    "username": "Jabs Family",
    "post_date": "2026-02-12",
    "_logged_date": "2026-02-17T13:37:02.760630",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_wvFbQzjAy4I"
  },
  {
    "text": "Dealers PANIC After Sudden PSA Price Hike!\n\nAfter an absolutely crushing month of submissions in January, PSA raised prices with no notice to dealers, which sent them and collectors scrambling for answers. What should you do next? We'll tell you now. Hello sports card investors and welcome to another episode of cards on the table. Teapot Haley, we got we got some price hikes to talk about today. We got some things happening in the crazy stats coming out of the world of grading. We also have a really wonderful collector story, a great collector story. I'm excited to tell the audience about that. We're gonna get to that in a minute, but let's start with this PSA news. You guys want to jump in there? Let's do it. >> Are you ready? >> It's the topic of the week for sure. >> Oh yeah. >> This this right off the bat, this really caught my attention. So Ryan Hogue, the president of PSA, head of graders for collectors, >> president of grading. Yeah. >> He goes on Neo Cards and Comics, he says that in the month of January, PSA took in 150,000 cards a day on average as their submission volume. They were processing and shipping back out 90,000 cards a day on average. >> That is a big delta. By the way, that 150,000 cards per day, the most ever. But we're putting a graph up on the screen just to show people like the submission volume, how high the submission volume was in January, last month, compared to all other months. You can see it just going off the charts and their ability for them to keep up with it. They can't keep up with it. It's they keep hiring more people. PSA's capacity, if you go back to 2021, was 15,000 cards per day. That's what they could handle in 2021. Now they can handle 90,000 cards per day. So they have increased their capacity by what is that? Six times >> over the course of the last five years, but the submission volume is has has increased at a way greater rate. 150,000 cards a day in January. Absolutely incredible. So the only way that PSA knows how to slow this down right now so their team can keep up and this backlog doesn't become 6 months, nine months, a year like it was during COVID is to raise prices. And that's what PSA did. And PSA did that on Tuesday of this week without notice to anybody. And the price increases were somewhat significant, especially if you are into Pokemon and TCG. they got affected the most because if you were part if you submitted cards previously under TCG bulk submissions it was $18.99 a card. Now it's up to $24.99 a card for those bulk submissions for collector's club members. Sports bulk went from $21.99 a card to $24.99 per card as well. What they've done is they've combined TCG and sports into one category called value bulk. That's now $24.99. And then a lot of their other service levels, value, value plus, value max, regular, they all went up $5 per card. So, it may not sound like a lot on an individual card basis, but I mean, if you're doing an order of 20, 30, 50, 100 cards, >> right? >> It starts to add up really quick, right? Um, they ",
    "title": "Dealers PANIC After Sudden PSA Price Hike!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=ebVqNaU3vIE",
    "username": "Sports Card Investor",
    "post_date": "2026-02-12",
    "_logged_date": "2026-02-17T13:37:13.282664",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_ebVqNaU3vIE"
  },
  {
    "text": "Ripping 2024 Prizm Football and GIVING AWAY the Hits ðŸ™Œ\n\nThis is 2024 [music] Prism Football. Let's rip it. See if we get Drake May or someone else good. Pack number one. If I get a big card, I'm giving it away right now. Let's see who we get. We got a green coming up. Green Pulsar, Joe Montana on the green pulsar. That's kind of cool. Next pack. We got a silver Kenneth Walker and a green pulsar Eric Allen color match. Pack number three. Looks like we got another green pulsar coming up here. Who's it going to be? Xavier Worthy rookie on the green pulsar. Not bad. Not bad. Drake May. Look at that. Drake May base rookie and a Bon Knicks fireworks rookie. Couple of good ones in that pack. Let's keep it going. Pack number four. Who we getting? Who we getting? Andy Reed. Jimmy Johnson on the silver. Mlennon on the green pulsar and a base. Pack number five. Oh, this one's all turned. Oh, we got a Oh, what's going on here? Oh, what do we got here? What do we got here? We got a thick card in a Dunay green pulsar rookie jersey patch. Hey, that's not bad at all. Let's give that one away. One more pack. See if we get anything else nice here. Josh Allen on the green pulsar. That's fun. We definitely got some cards that are worth giving away to a customer at Cards HQ. Let's go give them away. Would you like some free football cards? >> Sure. >> I just opened these. The Drake May rookie is worth about 15 bucks. >> Nice. I was actually going to get my very first card for him today. There you go. That's amazing. Here you go. We got We got to open up a few packs of uh prison football and there's some nice ones in there. >> Sweet. Thank you so",
    "title": "Ripping 2024 Prizm Football and GIVING AWAY the Hits ðŸ™Œ",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=fh7dCbU-PAw",
    "username": "Sports Card Investor",
    "post_date": "2026-02-12",
    "_logged_date": "2026-02-17T13:37:14.828687",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_fh7dCbU-PAw"
  },
  {
    "text": "I Pulled a Sam Darnold Auto #/15 And Then He Won The Superbowl! ðŸ˜± #shorts\n\nAre you serious? Are you kidding me? You can't write this. Don't know much about him. OBJ. Oh my god. Oh my god. We freaking did it. Are you kidding me? Oh my god. To 15. Oh my god. Are you kidding me? Oh my god. Oh, bro. Are you kidding me? We did it. Are you serious? Are you kidding me? You can't write this. No way. No way, dude. That [clears throat] is crazy. All time break. All time, dude. I'm speechless. Freaking Darnold the 15. Are you kidding me? You can't write this. You can't make this up. It's crazy. >> As long as you believe in yourself, anything's possible.",
    "title": "I Pulled a Sam Darnold Auto #/15 And Then He Won The Superbowl! ðŸ˜± #shorts",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=ui1yyI7hv6s",
    "username": "CardCollector2",
    "post_date": "2026-02-12",
    "_logged_date": "2026-02-17T13:37:34.986998",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_ui1yyI7hv6s"
  },
  {
    "text": "I Ripped 250 PACKS Of Mosaic Football And Pulled 5+ CASE HITS! ðŸ¤¯ *INSANE HITS*\n\n250 packs are in front of me right here. And in today's video, we'll open everyone and find out how many case hits are in these packs. Nobody runs pay nights. I do run nights. >> Mr. Char, how we doing? >> Let's go. Amazing. try to bring that to the next generation to bring it to other people uh to hopefully inspire them. This is not possible without you. All right, what's going on YouTube? Card Collector 2 coming at you here with a brand new video. Ladies and gentlemen, we are back for a major pack rip. Not 50, not 100, not 120 in a blaster case today. 250 packs of Mosaic Football. Mosaic Football Blasters have been some of the best retail product we've ripped. And I want to know how many case hits we can hit today out of Mosaic Blasters. We've done this before in a similar format with 25 Donous Football Retail. Right when we ripped those blasters, we ripped 500 of them and hit a couple of downtowns. I don't want to ruin it if you haven't seen it. But we we hit two of them. We only hit two case hits. There wasn't a lot outside of downtown. It was downtown. That was that was really it. Mosaic has stained glass, honeycomb, Genesis, Micro Mosaic. This one is full of case hits. And I think today we're going to test it, but I think we'll have more case hits than these. Let's start them. 250 packs. We've already opened it. We've already saved a lot of the time. Everything is in piles of 10. 25 piles. 10 packs per. So, this is two cases and I believe two blasters. So, you've got 120 per case. So, we uh we've got over two cases worth of blasters here. So, how many case hits will we get from this break today? I'm going to find out hopefully 10 12. But this will uh this will bring up the question, you know, what's the best retail product to rip. We've done one we've done that video recently and you know, I think that uh that video might be one we have to explore in the future about the best retail product ever. You know, how many of those we uh you know, what does 500 or 250 or a,000 packs of that look like? Might be an expensive video, but could be a fun one. Here you go. First 10. All right. CJ 2K right off the rip. my guy. Joan Jennings auto right off the rip. There we go. Anthony Gold. Not who we're after though. Chop. Abdul Carter. Coloulson Lovelin. That makes a ton of sense. If you know, you know. Derek Stingley. Rookie color. Gray Zable. It's Coulson Loveland or Bust really. Eric Armstre. Drake Hubard. Van Ginkle. CC2 Legend. Luther Bird. Matthew Golden. Robert Brooks. Matthew Golden. That's it. All right. Well, we didn't get a case hit, but you know, we're uh we're one auto in. Just build a pile right there. All right, 10 more. How many do you think we will hit? Comment down below. I would love to uh I would love to know how many you think before we get too deep into this. How many case hits do you think you'll get out of 250? I'm glad we opened all these blasters already because opening the packs is already a decent amount of work. But opening u",
    "title": "I Ripped 250 PACKS Of Mosaic Football And Pulled 5+ CASE HITS! ðŸ¤¯ *INSANE HITS*",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=_5GXNL3othg",
    "username": "CardCollector2",
    "post_date": "2026-02-12",
    "_logged_date": "2026-02-17T13:37:36.812619",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript__5GXNL3othg"
  },
  {
    "text": "NEW RELEASE!  2026 TOPPS SERIES 1 BASEBALL CARDS!  JUMBO BOX!\n\nHey everybody, welcome back to the brand new release preview video. It's the most exciting time of the year, at least if you're a baseball card fan. It is the debut, it's release day of the brand new 2026 Topps flagship. All my cases came flooding in today. We've got jumbos, we've got hobbies, we've got blasters, we've got tins. We're going to be taking a look at each configuration over the next couple days. Today, we'll start with what's always my favorite configuration. and it's the jumbo box. This one's going out to Alex, Alex Strapman. Thank you very much for sponsoring this video. So, let's get right to it. You can see that they have four cover athletes this year. I was kind of disappointed. I was hoping Paul Skins would get it, but I understand it's the 75th anniversary of Topps, their first year ever with those 1951 Topps cards. And here it is, 2026 75 year anniversary. Now, great choices on the cover athletes. Seems like Judge and Otani always get to be cover athletes, but we also have Griffy on there along with Hank Aaron. And one of the new big differences this year with this product, this jumbo box, you're going to notice there's only one auto and one relic card. There's a a missing hit. So, they took away one of the relics. That's I'm at least pleased to announce that's the only thing that seems to have been taken away. There are still 10 packs and 40 cards just like last year. And there's also two silver packs per box. So, they took just a little bit away. Hopefully, that's going to be more than made up by the rookie checklist. And hopefully we can get some good stuff out of here. So, let's get into this without further ado and see what we can find. Our first look of 20 at 2026 Tops series 1. There's your silver packs. They're going to be white this year. And we will have 100 of these bad boys coming up within a week or two once I get all my cases in cuz I can only get I think two from Tops. So, I've placed a whole bunch of orders for more cases from all over the place. And once those all come in, I'll rip them all open, take out the silver packs, and we'll do that that uh that silver pack video and see how good the silver packs are this release. Some releases, they're really, really good. All right, 350 cards in the base set. Let's get into this. Let's tell you the rookies. The best rookie in here that you're looking for is Roman Anthony of the Boston Red Sox. But that's not all. There's a bunch of good ones in here. We've got Jack KaggleÃ³ is another chaser for the Royals. Of course, Bubba Chandler from the Pirates, Nolan Mlan from the New York Mets, you got Kyle Teal and Coulson Montgomery from the White Socks. You've got Sammy Basio from the Orioles. Jonah Tong from the Mets. Chase Burns, second overall pick a couple years ago for the Reds. Jacob Mizowski's in there for the Brew Crew. It's a great set. It's just really really Cam Schlitler in there as well. It's a deep rookie class. So, take a look at the design. What do you think",
    "title": "NEW RELEASE!  2026 TOPPS SERIES 1 BASEBALL CARDS!  JUMBO BOX!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=iL7QuLcrw88",
    "username": "Jabs Family",
    "post_date": "2026-02-11",
    "_logged_date": "2026-02-17T13:37:04.164268",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_iL7QuLcrw88"
  },
  {
    "text": "JABS FAMILY 10 YEAR YOUTUBE ANNIVERSARY BREAKS!\n\ninto the room. I want to set up that ring thing I got. >> Yeah. Let me just I'm just about ready to get go live. We have to restart the charms, too, >> cuz ever since you changed the password on the Wi-Fi, the char Can you tell them to keep it down a little bit, please? >> Yeah. >> Okay. All right, we're ready. Hey everybody, welcome to the official 10year anniversary breaks here on YouTube and whatnot. If you'd like to buy a spot, we are we're simo casting so that you can get involved. If you're on YouTube and you'd like to grab a spot, we've got a link coming up. I haven't put it in there yet because I I was waiting for my daughter for 15 minutes at basketball practice. And so, I'm a little bit of a later start here than I was hoping. So, let me go ahead and get this fixed up real quick and get that link for you. To buy a spot, go to the whatnot feed and it always does this. Instead of copying and pasting the link that I copied, it gives me some random or it gives me all my description for my most recent YouTube video. I just did it again. Kids are all super hyped and wild. You can probably hear them in the background. We're about ready to get started. So, the way this works is we have a $1,000 giveaway tonight. Let me explain it to you so that you understand how it works and maybe one of you will win it. Last time we did this a year or two ago, Chris Randall, who was in here earlier, I saw him say something earlier, he won it last time. So, I have a whole sealed case and I've got 50 cases of these. So, I don't know if we'll ever run out of these. Yeah, I literally have 50 cases of these. It's 2024 Big League. Let me open it up. So, every round is going to have one of these. A couple of rounds have blasters instead. Let me turn the other light on. But, it's a hobby box of 2024 big leagues. So, you're chasing your 2020 for rookies in here like Yamamoto and Ellie de la Cruz and Dominguez. This came out a little earlier in 2024, so no skins in here, but uh everyone has a a box of these. And whoever finds the Jabs family influencer card in their round will we will randomize and one of those 30 teams will get $1,000. So, for example, if the very first round here we hit it, one of those 30 teams will get a,000 bucks. And I I could just PayPal it to you. Or if you don't have PayPal, I can always just send you $1,000 worth of boxes. I can send you whatever you want. Basically, just pick out $1,000 worth of stuff if you don't have PayPal. So, we'll get you paid one way or another. So, we got a whole bunch of these big league boxes here. I'll just put a couple out there maybe as the backdrop. And let's go ahead and get into this. By the way, if no one finds the card, we will random off a 2026 Top Series 1 jumbo box, which I'm due to get those tomorrow. And if two or more people hit a Jabs card, which is unlikely, but in case it does happen, we'll just split the $1,000 evenly. So, hope we can find it tonight. And hopefully we can find some great cards. Bo",
    "title": "JABS FAMILY 10 YEAR YOUTUBE ANNIVERSARY BREAKS!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=WwNBerJwmIk",
    "username": "Jabs Family",
    "post_date": "2026-02-11",
    "_logged_date": "2026-02-17T13:37:05.896817",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_WwNBerJwmIk"
  },
  {
    "text": "Looking for a $60K Joe Montana Rookie in 1981 Topps ðŸ”¥\n\nThis is a sealed box of 1981 Tops football. And if I get lucky, there is a $60,000 Joe Montana rookie card sitting inside this box. We're going back in history. We're going back to 1981 Tops Football, 36 packs, and we're expecting 15 cards per pack. So, 540 cards coming out of this box. Most likely, we will get one of every card. Now, that doesn't mean we actually will get one of every card. Math would suggest we should get one of every card, but chances are we'll probably get two or three of certain ones and zero of other cards. It just kind of depends on how the coalition ended up here. Like, there's a lot of like just kind of 70s, you know. OH, THERE WE GO. That's what I'm talking about, ladies and gentlemen. We hit the Joe Montana rookie card. We got nice looking corners, edges. We've got no surface stains or issues. We are not super well centered, unfortunately. You can see there's a little bit of a shift on the front, the left to right centering. There's slightly more white bar on the left than on the right, but on the top and the bottom, it is even more evident. There's more white bar on the top than the bottom. So, that is unfortunately not well centered enough to get a PSA 10 or probably even a PSA 9. And I think you're probably looking in like PSA 8 territory",
    "title": "Looking for a $60K Joe Montana Rookie in 1981 Topps ðŸ”¥",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=LgJbHMc3_-8",
    "username": "Sports Card Investor",
    "post_date": "2026-02-11",
    "_logged_date": "2026-02-17T13:37:16.686534",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_LgJbHMc3_-8"
  },
  {
    "text": "Trading Over $428,000 In Cards on Veriswap!\n\nI did more than $20,000 in trades on VeraSwap last month, but did I get them wrong? Did my VeraSwap trade partners get the best of me? We're going to debate that, plus some other huge [music] trades on VeraSwap now. [music] Hello sports card investors and welcome to another trade [music] talk with VeraSwap. Teapot. The Veris Swap platform has been absolutely on fire this last month with tons and tons of trades all the way from sub $100 trades all the way up to trades involving cards that are worth tens of thousands of dollars and more. And we're about to dive right in and debate some of the biggest. You ready for this today? >> These are actually my favorite trades so far that we've covered. So, I'm pumped. >> This is a really good spread, including this first one. Let's bring this one up up on the screen to start. We have a Michael Jordan, the classic 1986 Fleer rookie in a BGS95 being traded for a 2019 Prism Kobe Bryant gold number to 10 in a PSA 9 and $14,000 in cash teapot. This is truly a huge trade. What side do you like? I cannot believe how hot Prism Gold cards have gotten over the last few years. It's I don't know if it's absurdity. I I can't wrap my head around you. talking about one of the most iconic cards of all time. Some say the most iconic card in the Jordan rookie and a 2019 Prism Gold Kobe, but you get the cash, but you're talking about almost like a $30,000 valuation on this Kobe based on what those MJs go for. That's mind-blowing to me. I did say a few years ago in a market movers video, I think probably three or four years ago when we were looking at the panini era stuff that I thought among the things that would carry value forward, I thought gold prisms in particular were a strong candidate as well as kabooms and some other things and those have kind of but I didn't expect this level of insanity for this card. And if you're talking about rookie cards, you could go get a PSA 9 Topps chrome refrator of Kobe for the same price as they're valuing this PSA 9 gold prism. You could also get a PSA 10 of a card I know you and I both love, which is that finest airs gold refractor in a PSA 10. There's only 28 of those. >> Or this. >> Yeah, I'd rather have that. >> I'd rather have that. So in this case, like while I love Prism Golds, while I love Kobe, I love $14,000 in cash. I go with the Jordan in this. Even though I know there's a lot of them, I I still got to go with the Jordan. >> I'm glad, Tapot, that we can once again disagree right off the bat. I feel like the last couple of shows we've been too friendly with each other. We agreed on we agreed on too much. I don't agree. I don't agree at all. >> Do you think there's upside? >> I think that I that the Jordan, the 86 Fleer Jordan, there's so many of them out there. And I agree that it is the iconic, you know, Jordan rookie. Well, that and the 84 star, but the 86 Fleer is so many of them out there. And yes, 95 is a great grade on it, no doubt. But the Kobe, I believe that is his l",
    "title": "Trading Over $428,000 In Cards on Veriswap!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=KF_mrXpojGM",
    "username": "Sports Card Investor",
    "post_date": "2026-02-11",
    "_logged_date": "2026-02-17T13:37:18.597566",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_KF_mrXpojGM"
  },
  {
    "text": "Sports Card Investing & Collecting for Beginners (2026) Everything You Need to Know!\n\nIt's the 2026 edition of sports card investing and collecting for beginners. If you're new to the sports card hobby or simply want to sharpen your skills, then this video is for you. Today, I'm going to give you all of the basics you need to know to become a successful sports card investor and collector. Hello sports card investors and collectors and welcome to sports card investing and collecting for beginners. I'm very excited to do this video with you today because sports cards have been my life for the last several years and I absolutely love cards and I absolutely love teaching what I have learned along the way including some hard lessons. And I'm going to be giving some of that to you today to get you started on your own journey. If you don't know me, my name is Jeff Wilson. I'm the founder of this YouTube channel, Sports Card Investor, also the founder of Market Movers, which we'll talk about later in the video. It is an app that helps you track the price of cards and track your collection. And also the founder of Cards HQ, this big card shop behind me here in Atlanta, Georgia, and hopefully more locations of this card shop opening across the nation soon. And between Cards HQ and myself personally, I have bought and sold more than $100 million in sports cards over the last several years. So, I've got a lot of experience, not all good experience, some bad experience, a lot of great lessons to share your way, which we're going to be doing today. We're going to be covering the best sets, the best products, the brands, the manufacturers, how to buy and sell cards, how to find good deals, how to grade cards, the best cards for investment opportunities, and so much more. [snorts] So, let's jump in. The first thing I want to talk about today are the eras of sports cards. We're going to start with a little history lesson because it sets an important foundation for you investing or collecting in sports cards. Most of the video we're going to talk about today will be around ultramodern cars. Ultraodern is considered the era from 2017 through present. And most of the video is going to focus on that because chances are if you're newer getting into sports cards, most of the cards you're seeing, buying, selling, most of those are likely from the ultramodern era. In fact, they're probably from the last year or two. And if you come into a card shop like Cards HQ, a lot of the cards you're going to see on display, and most of the boxes that you might buy to open, they're probably all recent releases, meaning those releases are from the last several months. So all of those cards are going to be from this ultraodderern era. But before we start talking about cards in the present, let's go back to the past and let's talk about vintage cards. Vintage covers all cards that were manufactured prior to 1980. And in fact, vintage goes all the way back to the prewar era, where you'll find, for example, the 1909 T206 Hanis Wagner card, considered by many to be the hol",
    "title": "Sports Card Investing & Collecting for Beginners (2026) Everything You Need to Know!",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=Hy0ADT3U1qE",
    "username": "Sports Card Investor",
    "post_date": "2026-02-10",
    "_logged_date": "2026-02-17T13:37:20.127225",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_Hy0ADT3U1qE"
  },
  {
    "text": "Patrick Mahomes Cards Selling for $12K A PACK? ðŸ˜±\n\nWould you pay $12,000 for one pack of Patrick Mahomes cards? Well, Panini thinks you will as they are releasing 2025 Panini authentically Mahomes and it's listed at $12,000 on Blowout. That 12K gets you one pack with eight cards. Those eight cards include two oncard autos, one other auto, plus gem and memorabilia cards. Now, these are Patrick Mahome's first Panini autographs since 2020, so that's a big deal. But $12,000 when Mahomes is injured and the Chiefs are bad, that seems to me like a tough sell. What do you think? How will the market respond to this? Let me know in the comments.",
    "title": "Patrick Mahomes Cards Selling for $12K A PACK? ðŸ˜±",
    "source": "YouTube (transcript)",
    "url": "https://www.youtube.com/watch?v=GX-1VU3fAtw",
    "username": "Sports Card Investor",
    "post_date": "2026-02-10",
    "_logged_date": "2026-02-17T13:37:21.728232",
    "search_term": "",
    "score": 0,
    "like_count": 0,
    "num_comments": 0,
    "post_id": "yt_transcript_GX-1VU3fAtw"
  }
]